// descriptions took from Emojipedia.org
lang = 'uk';
//use i18n language code of the browser, more details: https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/API/i18n/LanguageCode
titles_language[lang] = {
    '🔍': 'Результати',
    '🕒': 'Найбільш використовувані емодзі',
    '😀': 'Усміхайлики',
    '🙋': 'Люди',
    '🦊': 'Тварини',
    '🅰️': 'Символи',
    '🍎': 'Їжа і напої',
    '🏳️‍🌈': 'Прапори',
    '🏊': 'Спортивні ігри',
    '✈️': 'Мандрівка та місця',
    '🖱️': 'Техніка і офіс',
    '👗': 'Одяг та аксесуари',
    '🖐️': 'Руки та частини тіла',
    '🛎️': 'Інше'
};
emojis_language[lang] = [];
/*search*/
emojis_language[lang][0] = {};
/*smileys*/
emojis_language[lang][2] = {
    '😀': [
        'Висіяти обличчя',
        ':)',
        'Щасливе обличчя',
        'Вираз усміхайлика'
    ],
    '😃': [
        'Висміювання обличчя з великими очима',
        ':D',
        'Щасливе обличчя',
        'Вираз усміхайлика',
        'Посмішка з відкритим ротом'
    ],
    '😄': [
        'Висміювання обличчя з усміхаючими очима',
        'Щасливе обличчя',
        'Вираз усміхайлика',
        'Висміювання обличчя з оченятами',
        'Похмурі обличчя з відкритим ротом та усміхненими очима'
    ],
    '😁': [
        'Очі сяють водоростям',
        'Висміювання обличчя з усміхаючими очима'
    ],
    '😆': [
        'Висіти з шилінгу',
        'xD',
        '><',
        'Біг-Грін',
        'Усмішка закритими очима',
        'Сміх',
        'Змішання обличчя з кричущими закритими очима',
        'Захоплення обличчя з відкритим ротом і тонко закритими очима'
    ],
    '😅': [
        'Усміхнений обличчя з піт',
        'Вправа',
        'Щасливий попіл',
        'Висміювання обличчя з очей і акуратним ударом',
        'Любов обличчя з відкритими ротом і холодним піт'
    ],
    '🤣': [
        'ROFL',
        'Веселися на підлозі'
    ],
    '😂': [
        'Обличчя зі сльозами Джоя',
        'Сміх',
        'Смішний плач',
        'Смішні сльози',
        'Лол'
    ],
    '🙂': [
        'Трохи хрипіння',
        ':)',
        'Трохи щасливий',
        'Це добре'
    ],
    '🙃': [
        'Upside-Down Face',
        'Sarcasm',
        'Silly',
        'У напрямку до обличчя'
    ],
    '😉': [
        'Вигойдалка',
        ';)',
        'Підморгнути',
        'Ефект підморгнути',
        'Лице Вінкі'
    ],
    '😊': [
        'Металеві обличчя з усміхаючими очима',
        '^^',
        'Щасливе обличчя',
        'Посмішка',
        'Вираз усміхайлика'
    ],
    '😇': [
        'Обличчя з Halo',
        'Янгол',
        'Гало'
    ],
    '🥰': [
        'Хрипи з серцями',
        'У очах кохання',
        'Посмішка обличчя з усміхненими очима та трьома серцями'
    ],
    '😍': [
        'Посмішка з очима серця',
        '*.*',
        'Очі серця',
        'Серце обличчя',
        'Посмішка з обличчя з гострим очима'
    ],
    '🤩': [
        'Стар-Струк',
        'Схвильований',
        'Зоряні очі',
        'Старрі Еед',
        'Обличчя вау',
        'Обличчя зоряними очима',
        'Висміювання обличчя з зірками очима'
    ],
    '😘': [
        'Обличчя пронесіть поцілунок',
        ':*',
        ':-*',
        'Поцілунок Клоу A',
        'Художній поцілунок',
        'Поцілунок',
        'Обличчя кидає поцілунок'
    ],
    '😗': [
        'Обличчя поцілунків',
        ':*',
        ':-*',
        'Обличчя качки',
        'Kissy Face',
        'Свист'
    ],
    '☺️': [
        'Обличчя посміхання',
        'Щасливе обличчя',
        'Вираз усміхайлика',
        'Посмішка',
        'Обличчя біле усмішка'
    ],
    '😚': [
        'Поцілунок закритими очима',
        'Поцілунок обличчя',
        'Kissy Face'
    ],
    '😙': [
        'Обличчя поцілунків з усміхаючими очима',
        'Поцілунок обличчя',
        'Kissy',
        'Свисток',
        'Свист'
    ],
    '😋': [
        'Їжа для очистки',
        'Гуфі',
        'Гунгрі',
        'Листі вказівки усміхнені',
        'Заворушення смаку їжі',
        'Юм Юм'
    ],
    '😛': [
        'Обличчя з язиком',
        ':P',
        'Брутальний',
        'Обличчя язика',
        'Тонге Аут',
        'Обличчя з яскравим голосом'
    ],
    '😜': [
        'Підморгнути обличчя з язиком',
        ';П',
        'Божевільний',
        'Божевільні обличчя',
        'Вигойдаючи, обличчя з голом духом',
        'Обличчя в голому язику і підморгування очей'
    ],
    '🤪': [
        'Zany Face',
        'Божевільні очі',
        'Схвильований',
        'Дика партія',
        'Goofy Face',
        'Сісти в обличчя з одним великим і одним малим очима'
    ],
    '😝': [
        'Віч-на-всього — обличчя з язиком',
        'хП',
        'Язик',
        'Обличчя та щойно закриті очі',
        'Обличчя автострадою та сильно закритими очима'
    ],
    '🤑': [
        'Лис для гроші-рота',
        ':$',
        'Долар Очі жестів',
        'Грошовий вираз',
        'Багатий'
    ],
    '🤗': [
        'Затискаючи обличчя',
        'Відтінок',
        'Горлінг',
        'Цигани',
        'Щасливого обличчя з обіймами'
    ],
    '🤭': [
        'Ой',
        'Обличчя об об рота',
        'Невдоволені обличчя з усміхненими очима та ручний рот'
    ],
    '🤫': [
        'Шх',
        'Шуш',
        'Глибоке обличчя',
        'Спадщина',
        'Тихо',
        'Тиша',
        'Беззвучний',
        'Обличчя з закритими пальцями'
    ],
    '🤔': [
        'Що',
        '?',
        'Гмм',
        'На обличчі',
        'Чин Томб',
        'Мислитель',
        'Метальна тінь'
    ],
    '🤐': [
        'Поштовий індекс',
        'Ефект зіппер-Мута',
        'На розверху',
        'Запечатані губи',
        'Поштовий індекс',
        'Обличчя з зіппер-ротом'
    ],
    '🤨': [
        'Обличчя з червоним списом',
        'Кольбер',
        'Скеля',
        'Обличчя з вихованим бровом',
        'Обличчя з одним бровою'
    ],
    '😐': [
        'Нейтральне обличчя',
        ':|',
        'Обличчя з прямим ротом',
        'Прямо наштовхнуто'
    ],
    '😑': [
        'Без виразності',
        '-_-',
        'Обличчя з прямим ротом',
        'Пряме обличчя'
    ],
    '😶': [
        'Обличчя без рота',
        'Обличчя порожнє',
        'Леза',
        'Тиша',
        'Беззвучний'
    ],
    '😏': [
        'Обличчя усміхнення',
        'Флірт',
        'Сексуальна поверхня',
        'Обличчя Смуг',
        'Сугестивна посмішка'
    ],
    '😒': [
        'Обличчя за назвою',
        'Незадоволені',
        'Погано',
        'Синус-Око',
        'Не визначено'
    ],
    '🙄': [
        'Обличчя з крутими очима',
        'Вертіти Оком'
    ],
    '😬': [
        'Обличчя гриба',
        'Незграбна',
        'Eek',
        'У горі',
        'Нервус',
        'Анонімна суміш для користувача #1'
    ],
    '🤥': [
        'Обличчя',
        'Брехун, мов',
        'Велика носа',
        'Pinocchio'
    ],
    '😌': [
        'Обличчя в очах',
        'Зміст',
        'Задоволений'
    ],
    '😔': [
        'Вибачте',
        'Наступне обличчя',
        'Наступ',
        'Сум',
        'Садова особа',
        'Ссумний',
        'Сумне обличчя'
    ],
    '😪': [
        'Сліпі обличчя',
        'Біт-Сльоз',
        'Пузир'
    ],
    '🤤': [
        'Слина',
        'Drooling Face',
        'Drool'
    ],
    '😴': [
        'Нічне обличчя',
        'Зз',
        'Спляче обличчя',
        'Хропіння',
        'Обличчя Ззз'
    ],
    '🥱': ['Зява'],
    '😷': [
        'Обличчя з медичною маскою',
        'Коронавірус',
        'КОВІД-19',
        'Обличчя маски',
        'Маска хірургії'
    ],
    '🤒': [
        'Обличчя з Термометром',
        'Ill',
        'Хворий'
    ],
    '🤕': [
        'Обличчя з Head-Bandage',
        'Руйнівник',
        'Зневіра',
        'Травмовано'
    ],
    '🤢': [
        'Нісенітниця',
        'Відраза',
        'Зелена обличчя',
        'Воміт'
    ],
    '🤮': [
        'Фокус на лиці',
        'Спів',
        'Bleah',
        'Bleurgh',
        'Юк',
        'Юки',
        'Ев',
        'Спів',
        'Покидання вгору',
        'Воміт',
        'Обличчя з відкритим ротом блювотами'
    ],
    '🤧': [
        'Чхання',
        'Gesundheit'
    ],
    '🥵': [
        'Гаряча поверхня',
        'Огрівання'
    ],
    '🥶': [
        'Обличчя холодного',
        'Холодний',
        'Холодний',
        'Крижане обличчя'
    ],
    '🥴': [
        'Дерев\'яне обличчя',
        'Обличчя п\'яного',
        'Обличчя з нездоланними очима та Вейві рот'
    ],
    '😵': [
        'Dizzy Face',
        'Очі вибличчя',
        'Очі крутих очей'
    ],
    '🤯': [
        'Вибухова голова',
        'Розумний Клоун',
        'Закріплена обличчя з вибухом голови'
    ],
    '🤠': [
        'Ковбойський капелюх',
        'Ковбой',
        'Лице Ковбой',
        'Обличчя з капелюхом ковбоя'
    ],
    '🥳': [
        'Створення партнерства обличчя',
        'Обличчя партії',
        'Обличчя з рогом і капелюхом Партії'
    ],
    '😎': [
        'Посмішка на обличчя з сонцезахисні окуляри',
        'Холодний',
        'Спільні найкращі друзі (Snapchat)',
        'Сонцезахисні окуляри'
    ],
    '🤓': [
        'Обличчя Нерда',
        'Nerdy'
    ],
    '🧐': ['Обличчя з моноклом'],
    '😕': [
        'Обличчя затвердження',
        ':/',
        ':S',
        'Неплюсовані',
        'Запущено'
    ],
    '😟': [
        'Турбана лице',
        ':(',
        'Сум',
        'Садова особа'
    ],
    '🙁': [
        'Блискавка до Ульоту',
        ':(',
        'Трохи сумний'
    ],
    '☹️': [
        'Метання обличчя',
        ':(',
        'Мегафрон',
        'Обличчя біле'
    ],
    '😮': [
        'Воу',
        ':O',
        'Боже мій!',
        'Обличчя з відкритим ротом',
        'Відкритий рот',
        'Здивований обличчя з відкритим ротом'
    ],
    '😯': [
        'Затискається обличчя',
        ':O',
        'Сюрприз',
        'Здивований обличчя'
    ],
    '😲': [
        'Стиснута обличчя',
        ':O',
        'Воу',
        'Приголомшлива Обличчя',
        'Обличчя п\'яного',
        'Обличчя Гаспінгу'
    ],
    '😳': [
        'Зрубане обличчя',
        ':$',
        'Обличчя розмивання',
        'Збентежений',
        'Сором',
        'Обличчя з широкими відкритими очима'
    ],
    '🥺': [
        'Обличчя в Пседі',
        ':(',
        'Початок',
        'Очі словникові',
        'Simp',
        'Обличчя з повіями'
    ],
    '😦': [
        'Метання обличчя з відкритим ротом',
        'Д:',
        'Поява'
    ],
    '😨': [
        'Катарта',
        'Д:',
        'Химерне обличчя',
        'Здивований'
    ],
    '😰': [
        'Тривожна лице з попілом',
        'Синя поверхня',
        'Обличчя ж',
        'Нервус Обличчя',
        'Обличчя з відкритим ротом і холодним піт'
    ],
    '😥': [
        'Сумно, але обличчя у злодіїв',
        ':\'(',
        'Бровий піт',
        'Обезцілена, але обличчя в залі'
    ],
    '😢': [
        'Обличчя',
        ':\'(',
        'Плач',
        'Сльоза'
    ],
    '😭': [
        'Повільно плач',
        'Bawling',
        'Плач',
        'Сумно Сльози',
        'Sobbing'
    ],
    '😱': [
        'Крик обличчя в страху',
        'Сам удома',
        'Крик',
        'Обличчя крику'
    ],
    '😖': [
        'Обличчя схвалене',
        'Квіверінг Рот',
        'Вищеплено обличчя'
    ],
    '😣': [
        'Обличчя особистості',
        'Обличчя з безплідним',
        'Викрадані очі'
    ],
    '😞': [
        'Зруйнована лице',
        ':(',
        'Сум',
        'Садова особа'
    ],
    '😓': [
        'Зливання з Попілом',
        'Жорстка робота',
        'Обличчя сонця',
        'Обличчя з холодним пітом'
    ],
    '😩': [
        'Холодні обличчя',
        'Обличчя в космосі',
        'Вітрила'
    ],
    '😫': [
        'Виступова обличчя',
        'Виснаження',
        'Віддано',
        'Обличчя в космосі'
    ],
    '😤': [
        'Обличчя за допомогою Steam',
        'Аеропорт Грівансів',
        'Руйнівні',
        'Божевільне обличчя',
        'Стежити',
        'Формування від гніву гнізда'
    ],
    '😡': [
        'Привид на лице',
        'Сердитий обличчя',
        'Обличчя Ґрумпі',
        'Божевільне обличчя',
        'Червона поверхня'
    ],
    '😠': [
        'Сердитий обличчя',
        'Сердитий',
        'Обличчя Ґрумпі'
    ],
    '🤬': [
        'Ноутбук',
        '@#$%&!',
        'Обличчя з символами роту',
        'Лайка',
        'Кюзінг',
        'Grawlix',
        'Обличчя з символами над ротом',
        'Серйозні обличчя з символами роту'
    ],
    '🥲': ['Обличчя з сльозами'],
    '😮‍💨': [
        'Face Exhaling',
        'Sigh'
    ],
    '😵‍💫': [
        'Face with Spiral Eyes',
        'Dizzy Face'
    ],
    '🥸': ['Обличчя замасковані'],
    '😈': [
        'Любовна лице з рогами',
        'Диявол',
        'Ріг Диявола',
        'Щасливий Диявол',
        'Бузковий Диявол',
        'Червоний диявол'
    ],
    '👿': [
        'Злий лице з рогами',
        'Диявол',
        'Ріг Диявола',
        'Бузковий Диявол',
        'Бузковий Гоблін',
        'Сумний диявол',
        'Imp'
    ],
    '🤡': [
        'Обличчя Клоуна',
        'Жахлива клоун',
        'Злий Клоун',
        'Страшний клоун'
    ],
    '👽': [
        'Чужий',
        'ET'
    ],
    '👾': [
        'Чужий монстр',
        'Космічний інвуадер',
        'Відеогральний монстр'
    ],
    '🤖': [
        'Robot',
        'Обличчя робота'
    ],
    '👹': [
        'Ogre',
        'Обличчя маски',
        'Oni',
        'Червоний монстр',
        'Огр японський'
    ],
    '👻': [
        'Привид',
        'Halloween'
    ],
    '🗣️': [
        'Голова',
        'Менсплейнінг',
        'Крик',
        'Крик',
        'Говорити голові в Силуеті'
    ],
    '👤': [
        'Погруддя в Силуеті',
        'Тінь',
        'Silhouette',
        'Користувач',
        'Силует Перський'
    ],
    '🫂': ['Люди Хуггінг'],
    '👥': [
        'Пориви силуету',
        'Тіні',
        'Silhouettes',
        'Спільноти',
        'Силует двох людей'
    ]
};
/*people*/
emojis_language[lang][3] = {
    '👶{{skin_tone}}': [
        'Дитина',
        'Дитина',
        'Малюк'
    ],
    '🧒{{skin_tone}}': [
        'Дитина',
        'Гендерне нейтральне дитя'
    ],
    '👧{{skin_tone}}': ['Дівчина'],
    '🧑{{skin_tone}}': [
        'Особа',
        'Гендерний нейтралітет',
        'Дорослий'
    ],
    '👱{{skin_tone}}': [
        'Особисті зачіпки: Волосся',
        'Біляве волосся',
        'Блонд',
        'Людина з блонду',
        'Персон з Блонд-Хер',
        'Чоловік з блондом Хайром'
    ],
    '👨{{skin_tone}}': [
        'Чоловік',
        'Чоловік',
        'Вуса'
    ],
    '🧔{{skin_tone}}': [
        'Чоловік: Борода',
        'Борода',
        'Бородата людина',
        'Бородата людина'
    ],
    '👨{{skin_tone}}‍🦰': [
        'Червоні волосся',
        'Джинґер',
        'Man Redhead',
        'Людина з червоним волоссям'
    ],
    '👨{{skin_tone}}‍🦱': [
        'Кучеряве волосся',
        'Людина з кучерявим волоссям'
    ],
    '👨{{skin_tone}}‍🦳': [
        'Біле волосся',
        'Людина з сірим волоссям'
    ],
    '👨{{skin_tone}}‍🦲': [
        'Чоловік: Балд',
        'Людина без волосся'
    ],
    '👩{{skin_tone}}': [
        'Жінка',
        'Жінка',
        'Леді',
        'Жовта жінка'
    ],
    '👩{{skin_tone}}‍🦰': [
        'Червоне волосся',
        'Жінка з імбиря',
        'Woman Redhead',
        'Жінка з червоною зачіска'
    ],
    '👩{{skin_tone}}‍🦱': [
        'Кучеряве волосся',
        'Жінка з кучерявим волосся'
    ],
    '👩{{skin_tone}}‍🦳': [
        'Біле волосся',
        'Жінка з сірим волосся'
    ],
    '👩{{skin_tone}}‍🦲': [
        'Жінка: бард',
        'Жінка без волосся'
    ],
    '👱{{skin_tone}}‍♀️': [
        'Волосся',
        'Жінка з блондом Хайром'
    ],
    '👱{{skin_tone}}‍♂️': [
        'Чоловік: Волосся',
        'Чоловік з блондом Хайром'
    ],
    '🧓{{skin_tone}}‍': [
        'Старша людина',
        'Гендерний нейтральний дорослий'
    ],
    '👴{{skin_tone}}‍': [
        'Старий Чоловік',
        'Людина похилого віку',
        'Grandpa',
        'Старша людина'
    ],
    '👵{{skin_tone}}‍': [
        'Стара жінка',
        'Жінка похилого віку',
        'Бабуся',
        'Нанна',
        'Бабця',
        'Старша жінка'
    ],
    '👼{{skin_tone}}‍': [
        'Дитячий янгол',
        'Янгол',
        'Cherub',
        'Амур',
        'Путто'
    ],
    '🎅{{skin_tone}}‍': [
        'Санта-Клаус',
        'Святий Миколай',
        'Sinterklaas',
        'Пан Клаус'
    ],
    '🤶{{skin_tone}}‍': [
        'Місіс Клаус',
        'Пані Клаус'
    ],
    '🤴{{skin_tone}}‍': ['Принц'],
    '👸{{skin_tone}}‍': [
        'Принцеса',
        'Жірка блонде',
        'Дівчина з короною',
        'Дівчина з Тіарою'
    ],
    '👳{{skin_tone}}‍♂️': ['Чоловіча бродяга'],
    '👳{{skin_tone}}‍♀️': ['Жінка-пилосося'],
    '👲{{skin_tone}}‍': [
        'Персон з Skullcap',
        'Азійська людина',
        'Людина з китайською шапочкою',
        'Людина з Га Пі Мао'
    ],
    '🧕{{skin_tone}}‍': [
        'Жінка з хусткою',
        'Hijab',
        'Персон з Headscarf'
    ],
    '🤵{{skin_tone}}‍': [
        'Персон-ін-Тушедо',
        'Groom',
        'Людина в костюмі',
        'Чоловік у TTuxedo'
    ],
    '👰{{skin_tone}}‍': [
        'Персон з Вейлом',
        'Наречена',
        'Наречена з вуаль'
    ],
    '👰{{skin_tone}}‍♂️': ['Чоловік з вуаль'],
    '👰{{skin_tone}}‍♀️': ['Жінка з Вейлом'],
    '👩{{skin_tone}}‍🍼': ['Малюк, що боїться в жінці'],
    '👨{{skin_tone}}‍🍼': ['Чоловік годує немовля'],
    '🥷': ['Ніндзя'],
    '🤰{{skin_tone}}‍': [
        'Жінка-вагітна',
        'Вагітність',
        'Прегнантна леді'
    ],
    '🤱{{skin_tone}}‍': [
        'Годування груддю',
        'Годування груддю'
    ],
    '🦸{{skin_tone}}‍♂️': ['Чоловік Супергерой'],
    '🦸{{skin_tone}}‍‍♀️': ['Жінка-супергерой'],
    '🦹{{skin_tone}}‍‍♂️': ['Чоловік із супервіллен'],
    '🦹{{skin_tone}}‍‍♀️': ['Жінка-лиходій'],
    '🧙{{skin_tone}}‍': [
        'Маг',
        'Sorcerer',
        'Суворство',
        'Відьма',
        'Майстер'
    ],
    '🧙{{skin_tone}}‍‍♀️': [
        'Жінка-маг',
        'Відьма',
        'Суворство'
    ],
    '🧚{{skin_tone}}‍‍♂️': ['Чоловік з феї'],
    '🧚{{skin_tone}}‍♀️': ['Жінка з феї'],
    '🧛{{skin_tone}}‍♂️': [
        'Ман Вампір',
        'Дракула'
    ],
    '🧛{{skin_tone}}‍‍♀️': ['Жіночий вампір'],
    '🧜{{skin_tone}}‍♂️': ['Мерман'],
    '🧜{{skin_tone}}‍♀️': ['Русалка'],
    '🧝{{skin_tone}}‍♂️': ['Ман Ельф'],
    '🧝{{skin_tone}}‍♀️': ['Жінка-ельф'],
    '🧞‍♂️': ['Man Genie'],
    '🧞‍♀️': ['Woman Genie'],
    '🕵️{{skin_tone}}‍♂️': [
        'Людина детектив',
        'Приватне око',
        'Sleuth',
        'Шпигун',
        'Man Sleuth',
        'Сонце або шпигун',
        '007',
        'Інспектор'
    ],
    '🕵️{{skin_tone}}‍♀️': ['Жінка-детектив'],
    '💂{{skin_tone}}‍': [
        'Охорона',
        'Британський гвардсмен',
        'Фут-Вартовий'
    ],
    '💂{{skin_tone}}‍‍♀️': ['Жіноча гвардія'],
    '👮{{skin_tone}}‍': [
        'Поліцейський офіцер',
        'Поліцейський',
        'Поліція',
        'Поліцейський',
        'Поліціантка'
    ],
    '👮{{skin_tone}}‍‍♀️': ['Офіцер з жіночої поліції'],
    '👨{{skin_tone}}‍🚒': ['Людина пожежника'],
    '👩{{skin_tone}}‍‍🚒': ['Жінка-пожежник'],
    '👨{{skin_tone}}‍‍✈️': ['Чоловік-пілот'],
    '👩{{skin_tone}}‍‍✈️': ['Жінка-пілот'],
    '👨{{skin_tone}}‍💻': [
        'Людина технологічний',
        'Людина технологічний'
    ],
    '👩{{skin_tone}}‍💻': ['Жінка-технології'],
    '👨{{skin_tone}}‍🎤': [
        'Чоловік із співака',
        'Bowie',
        'Aladdin Sane'
    ],
    '👩{{skin_tone}}‍🎤': ['Зінгер'],
    '👨{{skin_tone}}‍🎨': ['Чоловік-художник'],
    '👩{{skin_tone}}‍🎨': ['Жінка-художник'],
    '👷{{skin_tone}}‍‍♂️': ['Конструкціонер'],
    '👷{{skin_tone}}‍‍♀️': ['Конструкціонер жінки'],
    '👨{{skin_tone}}‍‍🚀': [
        'Ман Астронавт',
        'Чоловік Космонавт'
    ],
    '👩{{skin_tone}}‍‍🚀': [
        'Жіночий астронавт',
        'Жінка-космонавт'
    ],
    '👨{{skin_tone}}‍‍🔬': ['Чоловік учений'],
    '👩{{skin_tone}}‍‍🔬': ['Жінка-вчений'],
    '👨{{skin_tone}}‍💼': [
        'Службовець',
        'Генеральний директор',
        'Бізінесман'
    ],
    '👩{{skin_tone}}‍💼': [
        'Жіночий офіс',
        'Бізінесжінка',
        'Генеральний директор'
    ],
    '👨{{skin_tone}}‍🏭': ['Чоловічий завод'],
    '👩{{skin_tone}}‍‍🏭': ['Жіночий завод'],
    '👨{{skin_tone}}‍‍🔧': ['Мен-Механік'],
    '👩{{skin_tone}}‍‍🔧': ['Жіночий механік'],
    '👨{{skin_tone}}‍‍🍳': [
        'Ман Кук',
        'Ман Шеф',
        'Чол. шеф'
    ],
    '👩{{skin_tone}}‍‍🍳': [
        'Жінка кухарка',
        'Жіночий шеф',
        'Жіноча шеф-кухня'
    ],
    '👨{{skin_tone}}‍‍🌾': ['Чоловічий фермер'],
    '👩{{skin_tone}}‍‍🌾': ['Жіночий фермер'],
    '👨{{skin_tone}}‍‍⚖️': ['Суддя'],
    '👩{{skin_tone}}‍‍⚖️': ['Жіночий суддя'],
    '👨{{skin_tone}}‍‍🏫': ['Учителька'],
    '👩{{skin_tone}}‍‍🏫': ['Учителька'],
    '👨{{skin_tone}}‍🎓': ['Людина-студент'],
    '👩{{skin_tone}}‍🎓': ['Жіночий студент'],
    '👨{{skin_tone}}‍‍⚕️': [
        'Здоров\'я',
        'Чол. доктор',
        'Чол. медсестра'
    ],
    '👩{{skin_tone}}‍⚕️': [
        'Працівники здоров\'я жінки',
        'Жіночий Доктор',
        'Жіноча сестра'
    ],
    '🤷{{skin_tone}}‍♂️': [
        'Чоловік стискання',
        'дивна людина',
        'dunno'
    ],
    '🤷{{skin_tone}}‍♀️': [
        'Жінка зникає',
        'вся жінка',
        'dunno'
    ],
    '🤦{{skin_tone}}‍♂️': ['Фацепалг'],
    '🤦{{skin_tone}}‍♀️': ['Жінка Фацепалмінг'],
    '🙇{{skin_tone}}‍‍♂️': ['Мен Баукс'],
    '🙇{{skin_tone}}‍‍♀️': ['Жінка-пляма'],
    '🧏{{skin_tone}}‍♂️': ['Людина-глух'],
    '🧏{{skin_tone}}‍‍♀️': ['Жінка-глухий'],
    '🙋{{skin_tone}}‍‍♂️': [
        'Чоловік виховання рук',
        'Щасливий чоловік похитуючи одну руку'
    ],
    '🙋{{skin_tone}}‍♀️': [
        'Жінка виховання рук',
        'Щаслива жінка з підвищенням однієї руки'
    ],
    '💁{{skin_tone}}‍♂️': [
        'Рука удару',
        'Інформаційний центр людини'
    ],
    '💁{{skin_tone}}‍♀️': [
        'Жінка, накидаюча рука',
        'Біля інформаційного центру'
    ],
    '🙆{{skin_tone}}‍♂️': ['Man Gesturing OK'],
    '🙆{{skin_tone}}‍♀️': ['Жінка-жестикуляр OK'],
    '🙅{{skin_tone}}‍♂️': ['Не наймит людина'],
    '🙅{{skin_tone}}‍♀️': ['Ніяких жіночих жертв'],
    '🙎{{skin_tone}}‍♂️': ['Чоловік із Поутінгу'],
    '🙎{{skin_tone}}‍‍♀️': ['Жінка велірство'],
    '🙍{{skin_tone}}‍‍♂️': ['Man Frowning'],
    '🙍{{skin_tone}}‍‍♀️': ['Жіночий потоп'],
    '🧟‍‍♂️': ['Чоловік Зомбі'],
    '🧟‍‍♀️': ['Жінка-зомбі'],
    '🚶{{skin_tone}}‍♂️': ['Чоловіча ходьба'],
    '🚶{{skin_tone}}‍♀️': ['Жінка йде'],
    '🧍{{skin_tone}}‍‍♂️': ['Чоловік що стоїть'],
    '🧍{{skin_tone}}‍‍♀️': ['Жінка, що сідає'],
    '🧎{{skin_tone}}‍♂️': ['Ман Нелінг'],
    '🧎{{skin_tone}}‍‍♀️': ['Жінка-плетун'],
    '👨{{skin_tone}}‍🦯': ['Людина з білою палицею'],
    '👩{{skin_tone}}‍🦯': ['Жінка з білою паличкою'],
    '👨{{skin_tone}}‍🦼': ['Людина у моторейному візку'],
    '👩{{skin_tone}}‍🦼': ['Жінка у моторизованому візку'],
    '👨{{skin_tone}}‍🦽': ['Людина в ручному візку'],
    '👩{{skin_tone}}‍🦽': ['Жінка за кермом вручну'],
    '👯‍♂️': ['Люди з вушками'],
    '👯‍♀️': ['Жінки з вушками кролика'],
    '🕴️{{skin_tone}}‍': [
        'Персон у костюмі в Левітації',
        'Наклейний чоловік',
        'Руд Бой',
        'Walt Jabsco',
        'Людина у діловому костюмі'
    ],
    '🧖{{skin_tone}}‍♂️': [
        'Чоловік у Steamy Кімнаті',
        'Людина у сауні'
    ],
    '🧖{{skin_tone}}‍♀️': [
        'Жінка у Steamy кімнаті',
        'Жінка в сауні'
    ],
    '👫{{skin_tone}}‍': [
        'Жінка і людина Холдинг Руки',
        'Купель Гетеросексуального',
        'Прямий купіль',
        'Чоловік і жінка Холдинг руками'
    ],
    '👭{{skin_tone}}‍': [
        'Куполь лесбіянки',
        'Жінки утримують руки',
        'Дві жінки тримати руки'
    ],
    '👬{{skin_tone}}‍': [
        'Чоловіки утримують руки',
        'Гей-купель',
        'Двоє чоловіків утримують руки'
    ],
    '👨‍👩‍👦': [
        'Родина в Матері, отця і сина',
        'Сім\'я: Чоловік, жінка, хлопчик'
    ],
    '👨‍👩‍👧': [
        'Родина з мамою, батьком і дочкою',
        'Сім\'я: Людина, жінка, дівчина'
    ],
    '👨‍👩‍👧‍👦': [
        'Сімейство в матері, отче, син і дочка',
        'Сім\'я: Людина, Жінка, дівчина, хлопчик'
    ],
    '👨‍👩‍👦‍👦': [
        'Родина з мамою, батьком і двома синами',
        'Сім\'я: Чоловік, жінка, хлопчик'
    ],
    '👨‍👩‍👧‍👧': [
        'Родина в Мати й батька та дві дочки',
        'Сім\'я: Людина, Жінка, дівчина, дівчина'
    ],
    '👨‍👨‍👦': [
        'Сім\'я з двома отцями і сином',
        'Людина, чоловіче, хлопчик'
    ],
    '👨‍👨‍👧': [
        'Родина з двома отцями і дочкою',
        'Сім\'я: Людина, людина, дівчина'
    ],
    '👨‍👨‍👧‍👦': [
        'Сімейство з двома Отцями, сином і дочкою',
        'Сім\'я: людина, дівчина, хлопчик'
    ],
    '👨‍👨‍👦‍👦': [
        'Сім\'я з двома отцями та двома синами',
        'Сім\'я: Чоловік, хлопчик'
    ],
    '👨‍👨‍👧‍👧': [
        'Родина з двома отцями і двома дочками',
        'Сім\'я: Людина, дівчина, дівчина'
    ],
    '👩‍👩‍👦': [
        'Родина з двома матерями і сином',
        'Сім\'я: Жінка, жінка'
    ],
    '👩‍👩‍👧': [
        'Родина з двома матерями та дочкою',
        'Сім\'я: Жінка, Жінка, дівчина'
    ],
    '👩‍👩‍👧‍👦': [
        'Сімейство з двома матерцями, сином і дочкою',
        'Сім\'я: Жінка, Жінка, дівчина'
    ],
    '👩‍👩‍👦‍👦': [
        'Родина з двома матерями та двома синами',
        'Сім\'я: Жінка, жінка хлопчик'
    ],
    '👩‍👩‍👧‍👧': [
        'Сім\'я разом з двома матерями та двома дочками',
        'Сім\'я: Жінка, жінка, дівчина, дівчина'
    ],
    '👨‍👦': [
        'Родина з батьком і сином',
        'Людина, хлопчик'
    ],
    '👨‍👦‍👦': [
        'Сім\'я: Чоловік, хлопчик',
        'Сім\'я з батьком і двома синами'
    ],
    '👨‍👧': [
        'Родина з батьком і дочкою',
        'Сім\'я: Людина, дівчина'
    ],
    '👨‍👧‍👦': [
        'Сімейство з отцем, сином і дочкою',
        'Сім\'я: людина, дівчина, хлопця'
    ],
    '👨‍👧‍👧': [
        'Сім\'я з батьком і двома дочками',
        'Сім\'я: Людина, дівчина, дівчина'
    ],
    '👩‍👦': [
        'Родина з матір\'ю і сином',
        'Сім\'я: Жінка, хлопчик'
    ],
    '👩‍👦‍👦': [
        'Родина з матір\'ю та двома синами',
        'Сім\'я: Жінка, хлопчик'
    ],
    '👩‍👧': [
        'Родина з матір\'ю та дочкою',
        'Сім\'я: Жінка, дівчина'
    ],
    '👩‍👧‍👦': [
        'Сімейство в матері, сина та дочці',
        'Сім\'я: Жінка, дівчинка, хлопчик'
    ],
    '👩‍👧‍👧': [
        'Родина з матір\'ю та двома дочками',
        'Сімея: Жінка, дівчина, дівчина'
    ],
    '💑': [
        'Пара з серцем',
        'Пара кохання',
        'Парфура',
        'Людина і жінка з серцем'
    ],
    '👨‍❤️‍👨': [
        'Двоє людей з серцем',
        'Зв\'язані з серцем: чоловік, людина'
    ],
    '👩‍❤️‍👩': [
        'Дві жінки з серцем',
        'Жінка, жінка'
    ],
    '💆{{skin_tone}}‍‍♂️': ['Чоловік, що користується головою'],
    '💆{{skin_tone}}‍♀️': ['Жінка, що здобуває голова масаж'],
    '💇{{skin_tone}}‍‍♂️': ['Людина, що приймає зачіски'],
    '💇{{skin_tone}}‍‍♀️': ['Жінка, що приймає зачіску'],
    '🛌{{skin_tone}}‍': [
        'Спляче житло',
        'Особа в ліжку',
        'Сплячий сон'
    ]
};
/*animals*/
emojis_language[lang][4] = {
    '😺': [
        'Кот Ґрінінґ',
        ':)',
        'Щаслива кішка',
        'Сміхотворний кіт',
        'Щасливі обличчя кота',
        'Скам\'янілий кіт з відкритим ротом'
    ],
    '😸': [
        'Плавильний кіт з усміхненими очима',
        ':D',
        'Кот Ґрінінґ',
        'Щаслива кішка',
        'Обличчя кота'
    ],
    '😹': [
        'Кіт із списами Джой',
        ':\')',
        'Щасливі торти',
        'Смішний Кіт'
    ],
    '😻': [
        'Сміхотворний кіт з очима серця',
        '*.*',
        'Кіт із сердечними очима',
        'Кохання кота',
        'Лице з усміхненими очима з серцем'
    ],
    '😼': [
        'Кет із гарною посмішкою',
        'Чат зі свербленням',
        'Обличчя з усмішкою',
        'Котяча особа з гарною посмішкою'
    ],
    '😽': [
        'Кит поцілунковий',
        ':*',
        'Обличчя кота поцілунків',
        'Котисельні обличчя з закритими очима'
    ],
    '🙀': [
        'Холодний кіт',
        ':O',
        'Кат',
        'Кат на крику',
        'Крик обличчя кішок в страху',
        'Холостий кіт'
    ],
    '😿': [
        'Плач кота',
        ':\'(',
        'Сумний кіт',
        'Обличчя кота'
    ],
    '😾': [
        'Кіт-Путінг',
        'Grumpy Cat',
        'Лице з листом гидоти'
    ],
    '🙈': [
        'Мавпа',
        'Не злий мавпа',
        'Мізару',
        'Мавпячі вигнуті очі'
    ],
    '🙉': [
        'Мавпа',
        'Слух — незлий мавпа',
        'Kikazaru',
        'Мавпячі вуха'
    ],
    '🙊': [
        'Мавпа',
        'Мовець — не злий мавпа',
        'Івадзару',
        'Мавпячий ковпак рот',
        'Без озвучування'
    ],
    '🐵': [
        'Мавпа',
        'Поверхня мавпи',
        'Голова мавпи'
    ],
    '🐒': [
        'Мавпа',
        'Мавпа Цілком'
    ],
    '🦍': ['Gorilla'],
    '🐶': [
        'Обличчя собаки',
        'Собака',
        'Цуцик'
    ],
    '🐕': [
        'Собака',
        'Doggo',
        'Akita Inu'
    ],
    '🦮': [
        'Бачив собаку ока',
        'Туман'
    ],
    '🐕‍🦺': ['Сервісний собака'],
    '🐩': [
        'Пудель',
        'Собака',
        'Мініатюрні капсули',
        'Стандартна пудель',
        'Іграшка пудель'
    ],
    '🐺': [
        'Вовк',
        'Обличчя вовка'
    ],
    '🦊': [
        'Лисиця',
        'Лисенітниця'
    ],
    '🦝': ['Єнот'],
    '🐱': [
        'Обличчя кішок',
        ':3',
        'Кіттен',
        'Кітті'
    ],
    '🐈': [
        'Кішка',
        'Домашня кішка',
        'Фелін',
        'Усека'
    ],
    '🐈‍⬛': ['Чорна Кішка'],
    '🦁': [
        'Лев',
        'Обличчя лев'
    ],
    '🐯': [
        'Обличчя тигра',
        'Милий тигр'
    ],
    '🐅': [
        'Тигр',
        'Бенгал Тайгер'
    ],
    '🐆': [
        'Leopard',
        'Африканський леопард',
        'Jaguar'
    ],
    '🐴': [
        'Обличчя коня',
        'Голова коня'
    ],
    '🐎': [
        'Кінь',
        'Галлопінг',
        'Рейкінь'
    ],
    '🦄': [
        'Єдиноріг',
        'Обличчя єдинорога'
    ],
    '🦓': [
        'Zebra',
        'Обличчя Зебра'
    ],
    '🦌': [
        'Оленеві',
        'Бак',
        'Різдвяний Олень',
        'Stag'
    ],
    '🐮': [
        'Обличчя корови',
        'Корова',
        'Щаслива корова'
    ],
    '🐂': [
        'Бик',
        'Булл',
        'Буллок',
        'Оксен',
        'Штайр'
    ],
    '🐃': [
        'Водне буфало',
        'Баффало',
        'Внутрішній Водна Буфало'
    ],
    '🐄': [
        'Корова',
        'Молочарня корова'
    ],
    '🐷': [
        'Обличчя свині',
        'Свиня',
        'Порося голова'
    ],
    '🐖': [
        'Свиня',
        'Круг',
        'Sow'
    ],
    '🐗': [
        'Кабан',
        'Бородавочник',
        'Дикий векор',
        'Дика свиня'
    ],
    '🐽': ['Свиня Носе'],
    '🐏': [
        'Ram',
        'Вівця'
    ],
    '🐑': [
        'Ewe',
        'Lamb',
        'Вівця'
    ],
    '🐐': ['Коза'],
    '🐪': [
        'Верблюд',
        'Арабський камель',
        'Дромедарі Камель',
        'Однодамп камель'
    ],
    '🐫': [
        'Двогамм-камель',
        'Азійський верблюд',
        'Бактріан Кемел'
    ],
    '🦙': [
        'Llama',
        'Alpaca'
    ],
    '🦒': [
        'Giraffe',
        'Giraffe Face'
    ],
    '🐘': ['Слон'],
    '🦏': [
        'Rhinoceros',
        'Rhino'
    ],
    '🦛': [
        'Hippopotamus',
        'Hippo'
    ],
    '🐭': [
        'Лице мишки',
        'Миша'
    ],
    '🐁': [
        'Миша',
        'Вовчкові',
        'Гризуни',
        'Миші'
    ],
    '🐀': [
        'Щур',
        'Гризуни'
    ],
    '🐹': [
        'Хом\'яки',
        'Обличчя Гамстера'
    ],
    '🐰': [
        'Обличчя кролика',
        'Великодній заєць'
    ],
    '🐇': [
        'Кролі',
        'Bunny',
        'Кролик кріликовий'
    ],
    '🐿️': [
        'Бурундук',
        'Вивіркові'
    ],
    '🦔': ['Хеджхог'],
    '🦇': [
        'Кажан',
        'Бетмен'
    ],
    '🐻': [
        'Ведмідь',
        'Ведмеді обличчя',
        'Тедді Ведмідь'
    ],
    '🐨': [
        'Коала',
        'Обличчя Коала'
    ],
    '🐼': [
        'Панда',
        'Обличчя панди'
    ],
    '🦘': [
        'Кенгуру',
        'Ро'
    ],
    '🦡': ['Беджер'],
    '🦃': [
        'Індик',
        'Індичка до Дня Подяки',
        'Дика Туреччина'
    ],
    '🐔': [
        'Курка',
        'Hen'
    ],
    '🐓': [
        'Кок',
        'Rooster',
        'Півник'
    ],
    '🐣': [
        'Висиджування чику',
        'Маленька курка',
        'Чік Гетчінг'
    ],
    '🐤': [
        'Бебі Чик',
        'Жовтий птах'
    ],
    '🐥': [
        'Фронт-Фасинг',
        'Бебі Чик',
        'Стендінг'
    ],
    '🐦': ['Птахи'],
    '🐧': ['Penguin'],
    '🕊️': [
        'Голуб',
        'Голуб миру'
    ],
    '🦅': [
        'Орел',
        'Білоголовий орлан'
    ],
    '🦆': ['Присісти'],
    '🦢': ['Лебідь'],
    '🦉': ['Совоподібні'],
    '🦚': ['Павич'],
    '🦜': ['Папуга'],
    '🐸': [
        'Жаба',
        'Жаба',
        'Жаб\'яче обличчя'
    ],
    '🐊': [
        'Крокодил',
        'Алігатор',
        'Крок'
    ],
    '🐢': [
        'Черепаха',
        'Tortoise'
    ],
    '🦎': [
        'Ящірки',
        'Гецко'
    ],
    '🐍': [
        'Змія',
        'Змій'
    ],
    '🐲': [
        'Обличчя Дракона',
        'Голова дракона'
    ],
    '🐉': ['Дракон'],
    '🦕': [
        'Завропод',
        'Brachiosaurus',
        'Brontosaurus',
        'Dinosaur'
    ],
    '🦖': [
        'T-Rex',
        'Tyrannosaurus Rex'
    ],
    '🐳': [
        'Дурений кит',
        'Милий кит'
    ],
    '🐋': ['Кит'],
    '🐬': ['Дельфін'],
    '🐟': [
        'Риба',
        'Прісноводна риба'
    ],
    '🐠': [
        'Тропічна риба',
        'Риба',
        'Жовтоблакитна риба'
    ],
    '🐡': [
        'Риба-клоун',
        'Fugu',
        'Риба-фугу'
    ],
    '🦈': [
        'Акула',
        'Велика біла іскарка'
    ],
    '🐙': ['Восьминіг'],
    '🐚': [
        'Спіральний снаряд',
        'Черепашка',
        'Оболонка'
    ],
    '🐌': [
        'Равлик',
        'Мітка',
        'Садовий равлик'
    ],
    '🦋': ['Метелик'],
    '🐛': [
        'Помилка',
        'Гусениця',
        'Комаха'
    ],
    '🐜': [
        'Ant',
        'Помилка',
        'Комаха'
    ],
    '🐝': [
        'Медова бджола',
        'Бджола',
        'Bumblebee'
    ],
    '🐞': [
        'Леді-жук',
        'Ladybird',
        'Ladybug',
        'Помилка'
    ],
    '🦗': [
        'Крикет',
        'Коник'
    ],
    '🕷️': ['Павук'],
    '🦂': ['Скорпіон'],
    '🦟': ['Комарі'],
    '🦀': ['Краб'],
    '🦞': ['Лобстери'],
    '🦐': [
        'Шрімп',
        'Prawn'
    ],
    '🦑': ['Кальмари'],
    '🦧': ['Orangutan'],
    '🦥': ['Лещачі'],
    '🦦': ['Otter'],
    '🦨': ['Скунс'],
    '🦬': ['Бізон'],
    '🦣': ['Мамонт'],
    '🦫': ['Бобер'],
    '🐻‍❄️': ['Полярний ведмідь'],
    '🦤': ['Dodo'],
    '🦭': ['Запечатка'],
    '🪲': ['М\'ясо Жука'],
    '🪳': ['Таргани'],
    '🪰': ['Політ'],
    '🪱': ['Хробак'],
    '🦩': ['Фламінго']
};
/*symbols*/
emojis_language[lang][5] = {
    '💘': [
        'Серце зі стрілою',
        'Купідна стріла',
        'Lovestruck'
    ],
    '💝': [
        'Серце з стрічка',
        'Шоколадний ящик',
        'Подарункова Коробка',
        'Подарункове серце'
    ],
    '💖': [
        'Sparkling Heart',
        'Серце свята',
        'Блискуче серце',
        'Зоряне серце'
    ],
    '💗': [
        'Зростаюче серце',
        'Множичне серце',
        'Потрійне серце'
    ],
    '💓': [
        'Биття серця',
        'Сигнал серця',
        'Heartbeat',
        'Wi-Fi Серце'
    ],
    '💞': [
        'Револьверні серця',
        'Два серця'
    ],
    '💕': [
        'Два серця',
        'Маленькі серця',
        'Два рожеві серця'
    ],
    '💟': ['Прикраса серця'],
    '❣️': [
        'Вигук серця',
        'Серце над краплями',
        'Червоне серце як марка оклику',
        'Виключення Важкого серця Марка Орнір'
    ],
    '💔': [
        'Зламане серце',
        'Ластове серце',
        'Гробовик',
        'Серце зламалося'
    ],
    '❤️': [
        'Я тебе кохаю',
        'Червоне серце',
        'Серце',
        'Любовне серце',
        'Червоне серце'
    ],
    '🧡': [
        'Помаранчеве Серце',
        'Я тебе кохаю'
    ],
    '💛': [
        'Жовте серце',
        '#1 шлаф',
        'Золоте Серце',
        'Я тебе кохаю'
    ],
    '💚': [
        'Зелене серце',
        'Озлобите серце',
        'Я тебе кохаю'
    ],
    '💙': [
        'Синє серце',
        'Я тебе кохаю'
    ],
    '💜': [
        'Пурпурне Серце',
        'Я тебе кохаю'
    ],
    '🖤': [
        'Чорне серце',
        'Темне серце',
        'Я тебе кохаю'
    ],
    '🤍': [
        'Біле серце',
        'Я тебе кохаю'
    ],
    '🤎': [
        'Коричневе серце',
        'Я тебе кохаю'
    ],
    '💯': [
        'Очки Сто',
        '100',
        '%',
        'Тримайте це 100',
        'Досконала оцінка',
        'Символ верхніх точок'
    ],
    '💬': [
        'Мовна куля',
        'Чат Чат',
        'Булька Мовлення'
    ],
    '💭': [
        'Думала куля',
        'Мислення бульбашки',
        'Думки'
    ],
    '💤': [
        'Зз',
        'Бедтим',
        'Буріння',
        'Сон',
        'Сплячий покажчик',
        'Символ сплячого режиму'
    ],
    '♠️': [
        'Паростковий костюм',
        'Spades',
        'Black Spade Suit'
    ],
    '♥️': [
        'Костюм серця',
        'Карта з серцем',
        'Серця',
        'Костюм Чорного Серця'
    ],
    '♦️': [
        'Діамантовий костюм',
        'Ромби',
        'Чорний Діамантовий костюм'
    ],
    '♣️': [
        'Костюм клубу',
        'Трефа',
        'Костюм Чорного клубу'
    ],
    '🏧': [
        'Знак банкомату',
        'Банкомат',
        'Автоматизована машина Теллера'
    ],
    '🎵': [
        'Музична нотатка',
        'Смачная пари восьмих нотаток',
        'Красуня кваверів',
        'Музична примітка'
    ],
    '🎶': [
        'Нотатки',
        'Музика',
        'Музичні нотатки',
        'Спів',
        'Кілька музичних нотаток'
    ],
    '🔔': [
        'Дзвін',
        'Дзвін Свободи',
        'Ringer',
        'Весільний дзвін'
    ],
    '🔕': [
        'Дзвін із слеском',
        'Сповіщення',
        'Дзвінок вимкнено',
        'Приглушений дзвін',
        'Белл з суцільним розчином'
    ],
    '🔈': [
        'Низька гучність динаміка',
        'Об\'єм',
        'Динамік'
    ],
    '🔉': [
        'Середній гучність динаміка',
        'Зменшити гучність',
        'Гучномовець з середнім гучністю',
        'Динамік з однією хвилею'
    ],
    '🔊': [
        'Висока гучність динаміка',
        'Збільшити гучність',
        'Гучномовець з трьома звуковими хвилями'
    ],
    '🔇': [
        'Приглушений динамік',
        'Вимкнути звук',
        'Гучномовець з обрисом скасування'
    ],
    '⛔': ['Немає записів'],
    '🚫': [
        'Заборонено',
        'Забанений',
        'Бекслеш Кола',
        'Ні',
        'Червоне коло перейшло',
        'Обмежений',
        'Немає підпису запису'
    ],
    '🚳': [
        'Немає велосипедів',
        'Знак велосипедів не знайдено'
    ],
    '🚭': [
        'Паління немає',
        'Немає куріння символів'
    ],
    '🚯': [
        'Без лайкерів',
        'Без Litter символів'
    ],
    '🚱': [
        'Непотенційна вода',
        'Без води',
        'Немає питної води',
        'Символ непридатної води'
    ],
    '🚷': [
        'Немає пішоходів',
        'Немає людей',
        'Ходьба немає'
    ],
    '🔞': [
        'Ніхто не знаходиться під тринадцятою',
        'ПНС',
        'Ніхто не знаходиться під довжиною вісімнадцяти символів',
        '18'
    ],
    '📵': [
        'Немає телефонів для мобільних телефонів',
        'Немає телефонів в продажу',
        'Немає телефонів',
        'Немає смартфонів'
    ],
    '☢️': [
        'Radioactive',
        'Міжнародний символ випромінювання',
        'Ядерне',
        'Радіоактивний знак'
    ],
    '☣️': [
        'Біогазар',
        'Знак біотеги'
    ],
    '⬆️': [
        'Стрілка вгору',
        'Вгору по стрілці',
        'Верхня Чорна стріла'
    ],
    '↗️': [
        'Верхня права стріла',
        'Діагональна верхня права стріла',
        'Північна Східна стріла'
    ],
    '➡️': [
        'Стрілка праворуч',
        'Вправо на стрілку',
        'Чорна стріла'
    ],
    '↘️': [
        'Нижня ліва стріла',
        'Діагональна нижня права стріла',
        'Південно-Східна стріла'
    ],
    '⬇️': [
        'Стрілка вниз',
        'Вниз зі стрілками',
        'Нижня Чорна стріла'
    ],
    '↙️': [
        'Нижня ліва стріла',
        'Діагональна нижня стріла ліворуч',
        'Саут-Вест-Стріла'
    ],
    '⬅️': [
        'Стрілка вліво',
        'Вліво по стрілках',
        'Ліва Чорна стріла'
    ],
    '↖️': [
        'Верхня ліва стріла',
        'Діагональна Стрілка вгору-ліворуч',
        'Північна Західна стріла'
    ],
    '↕️': [
        'Верхня Стріла',
        'Вертикальні стрілки',
        'Стрілка вниз'
    ],
    '↔️': [
        'Ліва права стріла',
        'Горизонтальні стрілки',
        'На узбіччі стрілки',
        'Ліва стрілка'
    ],
    '↩️': [
        'Ліва лінія правої стрілки',
        'Надіслати відповідь',
        'Ліва вигнута стріла',
        'Стріли з Гаком'
    ],
    '↪️': [
        'Стрілка вправо',
        'Переслати',
        'Права вигнута стріла',
        'Стріла з Гаком'
    ],
    '⤴️': [
        'Вирівнювання правої стрілки вгору',
        'Стрілка в пункт призначення вперед і повороти вгору'
    ],
    '⤵️': [
        'Стрілка вниз',
        'Вигнута стріла вниз',
        'Стрілка з направленою стрілкою вниз'
    ],
    '🔃': [
        'За годинниковою стрілкою',
        'За годинниковою стрілкою вниз та вгору відкриті круглі стрілки'
    ],
    '🔄': [
        'Проти-годинникова стрілка',
        'Оновити',
        'Обертати',
        'Перемкнути',
        'Проти годинникової стрілки',
        'Проти годинникової стрілки вниз та вгору відкрити коло стріл'
    ],
    '🔙': [
        'Задня стріла',
        'Відмінити',
        'Назад з лівою стрілою вище'
    ],
    '🔚': [
        'Стрілка в кінці',
        'Кінець',
        'Завершити з лівою стрілою вище'
    ],
    '🔛': [
        'ВК! Стріла',
        'Увімк',
        'Увімкнути за допомогою позначки виключення з лівої правої стрілки'
    ],
    '🔜': [
        'Скоро стріла',
        'Незабаром',
        'Скоро з направленою стрілою над'
    ],
    '🔝': [
        'Стрілка вгорі',
        'Верх',
        'Верхня — Стрілка над'
    ],
    '🛐': [
        'Місце поклоніння',
        'Релігійний корпус'
    ],
    '⚛️': ['Символ Atom'],
    '🕉️': [
        'Символ Om',
        'Ом',
        'Aumkara',
        'Omkara',
        'Pranava'
    ],
    '✡️': [
        'Зірка Давида',
        'Маген Девід'
    ],
    '☸️': [
        'Колесо Карми',
        'Гелм'
    ],
    '☯️': ['Yin Yang'],
    '✝️': [
        'Латинський хрест',
        'Християнський хрест'
    ],
    '☦️': ['Православний хрест'],
    '☪️': ['Зірка і Півмісяць'],
    '☮️': [
        'Символ миру',
        'Знак миру'
    ],
    '🕎': [
        'Менора',
        'Candelabrum',
        'Свічки',
        'Чанукія',
        'Менора',
        'Менора з дев\'ятьма гілками'
    ],
    '🔯': [
        'Шестиставкова зірка з крапкою',
        'Шестизарядна зірка з середнім Дотом'
    ],
    '♈': [
        'Овен',
        'Зодіак'
    ],
    '♉': [
        'Taurus',
        'Зодіак'
    ],
    '♊': [
        'Gemini',
        'Зодіак'
    ],
    '♋': [
        'Рак',
        'Зодіак'
    ],
    '♌': [
        'Лев',
        'Зодіак'
    ],
    '♍': [
        'Діва',
        'Зодіак'
    ],
    '♎': [
        'Лібра',
        'Зодіак'
    ],
    '♏': [
        'Скорпіон',
        'Скорпіон',
        'Зодіак'
    ],
    '♐': [
        'Sagittarius',
        'Зодіак'
    ],
    '♑': [
        'Козоріг',
        'Зодіак'
    ],
    '♒': [
        'Водолій',
        'Зодіак'
    ],
    '♓': [
        'Pisces',
        'Зодіак'
    ],
    '⛎': [
        'Змієносця',
        'Зодіак'
    ],
    '⏭️': [
        'Чорний правий прямокутник з вертикальною лінією',
        'Пропустити символ Вперед',
        'Наступна кнопка маршруту'
    ],
    '⏮️': [
        'Чорний лівий точковий подвійний трикутник з вертикальною рискою',
        'Пропустити символ назад',
        'Кнопка останньої пісні',
        'Попередня композиція'
    ],
    '⏯️': [
        'Чорний правий прямокутник з подвійною вертикальною рискою',
        'Кнопка паузи',
        'Символи Грати',
        'Символ паузи'
    ],
    '🔀': [
        'Кнопка перемішувати треки',
        'Скручені стріли'
    ],
    '🔁': [
        'Повторення кнопки',
        'Символ циклу',
        'Ретвіт',
        'За годинниковою стрілкою та стрілою ліворуч'
    ],
    '🔂': [
        'Повторити одну кнопку',
        'Стріли з номером 1',
        'Повторення символу',
        'Повторіть окремий символ окремого маршруту',
        'За годинниковою стрілкою та стрілою ліворуч з кружкою одним накриттям'
    ],
    '▶️': [
        'Кнопка Відтворення',
        'Правий трикутник',
        'Право-пунктирний трикутник',
        'Чорний правий прямокутник'
    ],
    '◀️': [
        'Кнопка зворотного виклику',
        'Лівий трикутник',
        'Ліво-полярний трикутник',
        'Чорний лівий трикутник'
    ],
    '🔼': [
        'Кнопка вгору',
        'Вгору Трикутник',
        'Аппайнтинг-трикутник',
        'up-Pointing маленький червоний трикутник'
    ],
    '🔽': [
        'Кнопка вниз',
        'Нижній трикутник',
        'Великий трикутник',
        'Великий червоний трикутник'
    ],
    '⏩': [
        'Швидка кнопка Вперед',
        'Перемотати вперед',
        'Символ швидкого переходу',
        'Чорний правий прямокутник опори'
    ],
    '⏪': [
        'Fast Reverse Button',
        'Rewind',
        'Символ перемотування',
        'Чорний лівий вказівник подвійний трикутник'
    ],
    '⏫': [
        'Швидка кнопка Вгору',
        'up-Pointing подвійний трикутник',
        'Чорний прямокутник "Двійковий трикутник"'
    ],
    '⏬': [
        'Швидка кнопка вниз',
        'Подвійний трикутник вниз',
        'Чорний униз для розгляду подвійного трикутника'
    ],
    '⏹️': [
        'Кнопка Stop Button',
        'Зупинити',
        'Зупинити символ',
        'Чорний квадрат для Стопа'
    ],
    '⏏️': [
        'Кнопка виймання',
        'Eject Symbol'
    ],
    '🎦': [
        'Кінофільм',
        'Екран',
        'Фільми',
        'Кінофільм',
        'Символ кінотеатру',
        'Запис'
    ],
    '📶': [
        'Антена Барс',
        'Бали на повторення',
        'Рівень сигналу',
        'Stairs',
        'Символ підвищеної Сили',
        'Антена з барами'
    ],
    '✖️': [
        'Помножити',
        'Символ множення',
        'Важкий Множення X'
    ],
    '➕': [
        'Плюс',
        'Символ плюс',
        'Знак важкого Plus'
    ],
    '➖': [
        'Minus',
        'Minus Symbol',
        'Знак важкого мінімуму'
    ],
    '➗': [
        'Розділити',
        'Символ дивізіону',
        'Знак важкої дивізія'
    ],
    '♾️': [
        'Нескінченність',
        'Постійний паперовий знак'
    ],
    '‼️': [
        'Подвійна позначка виключення',
        'Подвійна позначка червоної оклику'
    ],
    '⁉️': [
        'Марка питання щодо оклику',
        'Марка червона знака і питання'
    ],
    '❓': [
        'Марк питання',
        'Марка червоного питання',
        'Чорне питання і Марк Орнір'
    ],
    '❔': [
        'Марка Білих питань',
        'Марка Білих питань',
        'Орнір білих питань'
    ],
    '❗': [
        'Марка оклику',
        'Марка червона окликання',
        'Символи знаку Жорсткого Виключення'
    ],
    '❕': [
        'Марка білої оклику',
        'Виключення Білих Марків Орнір'
    ],
    '⭕': [
        'Порожнє червоне коло',
        'Коло',
        'Правильно',
        'Червоне коло',
        'Марка',
        'Велике коло'
    ],
    '☑️': [
        'Прапорець з позначкою',
        'V',
        'Прапорець',
        'Відмітити у полях',
        'Шафа для балоту з галочкою'
    ],
    '✔️': [
        'Позначка',
        'V',
        'Перевірити',
        'Відмітити',
        'Checkmark',
        'Марка ваг'
    ],
    '❌': [
        'Берег',
        'Кросс',
        'Ікс'
    ],
    '✅': [
        'Кнопка позначки',
        'V',
        'Марка зеленого позначки',
        'Зелений Тик',
        'Позначка',
        'Марка Білого Важки'
    ],
    '❎': [
        'Кнопка перехресного позначки',
        'Кросс',
        'Ікс',
        'X позначка',
        'Марка негативного квадратного хреста'
    ],
    '#️⃣': [
        'Знак номера ключа',
        '#',
        'Хеш ключ',
        'Хештег',
        'Восьминіг',
        'Фунтовий ключ',
        'Числовий знак'
    ],
    '*️⃣': [
        'Keycap Asterisk',
        'Зоряний келих'
    ],
    '0️⃣': [
        'Число 0',
        'Keycap Digit Zero'
    ],
    '1️⃣': [
        'Цифра 1',
        'Цифровий номер один'
    ],
    '2️⃣': [
        'Число 2',
        'Ідентифікатор ключа 2'
    ],
    '3️⃣': [
        'Цифра 3',
        'Три ключа цифрового ключа'
    ],
    '4️⃣': [
        'Цифра 4',
        'Цифровий номер чотири'
    ],
    '5️⃣': [
        'Цифра 5',
        'Ключ-цифровий номер п\'ять'
    ],
    '6️⃣': [
        'Номер 6',
        'Ключар Digit шість'
    ],
    '7️⃣': [
        'Число 7',
        'Keycap Digit Seven'
    ],
    '8️⃣': [
        'Цифра 8',
        'Вісім розрядів ключів'
    ],
    '9️⃣': [
        'Номер 09',
        'Число цифрового ключа'
    ],
    '🔟': [
        'Номер 10',
        'Keycap: 10',
        '10',
        'Десять ключів'
    ],
    '🔠': [
        'Input Latin Uppercase',
        'АБЛОН',
        'Верхній регістр',
        'Введіть символ для верхнього регістру символів',
        'Вхідний символ для латинських літер'
    ],
    '🔡': [
        'Input Latin Lowercase',
        'абкорд',
        'Нижній регістр',
        'Символ вводу для малих літер',
        'Вхідний символ для латинських малих листів'
    ],
    '🔢': [
        'Input Numbers',
        '1234',
        'Номери',
        'Numeric Input',
        'Введіть символ для цифр'
    ],
    '🔣': [
        'Введіть символ для символів',
        'Символи',
        'Введення символу'
    ],
    '🔤': [
        'Input Latin Letters',
        'абв',
        'Абетка',
        'Літери',
        'Введіть символ для букв',
        'Введіть символ для латинських літер'
    ],
    '🅰️': [
        'Кнопка (тип крові)',
        'Кров А',
        'Буква А',
        'Негативний квадратний латино-столичний лист А'
    ],
    '🆎': [
        'AB кнопка (тип крові)',
        'Листи В',
        'Тип крові АВ',
        'Негативний квадрат AB'
    ],
    '🅱️': [
        'Кнопка B (тип крові)',
        'Буква Б',
        'Кров Б',
        'Негативний квадрат латино-столичного листа Б'
    ],
    '🆑': [
        'Кнопка CL',
        'Очистити',
        'Кнопка очищення',
        'Підписка CL',
        'Квадратний CL',
        'Літери CL'
    ],
    '🆒': [
        'Крута кнопка',
        'Холодна площа',
        'Класний знак',
        'Холодний квадрат'
    ],
    '🆓': [
        'Вільна кнопка',
        'Безкоштовно',
        'Безкоштовний покажчик',
        'Квадратний фрі'
    ],
    'ℹ️': [
        'Інформація про нас',
        'Інформація',
        'Малі літери я',
        'Інформація туриста',
        'Джерело інформації'
    ],
    '🆔': [
        'Кнопка ID',
        'ID',
        'Ідентифікація',
        'Ідентифікаційний знак',
        'Квадратний ID'
    ],
    '🆕': [
        'Нова кнопка',
        'Новий',
        'Новий вказівник',
        'Розгорнутий новий'
    ],
    '🅾️': [
        'Кнопка O (тип крові)',
        'Група крові О',
        '0',
        'Негативний квадрат латино-столичного листа',
        'Буква О'
    ],
    '🆗': [
        'Кнопка OK',
        'ОК',
        'Добре',
        'Квадрат',
        'Підпис',
        'У квадратному обсязі'
    ],
    '🅿️': [
        'Кнопка P',
        'Знак стоянки',
        'Негативний квадрат латино-столичного листа',
        'Буква P'
    ],
    '🆘': [
        'Кнопка SOS',
        'Сигнальний сигнал',
        'Аварійний',
        'SOS',
        'Підписка SOS',
        'Квадратний SOS',
        'Довідка'
    ],
    '🆙': [
        'Кнопка вгору!',
        'Підняти рівень',
        'Вгору',
        'Зареєструватися',
        'Зібрано з позначкою оклику'
    ],
    '🆚': [
        'Кнопка Vs',
        'Квадратний Vs'
    ],
    '🆖': [
        'NG кнопка',
        'Квадратний НГ',
        'Немає хорошого підпису',
        'Немає хорошого',
        'NG',
        'Блупер'
    ],
    '🔴': [
        'Червоне коло',
        'Велике червоне коло'
    ],
    '🟠': [
        'Помаранчеве коло',
        'Велике Помаранчеве коло'
    ],
    '🟡': [
        'Жовте коло',
        'Велике жовте коло'
    ],
    '🟢': [
        'Зелене коло',
        'Велике зелене коло'
    ],
    '🔵': [
        'Блакитне коло',
        'Велике синє коло'
    ],
    '🟣': [
        'Бузкове коло',
        'Велике фіолетове коло'
    ],
    '🟤': [
        'Коричневе коло',
        'Велике коричневе коло'
    ],
    '⚫': [
        'Чорне коло',
        'Середнє чорне коло'
    ],
    '⚪': [
        'Біле коло',
        'Середнє біле коло'
    ],
    '🟥': [
        'Красна площа',
        'Велика Червона площа'
    ],
    '🟧': [
        'Помаранчева площа',
        'Велика Помаранчева площа'
    ],
    '🟨': [
        'Жовта площа',
        'Велика жовта площа'
    ],
    '🟩': [
        'Зелений квадрат',
        'Велика зелена площа'
    ],
    '🟦': [
        'Синій квадрат',
        'Велика синя площа'
    ],
    '🟪': [
        'Бузкова площа',
        'Велика фіолетова площа'
    ],
    '🟫': [
        'Коричнева площа',
        'Велика коричнева площа'
    ],
    '⬛': ['Чорна велика площа'],
    '⬜': ['Біла велика площа'],
    '◼️': ['Чорний середній квадрат'],
    '◻️': ['Білий середній квадрат'],
    '◾': ['Чорний середній квадрат'],
    '◽': ['Біла маленька площа'],
    '▪️': ['Чорний малий квадрат'],
    '▫️': ['Біла маленька площа'],
    '💠': [
        'Діамантова фігура з крапкою на стороні',
        'Різноманітність',
        'Алмазна квітка',
        'Каваї'
    ],
    '🔶': ['Великий Помаранчевий Діамант'],
    '🔷': ['Великий синій алмаз'],
    '🔸': ['Маленький оранжевий діамант'],
    '🔹': ['Синій алмаз'],
    '🔺': [
        'Червоний трикутник угору',
        'Верхньополярний червоний трикутник'
    ],
    '🔻': [
        'Червоний трикутник опустився вниз',
        'Донизу належний червоний трикутник'
    ],
    '🔳': ['Кнопка Білого квадрату'],
    '🔲': ['Чорна квадратна кнопка'],
    '©️': [
        'Авторське право',
        'Підписка на авторські права'
    ],
    '®️': [
        'Зареєстровано',
        'Зареєструватися'
    ],
    '™️': [
        'Марка угоди',
        'Пам\'ять перекладів',
        'Торгова марка',
        'Торговий знак'
    ],
    '🛅': [
        'Лівий багаж',
        'Сумка з ключем',
        'Заблокована валіза'
    ],
    '🛄': ['Багажна угода'],
    '🛃': ['Митниця'],
    '🛂': [
        'Управління паспортом',
        'Контроль кордону'
    ],
    '🚰': [
        'Символ води з можливістю',
        'Спрага',
        'Тридцять',
        'Водопровідний кран',
        'Водяний аусет'
    ],
    '🇦': [
        'Буква А',
        'Символ-індикатора області А'
    ],
    '🇧': [
        'Буква Б',
        'Символ-індикатора області B'
    ],
    '🇨': [
        'Буква C',
        'Символ-індикатора області C'
    ],
    '🇩': [
        'Літера D',
        'Символ-індикація області D'
    ],
    '🇪': [
        'Буква E',
        'Символ-індикатора області E'
    ],
    '🇫': [
        'Буква F',
        'Символ-індикатора області F'
    ],
    '🇬': [
        'Буква G',
        'Символ-індикація області G'
    ],
    '🇭': [
        'Буква Н',
        'Символ-індикатора області H'
    ],
    '🇮': [
        'Лист I',
        'Символ-індикація області ІІ'
    ],
    '🇯': [
        'Лист J',
        'Символ-індикатора області J'
    ],
    '🇰': [
        'Буква K',
        'Символи області вказівника символів K'
    ],
    '🇱': [
        'Літера L',
        'Символ-індикатора області L'
    ],
    '🇲': [
        'Буква М',
        'Символи символа регіонального індикатора М'
    ],
    '🇳': [
        'Літера N',
        'Символ-індикатора області літери N'
    ],
    '🇴': [
        'Буква О',
        'Символи-індикатора регіонів'
    ],
    '🇵': [
        'Буква P',
        'Символ-індикатора області літери P'
    ],
    '🇶': [
        'Літера Q',
        'буква символу області регіону'
    ],
    '🇷': [
        'Буква В',
        'Символ-індикація області R символів'
    ],
    '🇸': [
        'Літера S',
        'Символ-індикатора області S'
    ],
    '🇹': [
        'Буква Т',
        'Символ-індикація області T'
    ],
    '🇺': [
        'Буква U',
        'Символ-індикатора області U'
    ],
    '🇻': [
        'Буква V',
        'Символ-індикатора області V'
    ],
    '🇼': [
        'Літера W',
        'Символ-індикатора області W'
    ],
    '🇽': [
        'Буква X',
        'Символ-індикатора області X'
    ],
    '🇾': [
        'Буква Y',
        'Символ-індикатора області Y'
    ],
    '🇿': [
        'Буква Z',
        'Символ-індикатора області Z'
    ],
    '💌': [
        'Лист від кохання',
        'Конверт серця',
        'Нотатка кохання'
    ],
    '🚮': [
        'Покладіть Litter в його місце символів',
        'Блискавка в Кошику',
        'Помістіть літер у Кошик',
        'Особа зі смітником'
    ],
    '♿': [
        'Символ коліщатка',
        'Доступ до ванноми'
    ],
    '🚹': [
        'Символ Менса',
        'Символ чоловіків',
        'Менс Туалет',
        'Чоловіча відлуння',
        'Чоловіча паличка'
    ],
    '🚺': [
        'Символ жінок',
        'Символ жінок',
        'Жінки Туалет',
        'Жіночий туалет',
        'Фамале-WC'
    ],
    '🚻': [
        'Вбиральня',
        'Знак ванної кімнати',
        'Знак Туалету',
        'Знак WC'
    ],
    '🚼': [
        'Символи Немовлят',
        'Ремонтна станція',
        'Символи, які змінюють дитину',
        'Дитячі ясла'
    ],
    '🚾': [
        'Конслот для води',
        'Тиждень',
        'Тойлет WC'
    ],
    '⚠️': [
        'Попереджувальний знак',
        'Символ сповіщення'
    ],
    '🚸': [
        'Перехрестя дітей',
        'Перехрестя дітей',
        'Тривога за школу'
    ],
    '🔅': [
        'Символ низької яскравості',
        'Кнопка затемнення',
        'Зменшити яскравість'
    ],
    '🔆': [
        'Символ високої яскравості',
        'Збільшення яскравості',
        'Яскрава кнопка'
    ],
    '📳': [
        'Режим вібрації',
        'Серце телефону',
        'Беззвучний режим'
    ],
    '📴': ['Мобільний телефон вимкнено'],
    '〰️': [
        'Хвиля',
        'Хвилі'
    ],
    '💱': ['Обмін валют'],
    '💲': [
        'Символ важкого долара',
        'Долар',
        'Знак долара'
    ],
    '♻️': [
        'Універсальний символ переробки в Чорному стилі',
        'Символи переробки',
        'Кошик логотип'
    ],
    '🔱': [
        'Тризубець Емблема',
        'Вила',
        'Тризубець'
    ],
    '📛': [
        'Назвати значок',
        'Тофу у вогні',
        'Тег імені',
        'Тег вогню'
    ],
    '🔰': [
        'Символ Японії для початківця',
        'Шошинша Марк',
        'Жовтий Зелений Щит'
    ],
    '➰': [
        'Кучерявий цикл',
        'Петля Керлінг',
        'Петля'
    ],
    '➿': [
        'Подвійне кучеряве тіло',
        'Подвійне Петля Керлінг',
        'Голосова пошта'
    ],
    '〽️': [
        'Марка черги запчастини',
        'М-ль',
        'Макдональд'
    ],
    '✳️': ['Вісім зіпсований астериськ'],
    '✴️': [
        'Вісім пойнтована чорна зірка',
        'Помаранчева зірка',
        'Вісім крихітна зірка'
    ],
    '❇️': ['Спаркле'],
    'Ⓜ️': [
        'Circled Latin Capital літера M',
        'Циркли М',
        'Метро',
        'Циркли М'
    ],
    '🈁': [
        'Squared Katakana Koko',
        'Тут знак японського слова',
        'Тут',
        'Пункт призначення'
    ],
    '🈂️': [
        'Squared Katakana Sa',
        'Японський підпис має значення служби або досвід обслуговування'
    ],
    '🈷️': [
        'Уніфікований ієрогліфічний ідеограм-6708',
        'Ключ 74',
        '月',
        'Щомісячна сума японського жесту'
    ],
    '🈶': [
        'Уніфікований ієрогліфічний ідеогра-6709',
        'Японський знак означає не Безкоштовне заряджання',
        'Власні',
        '有'
    ],
    '🈯': [
        'Уніфікований ієрогліфічний ідеогра-6307',
        'Японський знак',
        'Відбиток пальця',
        '指'
    ],
    '🉐': [
        'Перевага Circled Ideograph',
        'Договірний знак Японії',
        'Придбання',
        '得'
    ],
    '🈹': [
        'Уніфікований ієрогліфічний ідеограм-5272 квадрат',
        'Знижка за японськими підписами',
        'Розпродаж Баргеніну',
        '割'
    ],
    '🈚': [
        'Об\'єднаний ієрогліфічний ідеограм-7121 квадрат',
        'Японський знак означає вільний від Заряду',
        'Бракінг',
        '無'
    ],
    '🈲': [
        'Квадратний ієрогліфічний ідеограм-7981',
        'Заборонено японський підпис',
        'Forbid',
        '禁'
    ],
    '🉑': [
        'Прийняти Circled Ideograph',
        'Японський підпис має прийнятний',
        'Прийняти'
    ],
    '🈸': [
        'Уніфікований ієрогліфічний ідеограм-7533',
        'Японська заявка на підпис',
        'Форма додатку',
        'Мавпа',
        'Замовити',
        '申'
    ],
    '🈴': [
        'Уніфікований ієрогліфічний ідеограм-5408',
        'Свята князівства японських підписів (краде)',
        'Угода',
        '合'
    ],
    '🈳': [
        'Квадратний ієрогліфічний ідеограм-7a7a',
        'Японська синознавство',
        'Порожній і доступний',
        '空'
    ],
    '㊗️': [
        'Вітання на тілу ідеографа',
        'Вітаємо з японським підписом'
    ],
    '㊙️': [
        'Секрет Circled Ideograph',
        'Японський знак',
        'Секрет'
    ],
    '🈺': [
        'Об\'єднаний ієрогліфічний ідеограм-55b6 квадрат',
        'Японські підписи мають на значення для бізнесу',
        'Праця',
        '営'
    ],
    '🈵': [
        'Уніфікований ієрогліфічний ідеограм-6e80',
        'Японський вказівник має значення повністю, без особливості',
        'Повна',
        '満'
    ],
    '🔘': ['Перемикач'],
    '🛑': [
        'Зупинити покажчик',
        'Октагональний знак'
    ],
    '⚕️': [
        'Знак аптечки',
        'Ескулапій',
        'Asklepios',
        'Посох Асклепійський',
        'Штаб Ескулапійський'
    ],
    '🛗': [
        'Ліфт',
        'Ліфт'
    ],
    '⚧️': ['Символ трансгендеру'],
    '♂️': [
        'Чоловічий знак',
        'Символ людини',
        'Марсове поле'
    ],
    '♀️': [
        'Жіноча табличка',
        'Символ жінки',
        'Venus Symbol'
    ]
};
/*food and drinks*/
emojis_language[lang][6] = {
    '🍇': [
        'Виноград',
        'Виноград'
    ],
    '🍈': [
        'Диня',
        'Cantaloupe',
        'Медовий',
        'Диня'
    ],
    '🍉': ['Кавун'],
    '🍊': [
        'Tangerine',
        'Mandarin',
        'Помаранчевий'
    ],
    '🍋': [
        'Лимон',
        'Лимонад'
    ],
    '🍌': [
        'Банан',
        'Плантан'
    ],
    '🍍': ['Ананас'],
    '🥭': ['Mango'],
    '🍎': [
        'Червоне яблуко',
        'Червоне смачне яблуко'
    ],
    '🍏': [
        'Зелене яблуко',
        'Золоте смачне яблуко',
        'Гренні Сміт Егл'
    ],
    '🍐': ['Груша'],
    '🍑': [
        'Персик',
        'Униз',
        'Піпа'
    ],
    '🍒': [
        'Вишні',
        'Вишня',
        'Дика вишня'
    ],
    '🍓': ['Полуничний'],
    '🥝': [
        'Фрукт Ківі',
        'Атерина китайська',
        'Ківі',
        'Ківі'
    ],
    '🍅': ['Помідор'],
    '🥥': [
        'Кокосова пальма',
        'Cocoanut'
    ],
    '🥑': ['Авокадо'],
    '🍆': [
        'Баклажан',
        'Aubergine',
        'Фалік',
        'Фіолетовий овочевий'
    ],
    '🥔': [
        'Картопля',
        'Запечена картопля',
        'Картопля Айдахо'
    ],
    '🥕': ['Морква'],
    '🌽': [
        'Вуха кукурудзи',
        'Кукурудза',
        'Кукурудза у кабіні',
        'Кукурудза',
        'Вухо кукурудзи'
    ],
    '🌶️': [
        'Гарячий перець',
        'Чилі Пеппер',
        'Пряний'
    ],
    '🥒': [
        'Огірок',
        'Геркін',
        'Пікл'
    ],
    '🥬': [
        'Ліфі Грін',
        'Бок Чой',
        'Китайська капуста',
        'Cos Lettuce',
        'Ромен Леттукюс',
        'Листя зелені'
    ],
    '🥦': ['Броколі'],
    '🍄': [
        'Гриб',
        'Гриб',
        'Toadstool'
    ],
    '🥜': [
        'Peanuts',
        'Божевільні'
    ],
    '🌰': [
        'Каштан',
        'Жолудь',
        'Нут'
    ],
    '🍞': [
        'Хліб',
        'колос хліба'
    ],
    '🥐': ['Croissant'],
    '🥖': [
        'Хліб балети',
        'Французький хліб',
        'Багет'
    ],
    '🥨': ['Pretzel'],
    '🥯': ['Бублик'],
    '🥞': [
        'Млинці',
        'Крепес',
        'Хоткеси'
    ],
    '🧀': [
        'Сир -Клин',
        'Сир'
    ],
    '🍖': [
        'М\'ясо на кістці',
        'BBQ',
        'Барбекю',
        'Манга'
    ],
    '🍗': [
        'Poultry Leg',
        'Барабанний',
        'Турецька нога'
    ],
    '🥩': [
        'Вирізана кількість м\'яса',
        'М\'ясо',
        'Стейк'
    ],
    '🥓': [
        'Бекон',
        'Rashers'
    ],
    '🍔': [
        'Гамбургер',
        'Бургер',
        'Чизбургер'
    ],
    '🍟': [
        'Французька (Фріс)',
        'Чіп',
        'Фріс',
        'Фріз Макдональда'
    ],
    '🍕': [
        'Піца',
        'Пепероні Піцца',
        'Шматок Піци'
    ],
    '🌭': [
        'Хот-пес',
        'Хотдог',
        'Ковбаса'
    ],
    '🥪': ['Сандвіч'],
    '🌮': ['Тако'],
    '🌯': [
        'Burrito',
        'Перенос'
    ],
    '🥙': [
        'Гарматний хліб',
        'Doner Kebab',
        'Gyro',
        'Шаурма',
        'Піта Сандвіч'
    ],
    '🍳': [
        'Кулінарія',
        'Сніданок',
        'Смажене Яйце',
        'Засмаження панорами'
    ],
    '🥘': [
        'Мілководдя',
        'Paella',
        'Пан з їжі'
    ],
    '🍲': [
        'Їжа горщика',
        'Вежа з їжі',
        'Суп',
        'Стью'
    ],
    '🥣': [
        'Миска з лопатою',
        'Цереал'
    ],
    '🥗': [
        'Зелений салат',
        'Салат'
    ],
    '🍿': [
        'Попкорн',
        'Зринаюча кукурудза'
    ],
    '🧂': [
        'Сіль',
        'Солт Шакер'
    ],
    '🥫': [
        'Консервовані продукти',
        'Банка їжі',
        'Бляшана',
        'Примма їжа'
    ],
    '🍱': [
        'Бенто Бокс',
        'Ланч'
    ],
    '🍘': [
        'Райс Крекер',
        'Крекер'
    ],
    '🍙': [
        'Рисова куля',
        'Onigiri'
    ],
    '🍚': [
        'Приготований рис',
        'Вараний Райс',
        'Рис',
        'Боул Риса',
        'Вкрастимий рис'
    ],
    '🍛': [
        'Карі Райс',
        'Карі',
        'Індійська корм',
        'Карі та Райс'
    ],
    '🍜': [
        'Паруючий м\'яч',
        'Нудлес',
        'Локшина з паличками',
        'Рамен'
    ],
    '🍝': [
        'Spaghetti',
        'Паста'
    ],
    '🍠': [
        'Висмажена солодка картопля',
        'Солодка картопля',
        'Ям'
    ],
    '🍢': [
        'Оден',
        'Kebab',
        'Лінійний удар'
    ],
    '🍣': [
        'Суші',
        'Sashimi',
        'Морепродукти'
    ],
    '🍤': [
        'Смажені креветки',
        'Смажений труб',
        'Шрімп Темпура'
    ],
    '🍥': [
        'Риб\'ячий пиріжок зі швейною',
        'Вудка',
        'Pink Swirl'
    ],
    '🥮': [
        'Місячний Пиріг',
        'Місячне Тістечко'
    ],
    '🍡': [
        'Dango',
        'Десерт Стік',
        'Рожеві білі зелені кулі'
    ],
    '🥟': [
        'Галушка',
        'Empanada',
        'Pierogi'
    ],
    '🥠': ['Печиво Фортуни'],
    '🥡': [
        'Коробка Takeout',
        'Китайська кухня',
        'Oyster Pail'
    ],
    '🍦': [
        'М\'яке морозиво',
        'Пан Віппі',
        'М\'який сертифік'
    ],
    '🍧': [
        'Струрений лід',
        'Сніговий конус'
    ],
    '🍨': [
        'Морозиво',
        'Боул льодовикового крему',
        'Десерт'
    ],
    '🍩': [
        'Пончик',
        'Donut'
    ],
    '🍪': [
        'Печиво',
        'Бісквіт',
        'Шоколадний чіп Печиво'
    ],
    '🎂': [
        'Торт до Дня Народження',
        'День народження',
        'Торт',
        'Торт із свічками'
    ],
    '🍰': [
        'Короткий торт',
        'Торт',
        'Торт',
        'Полуничний Короткий торт'
    ],
    '🧁': [
        'Капкейк',
        'Печівний торт'
    ],
    '🥧': ['Пиріг'],
    '🍫': [
        'Шоколадний батончик',
        'Батончик',
        'Шоколад'
    ],
    '🍬': [
        'Цукерки',
        'Лоллі',
        'Солодкий'
    ],
    '🍭': [
        'Льодяник',
        'Роззява'
    ],
    '🍮': [
        'Дрохвові',
        'Creme Caramel',
        'Десерт',
        'Флан',
        'Пудинг'
    ],
    '🍯': [
        'Мед Пот',
        'Мед',
        'Горщик'
    ],
    '🍼': [
        'Пляшка',
        'Пляшкова постановка'
    ],
    '🥛': [
        'Скло молока',
        'Молоко'
    ],
    '☕': [
        'Гарячий джекер',
        'Кава',
        'Espresso',
        'Гарячий шоколад',
        'Чай'
    ],
    '🍵': [
        'Без обробки',
        'Зелений чай',
        'Matcha',
        'Матча Зелена'
    ],
    '🍶': [
        'Sake',
        'Пляшка',
        'Рисова вино',
        'Кубок Сакка і пляшки'
    ],
    '🍾': [
        'Пляшка з корком',
        'Святкування',
        'Champagne',
        'Вино з гострі'
    ],
    '🍷': [
        'Вино',
        'Алкоголь',
        'Червоне Вино',
        'Вино'
    ],
    '🍸': [
        'Коктейльне скло',
        'Коктейль',
        'Мартіні'
    ],
    '🍹': [
        'Тропічний напій',
        'Фруктовий удар',
        'Тікі Пийте'
    ],
    '🍺': [
        'Пивний мул',
        'Пиво',
        'Пиво Штайн'
    ],
    '🍻': [
        'Клінкінг Бір Мугс',
        'Пиво',
        'Ура'
    ],
    '🥂': [
        'Клінкінг Гласс',
        'Святкування',
        'Шампанське Гласс',
        'Ура'
    ],
    '🥃': [
        'Скло тамблера',
        'Бурбон',
        'Лікер',
        'Rum',
        'Віскі',
        'Whisky'
    ],
    '🥤': [
        'Кубок з соломою',
        'Молочний коктейль',
        'Смузі',
        'Сода Поп',
        'М\'який напій'
    ],
    '🥢': ['Палички для їжі'],
    '🍽️': [
        'Форк-ніж із пластиною',
        'Обід'
    ],
    '🍴': [
        'Дика та нож',
        'Столові прибори',
        'Ніж і форк',
        'Срібний посуд'
    ],
    '🥄': ['Ложиця'],
    '🧄': ['Часник'],
    '🧅': ['Цибуля'],
    '🧇': ['Waffle'],
    '🧆': ['Falafel'],
    '🧈': ['Масло'],
    '🦪': ['Устриця'],
    '🧃': [
        'Розсіяна коробка',
        'Жук-сік'
    ],
    '🧉': [
        'Матовий напой',
        'ЧимарраВсе',
        'Cimarrón',
        'Єрба Мате'
    ],
    '🫒': ['Оливковий'],
    '🫐': ['Чорниця'],
    '🫑': ['Белл Пеппер'],
    '🫓': ['Корж'],
    '🫔': [
        'Тамале',
        'Тамал'
    ],
    '🫕': ['Fondue'],
    '🧋': [
        'Чай Булька',
        'Boba'
    ],
    '🧊': ['Кубик льоду']
};
/*flags*/
emojis_language[lang][7] = {
    '🏁': [
        'Замок в Чейвері',
        'Стяг',
        'Дівчина з ґратки',
        'Гоночний прапор'
    ],
    '🚩': [
        'Трикутний стяг',
        'Прапор на полі',
        'Червоний прапор',
        'Трикутний прапор повідомлення'
    ],
    '🎌': [
        'Перехресні прапори',
        'Два прапори'
    ],
    '🏴': [
        'Чорний прапор',
        'Чорний прапор'
    ],
    '🏳️': [
        'Білий прапор',
        'Білий прапор'
    ],
    '🏳️‍🌈': [
        'Веселковий стяг',
        'Pride Flag'
    ],
    '🏳️‍⚧️': [
        'Прапор трансгендеру',
        'Синій, рожевий та білий прапор',
        'Транс-прапор'
    ],
    '🏴‍☠️': [
        'Піратський прапор',
        'Веселий Роджер'
    ],
    '🇺🇳': [
        'Прапор Організації Об\'єднаних Націй',
        'Пропустити',
        'Прапор: Організація'
    ],
    '🇪🇺': [
        'Прапор Європейського Союзу',
        'EU',
        'Прапор: Європейський Союз',
        'EU Flag'
    ],
    '🇦🇨': [
        'Прапор острова Вознесіння',
        'AC'
    ],
    '🇦🇩': [
        'Прапор Андорри',
        'AD',
        'Andorran Flag'
    ],
    '🇦🇪': [
        'Прапор Об\'єднаних Арабських Еміратів',
        'AE',
        'Emirati Flag',
        'Флаг ОАЕ'
    ],
    '🇦🇫': [
        'Прапор Афганістану',
        'AF',
        'Afghan Flag'
    ],
    '🇦🇬': [
        'Прапор Антигуа і Барбуди',
        'AG'
    ],
    '🇦🇮': [
        'Прапор Ангільї',
        'AI',
        'Стяг Ангілли'
    ],
    '🇦🇱': [
        'Прапор Албанії',
        'навсi',
        'Албанський прапор'
    ],
    '🇦🇲': [
        'Прапор Вірменії',
        'ДП',
        '🇦🇲'
    ],
    '🇦🇴': [
        'Прапор Анголи',
        'АО',
        'Ангольський прапор'
    ],
    '🇦🇶': [
        'Прапор Антарктиди',
        'AQ',
        'Антарктичний прапор'
    ],
    '🇦🇷': [
        'Прапор Аргентини',
        'AR',
        'Прапор Аргентини'
    ],
    '🇦🇸': [
        'Прапор Американського Самоа',
        'АС',
        'American Samoan Flag'
    ],
    '🇦🇹': [
        'Прапор Австрії',
        'З ПТ',
        'Austrian Flag'
    ],
    '🇦🇺': [
        'Прапор Австралії',
        'АУ',
        'Стяг Оссі',
        'Австралійський прапор'
    ],
    '🇦🇼': [
        'Прапор Аруби',
        'АП',
        'Стяг Аруби'
    ],
    '🇦🇽': [
        'Прапор Аль Островів',
        'Акс',
        'Стяг Ал'
    ],
    '🇦🇿': [
        'Прапор Азербайджану',
        'AZ',
        'Азербайджанський прапор'
    ],
    '🇧🇦': [
        'Прапор Боснії і Герцеговини',
        'BA'
    ],
    '🇧🇧': [
        'Прапор Барбадосу',
        'ББ',
        'Стяг Барбадоу',
        'Прапорець Баяна'
    ],
    '🇧🇩': [
        'Прапор Бангладеш',
        'BD',
        'Bangladeshi Flag'
    ],
    '🇧🇪': [
        'Прапор Бельгії',
        'БС',
        'Стяг Бельгії'
    ],
    '🇧🇫': [
        'Прапор Буркіна-Фасо',
        'Пт',
        'Прапор Буркінабе'
    ],
    '🇧🇬': [
        'Прапор Болгарії',
        'Ч.г.',
        'Болгарський прапор'
    ],
    '🇧🇭': [
        'Прапор Бахрейну',
        'BH',
        'Стяг Барані',
        'Бахрейнський прапор'
    ],
    '🇧🇮': [
        'Прапор Бурунді',
        'Мід',
        'Burundian Flag'
    ],
    '🇧🇯': [
        'Прапор Беніну',
        'Бей',
        'Бенійський прапор'
    ],
    '🇧🇱': [
        'Прапор Святого Бартеаретелеми',
        'BL',
        'Прапор: Сен-Бартепосулемі'
    ],
    '🇧🇲': [
        'Прапор Бермудських Островів',
        'В/Х',
        'Bermudan Flag'
    ],
    '🇧🇳': [
        'Прапор Брунею',
        'БН',
        'Стяг Брунея'
    ],
    '🇧🇴': [
        'Прапор Болівії',
        'BO',
        'Bolivian Flag'
    ],
    '🇧🇶': [
        'Прапор Карибських Нідерландів',
        'Чт',
        'Bonaire'
    ],
    '🇧🇷': [
        'Прапор Бразилії',
        'BR',
        'Бразильський прапор'
    ],
    '🇧🇸': [
        'Прапор Багамських Островів',
        'Багамський прапор',
        'Байс'
    ],
    '🇧🇹': [
        'Прапор Бутану',
        'БТ',
        'Бутанський прапор'
    ],
    '🇧🇻': [
        'Прапор Острова Буве',
        'ВВ',
        'Мітка: Буве острів'
    ],
    '🇧🇼': [
        'Прапор Ботсвани',
        'BW',
        'Batswana Flag'
    ],
    '🇧🇾': [
        'Прапор Білорусі',
        'ЗА',
        'Прапор Білорусі'
    ],
    '🇧🇿': [
        'Прапор Белізу',
        'ВДЗ',
        'Стяг Белізея'
    ],
    '🇨🇦': [
        'Прапор Канади',
        'Канадський прапор',
        'CA'
    ],
    '🇨🇨': [
        'Прапор Кокосових (Кілінг) островів',
        'CC'
    ],
    '🇨🇩': [
        'Flag of Congo - Kinshasa',
        'ЦентрЗах'
    ],
    '🇨🇫': [
        'Прапор Центральноафриканської Республіки',
        'ПК',
        'Центральноафриканський прапор'
    ],
    '🇨🇬': [
        'Прапор Конго — Браззавіль',
        'CG'
    ],
    '🇨🇭': [
        'Прапор Швейцарії',
        'CH',
        'Червоний хрест',
        'Швейцарський прапор'
    ],
    '🇨🇮': [
        'Прапор Кот-д\'Івуару',
        'CI',
        'Flag: Côte d’Ivoire'
    ],
    '🇨🇰': [
        'Прапор Островів Кука',
        'СК',
        'Прапор Островів Кука'
    ],
    '🇨🇱': [
        'Прапор Чилі',
        'Завантажено',
        'Прапорець Чилі'
    ],
    '🇨🇲': [
        'Прапор Камеруну',
        'CM',
        'Стяг Камерунів'
    ],
    '🇨🇳': [
        'Прапор КНР',
        'Телефон',
        'Китайський прапор'
    ],
    '🇨🇴': [
        'Прапор Колумбії',
        'Директор',
        'Стяг Колумбії'
    ],
    '🇨🇵': [
        'Прапор Острова Кліппертон',
        'КТ',
        'Прапор: Острів Кліппертон'
    ],
    '🇨🇷': [
        'Прапор Коста-Рики',
        'ПП',
        'Флаг Костарикана'
    ],
    '🇨🇺': [
        'Прапор Куби',
        'CU',
        'Кубинський прапор'
    ],
    '🇨🇻': [
        'Прапор Кабо-Верде',
        'МП',
        'Прапор Кабо-Вердіану'
    ],
    '🇨🇼': [
        'Прапор Кюракао',
        'CW',
        'Curaçaoan Flag'
    ],
    '🇨🇽': [
        'Прапор Острова Різдва',
        'СХ',
        'Острів різдва'
    ],
    '🇨🇾': [
        'Прапор Кіпру',
        'CY',
        'Прапор Кіпру'
    ],
    '🇨🇿': [
        'Прапор Чехії',
        'CZ',
        'Чеський прапор'
    ],
    '🇩🇪': [
        'Прапор Німеччини',
        'ДС',
        'Німецький прапор',
        'Німецький прапор'
    ],
    '🇩🇬': [
        'Прапор Дієгогарсії',
        'DG',
        'Прапор: Дієго Гарсія'
    ],
    '🇩🇯': [
        'Прапор Джибуті',
        'DJ',
        'Djibouti Flag',
        'Djiboutian Flag'
    ],
    '🇩🇰': [
        'Прапор Данії',
        'DK',
        'Данський прапор'
    ],
    '🇩🇲': [
        'Прапор Домініки',
        'ПП'
    ],
    '🇩🇴': [
        'Прапор Домініканської Республіки',
        'ВИМКНУТИ',
        'Прапорець Dom Rep',
        'Стяг Домінікану'
    ],
    '🇩🇿': [
        'Прапор Алжиру',
        'DZ',
        'Algerian Flag'
    ],
    '🇪🇦': [
        'Прапор Сеути і Мелільї',
        'Прапор Мелільї',
        'Прапор Сеути',
        'EA',
        'Flag: Ceuta & Melilla'
    ],
    '🇪🇨': [
        'Прапор Еквадору',
        'EC',
        'Ecuadorian Flag'
    ],
    '🇪🇪': [
        'Прапор Естонії',
        'EE',
        'Естонський прапор'
    ],
    '🇪🇬': [
        'Прапор Єгипту',
        'EG',
        'Єгипетський прапор'
    ],
    '🇪🇭': [
        'Прапор Західної Сахари',
        'Ох',
        'Західний прапор Сахари'
    ],
    '🇪🇷': [
        'Прапор Еритреї',
        'Ер',
        'Eritrean Flag'
    ],
    '🇪🇹': [
        'Прапор Ефіопії',
        'ET',
        'Ethiopian Flag'
    ],
    '🇪🇸': [
        'Прапор Іспанії',
        'СТИ',
        'Іспанський прапор'
    ],
    '🇫🇮': [
        'Прапор Фінляндії',
        'Пт',
        'Фінський прапор'
    ],
    '🇫🇯': [
        'Прапор Фіджі',
        'Фей',
        'Fijian Flag'
    ],
    '🇫🇰': [
        'Прапор Фолклендських Островів',
        'FK',
        'Фолклендерський прапор'
    ],
    '🇫🇲': [
        'Прапор Мікронезії',
        'ФМ',
        'Прапор Мікронезії'
    ],
    '🇫🇴': [
        'Прапор Фарерських островів',
        'Фо',
        'Faroe Islander Flag'
    ],
    '🇫🇷': [
        'Прапор Франції',
        'Пт',
        'Французький прапор'
    ],
    '🇬🇦': [
        'Прапор Габону',
        'ВА',
        'Габонський прапор'
    ],
    '🇬🇧': [
        'Прапор Великої Британії',
        'ГБ',
        'Британський прапор',
        'Велика Британія',
        'Юніон Джек',
        'Великобританія'
    ],
    //"🏴󠁧󠁢󠁥󠁮󠁧󠁿": ["Flag of England", "St George's Cross", "English Flag"],
    //"🏴󠁧󠁢󠁷󠁬󠁳󠁿": ["Flag of Wales", "Welsh Flag", "Red Dragon", "Baner Cymru", "Y Ddraig Goch"],
    //"🏴󠁧󠁢󠁳󠁣󠁴󠁿": ["Flag of Scotland", "Scottish Flag", "St Andrew's Cross", "Saltire"],
    //"🏴󠁧󠁢󠁮󠁩󠁲󠁿": ["Flag of Northern Ireland"],
    '🇬🇩': [
        'Прапор Гренади',
        'ГД',
        'Флаг Гренади'
    ],
    '🇬🇪': [
        'Прапор Грузії',
        'GE',
        'Стяг Грузії'
    ],
    '🇬🇫': [
        'Прапор Французької Гвіани',
        'ГФ',
        'Прапор Французької Гвінеї'
    ],
    '🇬🇬': [
        'Прапор Гернсі',
        'GG',
        'Guernsey Flag'
    ],
    '🇬🇭': [
        'Прапор Гани',
        'ГГ',
        'Ганський прапор'
    ],
    '🇬🇮': [
        'Прапор Гібралтару',
        'GI',
        'Гібралтаріанський прапор'
    ],
    '🇬🇱': [
        'Прапор Ґренландії',
        'GL',
        'Greenlandic Flag'
    ],
    '🇬🇲': [
        'Прапор Гамбії',
        'ГМ',
        'Gambian Flag'
    ],
    '🇬🇳': [
        'Прапор Гвінеї',
        'GN',
        'Guinean Flag'
    ],
    '🇬🇵': [
        'Прапор Гваделупи',
        'ЗП',
        'Стяг Гваделупіана'
    ],
    '🇬🇶': [
        'Прапор Екваторіальної Гвінеї',
        'ЗВК',
        'Equatorial Guinean Flag',
        'Екватогвінейський прапор'
    ],
    '🇬🇷': [
        'Прапор Греції',
        'Грп',
        'Грецький прапор'
    ],
    '🇬🇸': [
        'Прапор Південної Джорджії та Південних Сандвічевих Островів',
        'ГС'
    ],
    '🇬🇹': [
        'Прапор Гватемали',
        'ВТ',
        'Guatemalan Flag'
    ],
    '🇬🇺': [
        'Прапор Гуаму',
        'GU',
        'Гуаманський прапор',
        'Прапор Чаморо'
    ],
    '🇬🇼': [
        'Прапор Гвінеї-Бісау',
        'GW',
        'Guinea-Bissau Flag'
    ],
    '🇬🇾': [
        'Прапор Гаяни',
        'GY',
        'Прапор Гаянси'
    ],
    '🇭🇰': [
        'Прапор Гонконгу SAR Китаю',
        'ХК',
        'Стяг Гонконгу'
    ],
    '🇭🇲': [
        'Прапор Островів Херд і Макдональд',
        'HM',
        'Прапор: Острови Херд і Макдональд'
    ],
    '🇭🇳': [
        'Прапор Гондурасу',
        'HN',
        'Стяг Гондурасу'
    ],
    '🇭🇷': [
        'Прапор Хорватії',
        'Доктор',
        'Хорватський прапор'
    ],
    '🇭🇹': [
        'Прапор Гаїті',
        'HT',
        'Haitian Flag'
    ],
    '🇭🇺': [
        'Прапор Угорщини',
        'Ху',
        'Угорський прапор'
    ],
    '🇮🇨': [
        'Прапор Канарських островів',
        'ІК'
    ],
    '🇮🇩': [
        'Прапор Індонезії',
        'ID',
        'Прапор Індонезії'
    ],
    '🇮🇪': [
        'Прапор Ірландії',
        'IE',
        'Ірландський прапор'
    ],
    '🇮🇱': [
        'Прапор Ізраїлю',
        'IL',
        'Ізраїльський прапор'
    ],
    '🇮🇲': [
        'Прапор Острова Мен',
        'IM',
        'Manx Flag'
    ],
    '🇮🇳': [
        'Прапор Індії',
        'В',
        'Індійський прапор'
    ],
    '🇮🇴': [
        'Прапор Британської Території в Індійському Океані',
        'IO',
        'Британський прапор території в Індійському океані'
    ],
    '🇮🇶': [
        'Прапор Іраку',
        'IQ',
        'Iraqi Flag'
    ],
    '🇮🇷': [
        'Прапор Ірану',
        'IR',
        'Іранський прапор'
    ],
    '🇮🇸': [
        'Прапор Ісландії',
        'ІС',
        'Ісландський прапор'
    ],
    '🇮🇹': [
        'Прапор Італії',
        'ІТ',
        'Прапор Італії'
    ],
    '🇯🇪': [
        'Прапор Джерсі',
        'ЧС',
        'Стяг Джерсі'
    ],
    '🇯🇲': [
        'Прапор Ямайки',
        'JM',
        'Прапор Ямайки'
    ],
    '🇯🇴': [
        'Прапор Йорданії',
        'Джо',
        'Йорданський прапор'
    ],
    '🇯🇵': [
        'Прапор Японії',
        'JP',
        'Прапорець Японії'
    ],
    '🇰🇪': [
        'Прапор Кенії',
        'KE',
        'Стяг Кенії'
    ],
    '🇰🇬': [
        'Прапор Киргизстану',
        'KG',
        'Kyrgyzstani Flag'
    ],
    '🇰🇭': [
        'Прапор Камбоджі',
        'КГ',
        'Стяг Камбоджі'
    ],
    '🇰🇮': [
        'Прапор Кірибаті',
        'КІ',
        'Стяг І-Кірибаті'
    ],
    '🇰🇲': [
        'Прапор Коморських Островів',
        'КМ',
        'Прапорець Комора'
    ],
    '🇰🇳': [
        'Прапор Сент-Кіттсу і Невісу',
        'KN'
    ],
    '🇰🇵': [
        'Прапор Північної Кореї',
        'KP',
        'Стяг Північної Кореї'
    ],
    '🇰🇷': [
        'Прапор Південної Кореї',
        'KR',
        'Південнокорейський прапор'
    ],
    '🇰🇼': [
        'Прапор Кувейту',
        'KW',
        'Kuwaiti Flag'
    ],
    '🇰🇾': [
        'Прапор Кайманових Островів',
        'КЕШ',
        'Прапор Кайману'
    ],
    '🇰🇿': [
        'Прапор Казахстану',
        'КЗ',
        'Kazakhstani Flag',
        'Kazakh Flag'
    ],
    '🇱🇦': [
        'Прапор Лаосу',
        'ЛівАтака',
        'Лаоський прапор',
        'Лаос Стяг'
    ],
    '🇱🇧': [
        'Прапор Лівану',
        'ЛБ',
        'Ліванський прапор'
    ],
    '🇱🇨': [
        'Прапор Сент-Люсії',
        'ТОВ'
    ],
    '🇱🇮': [
        'Прапор Ліхтенштейну',
        'Лівй',
        'Прапор Ліхтенштейну'
    ],
    '🇱🇰': [
        'Прапор Шрі-Ланки',
        'LK',
        'Стяг Шрі-Ланки'
    ],
    '🇱🇷': [
        'Прапор Ліберії',
        'ЛР',
        'Прапор Ліберії'
    ],
    '🇱🇸': [
        'Flag of Lesotho',
        'LS',
        'Basotho Flag'
    ],
    '🇱🇹': [
        'Прапор Литви',
        'ЛТ',
        'Прапор Литви'
    ],
    '🇱🇺': [
        'Прапор Люксембургу',
        'Лу',
        'Стяг Люксембурга'
    ],
    '🇱🇻': [
        'Прапор Латвії',
        'LV',
        'Латвійський прапор'
    ],
    '🇱🇾': [
        'Прапор Лівії',
        'РР',
        'Лівійський прапор'
    ],
    '🇲🇦': [
        'Прапор Марокко',
        'МБ',
        'Прапорець Мароккана'
    ],
    '🇲🇨': [
        'Прапор Монако',
        'MC',
        'Прапор Монеасгасу'
    ],
    '🇲🇩': [
        'Прапор Молдови',
        'МД',
        'Молдовський прапор'
    ],
    '🇲🇪': [
        'Прапор Чорногорії',
        'Мати',
        'Прапор Чорногорії'
    ],
    '🇲🇫': [
        'Прапор Святого Мартіна',
        'МФ',
        'Flag: St. Martin'
    ],
    '🇲🇬': [
        'Прапор Мадагаскару',
        'Урон',
        'Madagascan Flag'
    ],
    '🇲🇭': [
        'Прапор Маршаллових Островів',
        'MH',
        'Прапор Маршаллу'
    ],
    '🇲🇰': [
        'Прапор Македонії',
        'MK',
        'Стяг Македонії'
    ],
    '🇲🇱': [
        'Прапор Малі',
        'Поль',
        'Малійський прапор'
    ],
    '🇲🇲': [
        'Прапор М\'янми (Бірми)',
        'ММ',
        'Прапор М\'янми',
        'Прапор для Бірми',
        'Бірманський прапор'
    ],
    '🇲🇳': [
        'Прапор Монголії',
        'МН',
        'Монгольський прапор'
    ],
    '🇲🇴': [
        'Прапор Макао-Сар Китаю',
        'Пн',
        'Флаг Маканська'
    ],
    '🇲🇵': [
        'Прапор Північних Маріанських Островів',
        'Мп',
        'Прапор Мікронезії'
    ],
    '🇲🇶': [
        'Прапор Мартиніки',
        'MQ',
        'Зміїний Прапор Мартиніки',
        'Прапор Мартсайс'
    ],
    '🇲🇷': [
        'Прапор Мавританії',
        'Запит на злиття',
        'Стяг Мавританії'
    ],
    '🇲🇸': [
        'Flag of Montserrat',
        'Мб',
        'Montserratian Flag'
    ],
    '🇲🇹': [
        'Прапор Мальти',
        'МТ',
        'Maltese Flag'
    ],
    '🇲🇺': [
        'Flag of Mauritius',
        'Му',
        'Стяг Маврикії'
    ],
    '🇲🇻': [
        'Прапор Мальдівів',
        'МВ',
        'Прапор Мальдівів'
    ],
    '🇲🇼': [
        'Прапор Малаві',
        'MW',
        'Malawian Flag'
    ],
    '🇲🇽': [
        'Прапор Мексики',
        'MX',
        'Мексиканський прапор'
    ],
    '🇲🇾': [
        'Прапор Малайзії',
        'МОЇ',
        'Malaysian Flag'
    ],
    '🇲🇿': [
        'Прапор Мозамбіку',
        'МЗ',
        'Мозамбіцький прапор'
    ],
    '🇳🇦': [
        'Прапор Намібії',
        'НК',
        'Namibian Flag'
    ],
    '🇳🇨': [
        'Прапор Нової Каледонії',
        'Мережа',
        'Новий Каледонський прапор'
    ],
    '🇳🇪': [
        'Прапор Нігеру',
        'ПнС',
        'Стяг Нігерії'
    ],
    '🇳🇫': [
        'Прапор Острова Норфолк',
        'NF',
        'Прапор острова Норфолк'
    ],
    '🇳🇬': [
        'Прапор Нігерії',
        'NG',
        'Прапор Нігерії'
    ],
    '🇳🇮': [
        'Flag of Nicaragua',
        'NI',
        'Nicaraguan Flag'
    ],
    '🇳🇱': [
        'Прапор Нідерландів',
        'NL',
        'Голландський прапор',
        'Holland'
    ],
    '🇳🇴': [
        'Прапор Норвегії',
        'Ні',
        'Норвезький прапор'
    ],
    '🇳🇵': [
        'Прапор Непалу',
        'NP',
        'Стяг Непалу'
    ],
    '🇳🇷': [
        'Прапор Науру',
        'ПнР',
        'Nauruan Flag'
    ],
    '🇳🇺': [
        'Прапор Ніуе',
        'NU',
        'Niuean Flag'
    ],
    '🇳🇿': [
        'Прапор Нової Зеландії',
        'NZ',
        'Стяг Ківі'
    ],
    '🇴🇲': [
        'Прапор Оману',
        'ОМ',
        'Стяг Омані'
    ],
    '🇵🇦': [
        'Прапор Панами',
        'ПА',
        'Панаманійський прапор'
    ],
    '🇵🇪': [
        'Прапор Перу',
        'ПР',
        'Прапор Перу'
    ],
    '🇵🇫': [
        'Прапор Французької Полінезії',
        'ПФ',
        'Прапор Французької Полінезії'
    ],
    '🇵🇬': [
        'Прапор Папуа Нової Гвінеї',
        'ПГ',
        'Стяг PNG',
        'Papua New Guinean Flag'
    ],
    '🇵🇭': [
        'Прапор Філіппін',
        'Пх'
    ],
    '🇵🇰': [
        'Прапор Пакистану',
        'ПК',
        'Пакістанський прапор'
    ],
    '🇵🇱': [
        'Прапор Польщі',
        'PL',
        'Польський прапор'
    ],
    '🇵🇲': [
        'Прапор Сен-П\'єру і Мікелону',
        'Очистити кеш'
    ],
    '🇵🇳': [
        'Прапор Піткерна',
        'ПН'
    ],
    '🇵🇷': [
        'Прапор Пуерто-Рико',
        'PR',
        'Стяг Пуерто-Рикану'
    ],
    '🇵🇸': [
        'Прапор палестинських територій',
        'ПС',
        'Palestine'
    ],
    '🇵🇹': [
        'Прапор Португалії',
        'ПТ',
        'Прапор Португалії'
    ],
    '🇵🇼': [
        'Прапор Палау',
        'PW',
        'Стяг Палауа'
    ],
    '🇵🇾': [
        'Прапор Парагваю',
        'PY',
        'Paraguayan Flag'
    ],
    '🇶🇦': [
        'Прапор Катару',
        'QA',
        'Стяг Катарі'
    ],
    '🇷🇪': [
        'Прапор Реюньйону',
        'ПдС',
        'Прапор штату Реюньйоне'
    ],
    '🇷🇴': [
        'Прапор Румунії',
        'Ро-версія',
        'Румунський прапор'
    ],
    '🇷🇸': [
        'Прапор Сербії',
        'ПС',
        'Сербський прапор'
    ],
    '🇷🇺': [
        'Прапор Росії',
        'Ру',
        'Російський прапор'
    ],
    '🇷🇼': [
        'Flag of Rwanda',
        'RW',
        'Rwandan Flag'
    ],
    '🇸🇦': [
        'Прапор Саудівської Аравії',
        'SA',
        'Прапор Саудівської Аравії'
    ],
    '🇸🇧': [
        'Прапор Соломонових Островів',
        'SB',
        'Прапор Соломонових Островів'
    ],
    '🇸🇨': [
        'Прапор Сейшельських Островів',
        'СК',
        'Seychellois Flag'
    ],
    '🇸🇩': [
        'Прапор Судану',
        'СМД',
        'Sudanese Flag'
    ],
    '🇸🇪': [
        'Прапор Швеції',
        'ПдС',
        'Шведський прапор'
    ],
    '🇸🇬': [
        'Прапор Сінгапуру',
        'ПГ',
        'Сінгапурський прапор'
    ],
    '🇸🇭': [
        'Прапор острова Святої Єлени',
        'Пдх'
    ],
    '🇸🇮': [
        'Прапор Словенії',
        'Пд',
        'Словенський прапор'
    ],
    '🇸🇯': [
        'Прапор Шпіцбергену і Ян-Маєн',
        'Джей'
    ],
    '🇸🇰': [
        'Прапор Словаччини',
        'SK',
        'Словацький прапор',
        'Slovakian Flag'
    ],
    '🇸🇱': [
        'Прапор Сьєрра-Леоне',
        'SL',
        'Sierra Leonean Flag'
    ],
    '🇸🇲': [
        'Прапор Сан-Марино',
        'ПМ',
        'Санмаринський прапор'
    ],
    '🇸🇳': [
        'Прапор Сенегалу',
        'Номер мережі',
        'Прапор Сенгали'
    ],
    '🇸🇴': [
        'Прапор Сомалі',
        'Сон',
        'Somalian Flag'
    ],
    '🇸🇷': [
        'Прапор Суринаму',
        'МПП',
        'Прапор Сурінамера'
    ],
    '🇸🇸': [
        'Прапор Південного Судану',
        'SS',
        'Стяг Південного Судану'
    ],
    '🇸🇹': [
        'Прапор Саюріо Томе і Пріонсіпі',
        'ПДВ'
    ],
    '🇸🇻': [
        'Прапор Сальвадору',
        'МП',
        'Прапор Сальвадора'
    ],
    '🇸🇽': [
        'Прапор Сінт-Мартену',
        'SX'
    ],
    '🇸🇾': [
        'Прапор Сирії',
        'SY',
        'Прапорець Сирії'
    ],
    '🇸🇿': [
        'Прапор Свазіленду',
        'SZ',
        'Прапор Есватіні'
    ],
    '🇹🇦': [
        'Flag of Tristan Da Cunha',
        'Та'
    ],
    '🇹🇨': [
        'Прапор Островів Теркс і Кайкос',
        'ТК'
    ],
    '🇹🇩': [
        'Прапор Чаду',
        'ШВ',
        'Стяг Чаду'
    ],
    '🇹🇫': [
        'Прапор Французьких Південних територій',
        'ШВ',
        'Французький прапор південних земель'
    ],
    '🇹🇬': [
        'Прапор Того',
        'TG',
        'Togolese Flag'
    ],
    '🇹🇭': [
        'Прапор Таїланду',
        'Чт',
        'Стяг Таїланду'
    ],
    '🇹🇯': [
        'Прапор Таджикистану',
        'TJ',
        'Таджицький прапор'
    ],
    '🇹🇰': [
        'Прапор Токелау',
        'TK',
        'Стяг Токелауа'
    ],
    '🇹🇱': [
        'Прапор Тимор-Лешті',
        'TL',
        'Прапор Східного Тимору',
        'Прапор Східного Тимореса'
    ],
    '🇹🇲': [
        'Прапор Туркменістану',
        'Пам\'ять перекладів',
        'Turkmen Flag'
    ],
    '🇹🇳': [
        'Прапор Тунісу',
        'ТН',
        'Стяг Тунісу'
    ],
    '🇹🇴': [
        'Прапор Тонги',
        'До',
        'Tongan Flag'
    ],
    '🇹🇷': [
        'Прапор Туреччини',
        'ТР',
        'Турецький прапор'
    ],
    '🇹🇹': [
        'Прапор Тринідаду і Тобаго',
        'ТТ'
    ],
    '🇹🇻': [
        'Прапор Тувалу',
        'ТВ',
        'Стяг Тувалуана'
    ],
    '🇹🇼': [
        'Прапор Тайваню',
        'TW',
        'Тайванський прапор'
    ],
    '🇹🇿': [
        'Прапор Танзанії',
        'TZ',
        'Tanzanian Flag'
    ],
    '🇺🇦': [
        'Прапор України',
        'UA',
        'Український прапор'
    ],
    '🇺🇬': [
        'Прапор Уганди',
        'UG',
        'Стяг Уганди'
    ],
    '🇺🇲': [
        'Прапор: Віддалені острови США',
        'UM'
    ],
    '🇺🇸': [
        'Прапор Сполучених Штатів Америки',
        'США',
        'Американський прапор',
        'Стяг США'
    ],
    '🇺🇾': [
        'Flag of Uruguay',
        'UY',
        'Uruguayan Flag'
    ],
    '🇺🇿': [
        'Flag of Uzbekistan',
        'UZ',
        'Uzbekistani Flag',
        'Uzbek Flag'
    ],
    '🇻🇦': [
        'Прапор Ватикану',
        'VA',
        'Прапорець Вантікану'
    ],
    '🇻🇨': [
        'Прапор Сент-Вінсенту і Гренадинів',
        'ДП'
    ],
    '🇻🇪': [
        'Прапор Венесуели',
        'Ве',
        'Венесуельський прапор'
    ],
    '🇻🇬': [
        'Прапор Британських Віргінських Островів',
        'ДП',
        'Британський прапор Віргінського острова'
    ],
    '🇻🇮': [
        'Прапор Американських Віргінських Островів',
        'VI',
        'Прапор Американських Віргінських Островів'
    ],
    '🇻🇳': [
        'Прапор В\'єтнаму',
        'VN',
        'В\'єтнамський прапор'
    ],
    '🇻🇺': [
        'Flag of Vanuatu',
        'VU',
        'Ni-Vanuatu Flag'
    ],
    '🇼🇫': [
        'Прапор Воллісу і Футуни',
        'Тиждень'
    ],
    '🇼🇸': [
        'Прапор Самоа',
        'ЗС',
        'Samoan Flag'
    ],
    '🇽🇰': [
        'Прапор Косова',
        'XK',
        'Kosovar Flag'
    ],
    '🇾🇪': [
        'Прапор Ємену',
        'YE',
        'Стяг Ємену'
    ],
    '🇾🇹': [
        'Прапор Майотти',
        'YT',
        'Стяг Майотти'
    ],
    '🇿🇦': [
        'Прапор Південної Африки',
        'ЗА',
        'Південноафриканський прапор'
    ],
    '🇿🇲': [
        'Прапор Замбії',
        'ЗМ',
        'Zambian Flag'
    ],
    '🇿🇼': [
        'Прапор Зімбабве',
        'ЗП',
        'Прапор Зімбабве',
        'Сім прапор'
    ]
};
/*sports*/
emojis_language[lang][8] = {
    '🧗{{skin_tone}}‍‍♂️': [
        'Сходження',
        'Мале Кам\'яне сходження',
        'Сходження людини'
    ],
    '🧗{{skin_tone}}‍‍♀️': [
        'Жінка-скелелазіння',
        'Кам\'яне сходження',
        'Жінка зі скелетом'
    ],
    '🏇{{skin_tone}}‍': [
        'Кінні перегони',
        'Кінські перегони',
        'Жокей'
    ],
    '⛷{{skin_tone}}‍️': ['Скайер'],
    '🏂{{skin_tone}}‍': ['Snowboarder'],
    '🏌️{{skin_tone}}‍♂️': ['Man Golfer'],
    '🏌️{{skin_tone}}‍♀️': ['Жінка-Голфер'],
    '🏄{{skin_tone}}‍♂️': ['Серфер'],
    '🏄{{skin_tone}}‍♀️': ['Жінка-серфер'],
    '🚣{{skin_tone}}‍‍♂️': ['Чоловічий човен'],
    '🚣{{skin_tone}}‍‍♀️': ['Жіночий човен для королі'],
    '🏊{{skin_tone}}‍‍♂️': [
        'Чоловік плаває',
        'Чоловік у плавання'
    ],
    '🏊{{skin_tone}}‍‍♀️': [
        'Жінка плавання',
        'Жінка Плавмер'
    ],
    '⛹{{skin_tone}}‍️‍♂️': [
        'Мен Болл',
        'Людина з баскетболіста'
    ],
    '⛹️{{skin_tone}}‍♀️': [
        'Жіноча кулька, що стрибає',
        'Жіночий баскетбольний програвач'
    ],
    '🏋️{{skin_tone}}‍♂️': [
        'Людина, що піднімає ваги',
        'Важка атлетика'
    ],
    '🏋️{{skin_tone}}‍♀️': [
        'Життєві ваги жінки',
        'Важка жінка'
    ],
    '🚴{{skin_tone}}‍♂️': [
        'Чоловічий велосипед',
        'Чоловік Цикліст',
        'Чоловічий цикліст'
    ],
    '🚴{{skin_tone}}‍♀️': [
        'Жінка-байкінг',
        'Цикліст жіночий',
        'Жін. цикліст'
    ],
    '🚵{{skin_tone}}‍♂️': [
        'Чоловіцький гірський байк',
        'Мен-Маунтен-байкер'
    ],
    '🚵{{skin_tone}}‍♀️': [
        'Жіночий гірський велосипед',
        'Жіночий гірський байкер'
    ],
    '🤸{{skin_tone}}‍♂️': [
        'Чоловіче укриття',
        'Чоловік з декартою'
    ],
    '🤸{{skin_tone}}‍♀️': [
        'Жінка-картінг',
        'Жінка-дзижчання'
    ],
    '🤼': [
        'Люди боротьби',
        'Боротьба',
        'Борці'
    ],
    '🤽{{skin_tone}}‍♂️': ['Людина, що грає в водне поло'],
    '🤽{{skin_tone}}‍♀️': ['Жінка, яка грає в водне поло'],
    '🤾{{skin_tone}}‍♂️': ['Людина, що грає в гандбол'],
    '🤾{{skin_tone}}‍♀️': ['Жінка, що грає в гандбол'],
    '🤹{{skin_tone}}‍♂️': [
        'Жонглювання',
        'Чоловічий жонглер'
    ],
    '🤹{{skin_tone}}‍♀️': [
        'Жіноча жонглювання',
        'Жін. жонглер'
    ],
    '🧘{{skin_tone}}‍♂️': ['Людина в лотусі'],
    '🧘{{skin_tone}}‍♀️': ['Жінка в лотусі'],
    '🏃{{skin_tone}}‍♂️': ['Чоловік, що біжить'],
    '🏃{{skin_tone}}‍♀️': ['Жінка-біг'],
    '🕺{{skin_tone}}‍': ['Танці людини'],
    '💃{{skin_tone}}‍': ['Жіночі танці'],
    '🤺': [
        'Персон Фехтування',
        'Фансівники'
    ],
    '🏆': [
        'Трофей',
        'Чемпіонат',
        'Переможець'
    ],
    '🏅': ['Медаль Спортів'],
    '🥇': [
        'Медаль за перше місце',
        'Медаль за перше місце',
        'Золота Медаль'
    ],
    '🥈': [
        'Медаль за друге місце',
        'Медаль за друге місце',
        'Срібна Медаль'
    ],
    '🥉': [
        'Медаль за 3-є місце',
        'Медаль за Третій Місце',
        'Бронзова медаль'
    ],
    '⚽': [
        'Футбол',
        'Футбол'
    ],
    '⚾': [
        'Бейсбол',
        'Софтбол',
        'Білі'
    ],
    '🥎': [
        'Софтбол',
        'Жовтий колір'
    ],
    '🏀': [
        'Баскетбол',
        'Помаранчевий',
        'Баскетбол і хребет'
    ],
    '🏐': ['Волейбол'],
    '🏈': [
        'Американський футбол',
        'Футбол',
        'Gridiron',
        'Суперчаша'
    ],
    '🏉': [
        'Регбі з футболу',
        'Футбол',
        'Ліга',
        'Регбі',
        'Юніон'
    ],
    '🎾': [
        'Теніс',
        'Куля',
        'Рекет',
        'Раке'
    ],
    '🥏': [
        'Літаючий диск',
        'Фрісбі'
    ],
    '🎳': [
        'Боулінг',
        'Контакти',
        'Скотлз',
        'Десять Пін-Боулінг'
    ],
    '🏏': [
        'Крикет',
        'Кажан',
        'Куля'
    ],
    '🏑': [
        'Польський хокей',
        'Куля',
        'Прикріпити'
    ],
    '🏒': [
        'Хокей',
        'Куля',
        'Прикріпити'
    ],
    '🥍': [
        'Лакрос',
        'Куля',
        'Прикріпити'
    ],
    '🏓': [
        'Пінґ-понґ',
        'Настільний теніс',
        'Куля',
        'Paddle'
    ],
    '🏸': [
        'Badminton',
        'Волан',
        'Раке'
    ],
    '🥊': ['Боксерські рукавички'],
    '🥋': [
        'Бойові мистецтва',
        'Дзюдо',
        'Карате',
        'Кунфу'
    ],
    '⛳': [
        'Прапор в дірі',
        'Стяг для гольфу'
    ],
    '⛸️': [
        'Ковзани',
        'Катання на ковзанах'
    ],
    '🎣': [
        'Риболовля',
        'Поле',
        'Риба',
        'Вудка'
    ],
    '🎽': [
        'Футболка з запуском',
        'Сингле',
        'Сеш'
    ],
    '🎿': [
        'Скіс',
        'Катання на лижах',
        'Завантаження'
    ],
    '🛷': ['Сани'],
    '🥌': ['Керлінг-камінь'],
    '🎯': [
        'Прямий Удар',
        'Стрільба з лука',
        'Bullseye',
        'Дартс'
    ],
    '🎱': [
        'Куля басейну 8',
        'Кий м\'яч',
        'Снукер',
        'Більярди'
    ],
    '🎮': [
        'Режим Video Game Controller',
        'Плейстаціонація',
        'Xbox',
        'Геймпад',
        'Wii U'
    ],
    '♟️': ['Чорний шаховий пішак'],
    '🏹': [
        'Лук і стріла',
        'Арка'
    ],
    '🥅': ['Ціль сіткою'],
    '🀄': [
        'Маджонг Ред Дракон',
        'Маджонг',
        'Mahjong Tile',
        '中',
        'Маджонг Тіл Ред Дракон'
    ],
    '🎴': [
        'Квіткові картки',
        'Колода карток',
        'Hanafuda',
        'Hwatu',
        'Гра у карти'
    ]
};
/*travel and places*/
emojis_language[lang][9] = {
    '🚂': [
        'Локомотив Steam',
        'Пар',
        'Залізничний локомотив'
    ],
    '🚃': [
        'Залізничний автомобіль',
        'Залізничний кар',
        'Залізничний автомобіль',
        'Залізнична карета',
        'Знак залізничного вагона'
    ],
    '🚄': ['Високошвидкісний поїзд'],
    '🚅': [
        'Потяг з кулі',
        'Shinkansen',
        'Покращений поїзд із кулями носа'
    ],
    '🚆': ['Поїзд'],
    '🚇': [
        'Андеґраунд',
        'Трубка',
        'Метро',
        'Метро'
    ],
    '🚈': [
        'Світла залізниця',
        'Поїзд'
    ],
    '🚊': ['Трамвай'],
    '🚝': [
        'Монорейка',
        'Поїзд'
    ],
    '🚞': [
        'Гірська залізниця',
        'Funicular',
        'Залізниця і гора'
    ],
    '🚋': ['Трамвайний автомобіль'],
    '🚌': [
        'Автобус',
        'Тренер'
    ],
    '🚍': [
        'Поточний автобус',
        'Фронт автобуса'
    ],
    '🚎': [
        'Тролейбус',
        'Електроавтобус'
    ],
    '🚐': [
        'Minibus',
        'Мінівен',
        'Люль-Мувер'
    ],
    '🚑': ['Амоглентність'],
    '🚒': [
        'Пожежний автомобіль',
        'Вогняний відділ',
        'Вогнева Вантажівка'
    ],
    '🚓': [
        'Поліцейський автомобіль',
        'Поліцейський автомобіль',
        'Відбіл поліцейського автомобіля'
    ],
    '🚔': [
        'Незабутній поліцейський автомобіль',
        'Передня поліційний автомобіль',
        'Поліцейський автомобіль'
    ],
    '🚕': [
        'Таксі',
        'Нью-Йорк Таксі',
        'Відхід від таксі'
    ],
    '🚖': [
        'Таксі',
        'Прийдешні таксі',
        'Фронт таксі'
    ],
    '🚗': [
        'Автомобіль',
        'Червоний автомобіль',
        'Біля автомобіля'
    ],
    '🚘': [
        'Поточний автомобіль',
        'Червоний автомобіль',
        'Передня частина автомобіля'
    ],
    '🚚': [
        'Вантажівка доставки',
        'Лоррі'
    ],
    '🚛': [
        'Артикуляція Лоррі',
        'Зелена вантажівка'
    ],
    '🚜': [
        'Трактор',
        'Ферма'
    ],
    '🛻': ['Пікап'],
    '🏎️': [
        'Гонковий автомобіль',
        'Ф1',
        'Формула-1',
        'Гоночний автомобіль'
    ],
    '🏍️': [
        'Мотоцикл',
        'Мотоцикл'
    ],
    '🛵': [
        'Мотор самокат',
        'Vespa',
        'Моторний велосипед',
        'Моторний велосипед'
    ],
    '🛺': [
        'Авто Рікша',
        'Tuk Tuk'
    ],
    '🚲': [
        'Велосипед',
        'Велосипед'
    ],
    '🛴': ['Кік Скутер'],
    '⛵': [
        'Сильний човен',
        'Дінгі',
        'Яхт'
    ],
    '🚤': [
        'Прискорювач',
        'Моторний човен',
        'Пауербот'
    ],
    '🛳️': ['Пасажирське судно'],
    '⛴️': ['Феррі'],
    '🛥️': ['Моторний човен'],
    '🚢': ['Круїзний корабель'],
    '✈️': [
        'Літак',
        'Aeroplane'
    ],
    '🛩️': [
        'Маленький літак',
        'Малий літак'
    ],
    '🚁': ['Вертоліт'],
    '🚟': ['Підвісна залізниця'],
    '🚠': ['Маунтен-Кейбвей'],
    '🚡': [
        'Повітряний трамвай',
        'Кабельний автомобіль',
        'Gondola',
        'Ропуей'
    ],
    '🛰️': ['Супутниковий'],
    '🚀': [
        'Ракета',
        'Спейс Шаттл'
    ],
    '🛸': [
        'Летючий блюдце',
        'УФО'
    ],
    '🚉': [
        'Залізничний вокзал',
        'Залізнична платформа'
    ],
    '🚏': ['Автобусна зупинка'],
    '🛣️': [
        'Моторуей',
        'Дорога',
        'Хайвей',
        'Інтердержава'
    ],
    '🛤️': ['Залізнична колія'],
    '🛫': [
        'Від\'їзд літака',
        'Зліт'
    ],
    '🛬': [
        'Прибуття літака',
        'У літаку',
        'Посадка'
    ],
    '🗾': ['Карта Японії'],
    '⛰️': ['Гора'],
    '🏔️': ['Снігова гора'],
    '🌋': ['Вулкан'],
    '🗻': [
        'Гора Фудзі',
        'Фудзі-сан'
    ],
    '🏕️': [
        'Табір',
        'Кемпінг'
    ],
    '🏖️': ['Пляж із парасолькою'],
    '🏜️': ['Desert'],
    '🏝️': ['Пустельний острів'],
    '🏞️': ['Національний парк'],
    '🏟️': [
        'Стадіон',
        'Грандстань',
        'Спорт Стедіум'
    ],
    '🏛️': [
        'Класичний будинок',
        'Грецька',
        'Рим'
    ],
    '🏗️': [
        'Будівництво Будівель',
        'Журавлі'
    ],
    '🏘️': [
        'Будинки будинків',
        'Група будинків'
    ],
    '🏚️': [
        'Будинок з Дерев',
        'Занедбаний будинок',
        'Старий дім',
        'Будинок з привидами'
    ],
    '🏠': [
        'Головна',
        'Будинок будинку'
    ],
    '🏡': [
        'Будинок з садом',
        'Дім та Дерево'
    ],
    '🏢': [
        'Офісний корпус',
        'Міські будинки',
        'Покращений будинок'
    ],
    '🏣': [
        'Японський пост',
        'Японська поштова марка'
    ],
    '🏤': [
        'Поштове відділення',
        'Європейський поштовий відділ'
    ],
    '🏥': [
        'Лікарня',
        'Ер',
        'A&E',
        'Аварійна кімната',
        'Аварія та надзвичайна ситуація',
        'Червоний хрест',
        'Медичні проблеми'
    ],
    '🏦': [
        'Банк',
        'BK',
        'Bakkureru',
        'Відділення банку',
        'Bakkureru'
    ],
    '🏨': [
        'Готель',
        'Акомодація',
        'H-будівля'
    ],
    '🏩': [
        'Готель кохання',
        'Готель любове серце'
    ],
    '🏪': [
        'Крамниця',
        '24-годинний магазин',
        '7-Ілевен',
        'Магазин кутів',
        'Kwik-E-Mart'
    ],
    '🏫': [
        'Школа',
        'Годинникова вежа',
        'Початковий високий середній'
    ],
    '🏬': [
        'Універмаг',
        'Центр покупок',
        'Крамниця'
    ],
    '🏭': [
        'Фабрика',
        'Промисловий',
        'Промисловість',
        'Забруднення',
        'Смог'
    ],
    '🏯': [
        'Японський замок',
        'Фортеця'
    ],
    '🏰': [
        'Європейський Замок',
        'Turrets'
    ],
    '💒': [
        'Церковне серце',
        'Церковне весілля',
        'Шлюб'
    ],
    '🗼': [
        'Токійська вежа',
        'Ейфелева вежа',
        'Червона вежа'
    ],
    '🗽': [
        'Статуя Свободи',
        'Нью-Йорк'
    ],
    '⛪': [
        'Церковний будівництво',
        'Кросс'
    ],
    '🕌': [
        'Мечеть',
        'Домед Покрівля',
        'Minaret'
    ],
    '🛕': ['Хіндуси'],
    '🕍': [
        'Синагога',
        'Іудаїзм',
        'Synagog',
        'Темпл'
    ],
    '⛩️': [
        'Святилище',
        'Камі-но-мичі'
    ],
    '🕋': [
        'Kaaba',
        'Mecca'
    ],
    '🏙️': ['Cityscape'],
    '⛱️': [
        'Парасоля на суходолі',
        'Пляжна парасолька'
    ],
    '🌄': [
        'Східний Схід',
        'Ранок',
        'Схід сонця'
    ],
    '🌅': [
        'Схід сонця',
        'Захід Сонця'
    ],
    '🌆': [
        'Столичні рослини в сутінках',
        'Апельсинове небо',
        'Вест-Сіті'
    ],
    '🌇': [
        'Захід сонцем над будівлями',
        'Місто сонця'
    ],
    '🌃': [
        'Ніч із зірками',
        'Місто на ночі',
        'Зоряна ніч'
    ],
    '🗿': [
        'Moai',
        'Пам\'ятник острову Пасхи',
        'Людські рок вирізьблення',
        'Статуя Мояї'
    ],
    '🌠': [
        'Стрільба зірка',
        'Коли ви мрієте у зірці',
        'Метеороїд'
    ],
    '🌌': [
        'Чумацький шлях',
        'Галактика',
        'Нічне небо',
        'З відступом',
        'Зірочки',
        'Всесвіт'
    ],
    '🎑': [
        'Церемонія перегляду Місяця',
        'Трава, Галушки та Мун',
        'Зібрати місяць',
        'Свято середини осені',
        'Tsukimi'
    ],
    '🛖': ['Халабуда'],
    '🎢': [
        'Американські гірки',
        'Роллеркостер',
        'Парк тем'
    ]
};
/*technologies (smartphones, laptops, etc.) and office*/
emojis_language[lang][10] = {
    '⌚': [
        'Дивитися',
        'Тімеп\'єке',
        'Apple Watch'
    ],
    '⏰': ['Будильник'],
    '⏱️': ['Секундомір'],
    '⏲️': ['Годинник таймера'],
    '🕰️': ['Годинник із Святої Шври'],
    '🧭': ['Компас'],
    '🕹️': ['Джойстик'],
    '🎙️': ['Мікрофон студії'],
    '🎚️': ['Рівень повзунка'],
    '🎛️': ['Керування вузлами'],
    '📻': [
        'Радіомодуль',
        'Цифрове радіо',
        'Бездротовий'
    ],
    '📱': [
        'Мобільний телефон',
        'Смартфон',
        'iPhone',
        'Мобільний телефон'
    ],
    '📲': [
        'Мобільний телефон з стрілою праворуч',
        'Дзвінок',
        'Вказівки на телефон'
    ],
    '☎️': [
        'Чорний телефон',
        'Обертати телефон',
        'Червоний'
    ],
    '📞': [
        'Ресивер телефону',
        'Handset',
        'Телефон',
        'Чорний колір'
    ],
    '📟': [
        'Пейджер',
        'Біпер',
        'Кровожера'
    ],
    '📠': [
        'Факс в машині',
        'Facsimile',
        'Факс'
    ],
    '🔋': [
        'Батарея',
        'Зарядний пристрій',
        'Акумулятор телефону'
    ],
    '🔌': [
        'Електрична зарядка',
        'AC Adaptor',
        'Стебл',
        'Електрозарядний пристрій'
    ],
    '💻': [
        'Ноутбук',
        'Записник',
        'Персональний комп\'ютер',
        'ПК',
        'Маккнига',
        'Поверхня'
    ],
    '🖥️': [
        'Стільничний комп\'ютер',
        'iMac',
        'ПК'
    ],
    '🖨️': ['Принтер'],
    '⌨️': ['Keyboard'],
    '🖱️': [
        'Комп\'ютерна Миша',
        'Три кнопки миші'
    ],
    '🖲️': ['Трекбол'],
    '💽': [
        'Комп\'ютерний диск',
        'Minidisc',
        'ЦентрЗах',
        'DVD',
        'Сині промені',
        'BD'
    ],
    '💾': [
        'диск Фліппі',
        '3.5icip<unk> диск',
        'Диск'
    ],
    '💿': [
        'Оптичний диск',
        'ЦентрЗах',
        'CD-ROM',
        'Компактний диск'
    ],
    '📀': [
        'DVD',
        'DVD-прошивка',
        'DVD відео'
    ],
    '🎥': [
        'Кінокамера',
        'Кінокамера',
        'Голлівуд',
        'Фільми'
    ],
    '🎞️': ['Кадри фільму'],
    '📽️': ['Монтажний Проектор'],
    '📺': [
        'Телебачення',
        'ТВ'
    ],
    '📷': ['Цифрова камера'],
    '📸': ['Камера з Flash'],
    '📹': [
        'Відеокамера',
        'Відеокамера'
    ],
    '📼': [
        'Відеокасета',
        'ПО ВХС',
        'VCR',
        'Відеозйомка',
        'Відеокасета'
    ],
    '💳': [
        'Кредитна Картка',
        'Дебетова картка',
        'АМЕкс',
        'Diners Club',
        'Американський експрес',
        'Карти Mastercard',
        'VISA картка'
    ],
    '📧': [
        'Е-пошта',
        'Ел. пошта'
    ],
    '📨': [
        'Конверт вхідних повідомлень',
        'Конверт з рядками',
        'Швидкий Конверт'
    ],
    '📩': [
        'Конверт із нижньою Стрілою вище',
        'Конверт Стрілки вниз',
        'Вставити в конверті'
    ],
    '📤': ['Зафіксувати трей'],
    '📥': ['Вхідний лоток'],
    '📮': ['Постбокс'],
    '📁': [
        'Папка файлу',
        'Тека',
        'Каталог',
        'Тека закритого файлу'
    ],
    '📂': [
        'Відкрити теку з файлом',
        'Каталог'
    ],
    '🗂️': ['Роздільники карт'],
    '📅': [
        'Календар',
        '17 липня',
        'Всесвітній день емодзі'
    ],
    '🗓️': ['Спіральний календар'],
    '📆': [
        'Tear-Off Calendar',
        'Календар дня',
        'Настільний календар'
    ],
    '📈': [
        'Збільшення діаграми',
        'Позитивна діаграма',
        'Графік Вказівника',
        'Графік з тенденцією зростання'
    ],
    '📉': [
        'Графік зменшено',
        'Від\'ємна діаграма',
        'Вниз розташування графіка',
        'Графік із Динамічним трендом'
    ],
    '📊': [
        'Гістограма',
        'Графік Бара'
    ],
    '📌': [
        'Пушпін',
        'Thumb Tack'
    ],
    '📋': ['Буфер обміну'],
    '📍': [
        'Раунд Пушпін',
        'Втрачена зв\'язка',
        'Закріплення мапи',
        'Закріплення повідомлень',
        'Червона Пінка'
    ],
    '📎': [
        'Корабельна зйомка',
        'Кліппі'
    ],
    '📏': ['Прямий правитель'],
    '📐': [
        'Трикутний завод',
        'Лінійка трикутників'
    ],
    '✂️': [
        'Ножиці',
        'Різання'
    ],
    '✏️': [
        'Олівець',
        'Свинець Олівець'
    ],
    '✒️': [
        'Чорна курячка',
        'Пен Ніб',
        'Фонтан Пен'
    ],
    '🖋️': [
        'Фонтан Пен',
        'Нижня ліва фонтан Пен'
    ],
    '🖊️': [
        'Ручка',
        'Нижня ліва кулькова ручка',
        'Обмежувальна Пен'
    ],
    '🖌️': [
        'Пензлик',
        'Щітка',
        'Нижня ліва фарба'
    ],
    '🖍️': [
        'Crayon',
        'Нижній лівий крейон'
    ],
    '📝': [
        'Примітка',
        'Memorandum',
        'Примітка',
        'Олівець та папери'
    ],
    '🗑️': [
        'Кошик для Сховища',
        'Сміття Можна',
        'Корпус Рубіша',
        'Мітка в кошику'
    ],
    '📡': ['Супутникова антена'],
    '🔭': [
        'Телескоп',
        'Зоряна брама'
    ],
    '🔬': [
        'Мікроскоп',
        'Magnify',
        'Наука'
    ],
    '📭': ['Відкрийте поштову скриньку з низьким рівнем'],
    '📬': [
        'Відкрийте поштову скриньку з піднятим прапором',
        'Відкрити поштову скриньку'
    ],
    '📪': ['Закрита поштова скринька з низьким рівнем'],
    '📫': ['Закрита поштова скринька з піднятим Прапором'],
    '📰': ['Газета'],
    '🗞️': [
        'Прискорена газета',
        'Доставка газети'
    ],
    '📄': [
        'Сторінка фасаду вгору',
        'Друкована сторінка'
    ],
    '📜': [
        'Прокрутка',
        'Градус',
        'Parchment'
    ],
    '📃': [
        'Сторінка з Curl',
        'Curled Page',
        'Curly Page'
    ],
    '📓': [
        'Записник',
        'Чорна і Біла книга'
    ],
    '📔': ['Блокнот з декоративною обкладинкою'],
    '📕': [
        'Закрита книга',
        'Червона книга',
        'Червоний підручник'
    ],
    '📖': [
        'Відкрити книгу',
        'Книжка',
        'Роман'
    ],
    '📗': [
        'Зелена книга',
        'Зелений підручник'
    ],
    '📘': [
        'Блакитна книга',
        'Синій Підручник'
    ],
    '📙': [
        'Помаранчева книга',
        'Помаранчевий Підручник'
    ],
    '📚': [
        'Книжки',
        'Купа книг',
        'Стек книг'
    ],
    '🗳️': [
        'Коробка з кульоком',
        'Коробка голосування',
        'Голосування'
    ],
    '🗄️': [
        'Кабінет файлів',
        'Шафа для фільтрації'
    ],
    '🗃️': ['Файл картки'],
    '🖇️': ['Пов\'язані скріжки']
};
/*clothes and accessories*/
emojis_language[lang][11] = {
    '👣': [
        'Місця розташування',
        'Ноги',
        'Кроки харчування'
    ],
    '👓': [
        'Окуляри',
        'Евейкелихи'
    ],
    '🕶️': ['Сонцезахисні окуляри'],
    '🥽': ['Захисні окуляри'],
    '🥼': ['Лабораторія'],
    '👔': [
        'Necktie',
        'Бізнес-сорочка',
        'Сорочка та лють'
    ],
    '👕': [
        'Футболка',
        'Чайна сорочка',
        'Поло Ширт'
    ],
    '👖': [
        'Джинси',
        'Джинса',
        'Штани',
        'Штани'
    ],
    '🧣': ['Scarf'],
    '🧤': ['Рукавиці'],
    '🧥': ['Плащ'],
    '🧦': ['Socks'],
    '👗': [
        'Сукня',
        'Спідниця',
        'Місто'
    ],
    '👘': [
        'Kimono',
        'Дрезінська брама',
        'Японська сукня'
    ],
    '👙': [
        'Бікіні',
        'Ванна',
        'Купальний костюм'
    ],
    '🩱': ['Полум’яний костюм'],
    '👚': [
        'Жінки одягу',
        'Blouse',
        'Рожева сорочка',
        'Blouse'
    ],
    '👛': [
        'Гаманець',
        'Гаманець'
    ],
    '👜': ['Сумка'],
    '👝': [
        'Зчеплення мішок',
        'Зчеплення',
        'Малий мішок',
        'Pouch'
    ],
    '🎒': [
        'Рюкзак',
        'Сумка',
        'Шкільний мішок',
        'Школа Сатчел',
        'Rucksack'
    ],
    '👞': [
        'Mans Shoe',
        'Легке взуття',
        'Коричневе шоу',
        'Серіал Сукні'
    ],
    '👟': [
        'Атлетичний череп',
        'Запущене черево',
        'Sneaker',
        'Бігун',
        'Тренування',
        'Теніс взуття'
    ],
    '🥾': ['Чоботи на посяганні'],
    '🥿': ['Плоский череп'],
    '👠': [
        'Тіль під ногою',
        'Стилетто',
        'Високі підбори'
    ],
    '👡': [
        'Жінки Сандал',
        'Ладан Сандал',
        'Saldals'
    ],
    '👢': [
        'Чоботи жінок',
        'Коров\'яче Чоботи',
        'Покращені Чоботи',
        'Чоботи на підборах'
    ],
    '👑': [
        'Корона',
        'Король',
        'Королева',
        'Принц',
        'Роял',
        'Принцеса'
    ],
    '👒': [
        'Капелюх',
        'Жіночий капелюх',
        'Капелюх з луком',
        'Леді-Хат'
    ],
    '🎩': [
        'Циліндр',
        'Формальне Знос',
        'Groom'
    ],
    '🎓': [
        'Кепка випускника',
        'Коледж',
        'Випускний',
        'Дошка розчину',
        'Університет',
        'Квадратна академічна шапка'
    ],
    '🧢': [
        'Кришка оплаченого рахунку',
        'Бейсболка'
    ],
    '⛑️': [
        'Шолом з Білим Хрестом',
        'Шанський Шолом Виконавця'
    ],
    '💼': [
        'Портфель',
        'Валіза'
    ],
    '🎖️': [
        'Військова Медаль',
        'Медаль',
        'Медальйон',
        'Прикраса військ'
    ],
    '📿': [
        'Молитви',
        'Зікр',
        'Розарі Біс'
    ],
    '🎗️': ['Нагадування Ріббо'],
    '🤿': ['Маска для пірнання'],
    '🦺': ['Безпечний жилет'],
    '🥻': [
        'Сарі',
        'Сарі',
        'Шарі'
    ],
    '🩲': ['Брифи'],
    '🩳': ['Шорти'],
    '🛼': [
        'Ковзання на роликах',
        'Вбудований ковзант',
        'Роллер Дербі'
    ],
    '🩴': [
        'Віддзеркалити підлогу',
        'Тхонг Сандал'
    ],
    '🪖': ['Військовий Шолом'],
    '🩰': [
        'Балет-Черевики',
        'Пуант-Шо'
    ]
};
/*hands and parts of body*/
emojis_language[lang][12] = {
    '👋{{skin_tone}}': [
        'Похмура рука',
        'До побачення',
        'Хвиля рук',
        'Привіт',
        'Hi'
    ],
    '🖐️{{skin_tone}}': [
        'Рука з пальцями',
        'П\'ять рук',
        'Зроблена рука',
        'Розв\'язана рука з пальцями'
    ],
    '🤚{{skin_tone}}‍': [
        'Піднятий спиною від рук',
        'Диск'
    ],
    '✋{{skin_tone}}‍': [
        'Піднесена рука',
        'Висока п\'ята',
        'Зупинити'
    ],
    '🖖{{skin_tone}}‍': [
        'Vulcan Salute',
        'Spock',
        'Зоряний шлях',
        'Піднята Рука між частинами між малими і кільцями'
    ],
    '👌{{skin_tone}}‍': [
        'ОК знак руки',
        'Добре',
        'Чудово',
        'Так'
    ],
    '✌️{{skin_tone}}‍': [
        'Рука Перемоги',
        'Повітряні лапки',
        'Знак миру',
        'Підпис V'
    ],
    '🤞{{skin_tone}}‍': [
        'Підключені пальці',
        'Відбитки пальця перейшли',
        'Успіх',
        'Рука об Індекс і середні пальці перейшла'
    ],
    '🤟{{skin_tone}}‍': [
        'Чудово, ви жести',
        'Я люблю тобі наш вказівник'
    ],
    '🤘{{skin_tone}}‍': [
        'Знак Рогів',
        'Диявольські пальці',
        'Важкий метал',
        'На камені'
    ],
    '🤙{{skin_tone}}‍': [
        'Називай мене вказівкою руки',
        'Рука телефону',
        'Шака'
    ],
    '🤏{{skin_tone}}‍': ['Щипча рука'],
    '👈{{skin_tone}}‍': [
        'Backhand індекс вказівника зліва',
        'Білий лівий індекс панелі керування'
    ],
    '👉{{skin_tone}}‍': [
        'Назад справа',
        'Білий правий індекс Backhand'
    ],
    '👆{{skin_tone}}‍': [
        'Положення індексу Панелі керування вгору',
        'Білий індекс Pointing Backhand',
        'Середній палець'
    ],
    '👇{{skin_tone}}‍': [
        'Backhand індекс скорочення',
        'Індекс білого вниз Pointing Backhand',
        'Вказівник'
    ],
    '☝{{skin_tone}}‍️': [
        'Індекс вказівника пальцем вгору',
        'Індекс білих віршів',
        'Секрет'
    ],
    '🖕{{skin_tone}}‍': [
        'Середній палець',
        'Клип птаха',
        'Грубе Фінджер',
        'Зворотна Рука з Middle Finger Extended'
    ],
    '👍{{skin_tone}}‍': [
        'Маршрут вгору',
        'Подобається',
        'Так'
    ],
    '👎{{skin_tone}}‍': [
        'Нижній знак вниз',
        'Погано',
        'Dislike',
        'Ні'
    ],
    '✊{{skin_tone}}‍': [
        'Кінський кулак',
        'Кулачний насос'
    ],
    '👊{{skin_tone}}‍': [
        'Незабутній кулак',
        'Bro Fist',
        'Brofist',
        'Куля для купи',
        'Панч',
        'Замкнутий кулак',
        'Фістинований вказівник руки'
    ],
    '🤛{{skin_tone}}‍': ['Лівий кулак'],
    '🤜{{skin_tone}}‍': ['Прямий кулак'],
    '🤌{{skin_tone}}‍': [
        'Закріплені пальці',
        'Ma Che Vuoi',
        'Гаманець для Пальців'
    ],
    '👏{{skin_tone}}‍': [
        'Знак перекриття',
        'Аплодисменти',
        'Clap',
        'Кліп',
        'Гольф Клап',
        'Круглі оплесків'
    ],
    '🙌{{skin_tone}}‍': [
        'Розвиток підсилення обох часток',
        'Виховання рук',
        'Зброя в повітрі',
        'Banzai',
        'Діва Фестива',
        'Hallelujah',
        'Похвала',
        'Дві руки'
    ],
    '👐{{skin_tone}}‍': [
        'Відкрити блок',
        'Відтінок',
        'Джазові Генди'
    ],
    '🤲{{skin_tone}}‍': [
        'Подальші пальми',
        'Dua'
    ],
    '🤝{{skin_tone}}‍': [
        'Handshake',
        'Руки струшування'
    ],
    '🙏{{skin_tone}}‍': [
        'Відкладені руки',
        'Namaste',
        'Будь ласка',
        'Молитва',
        'Дякуємо Вам',
        'Людина з відкинутою рукою'
    ],
    '✍{{skin_tone}}‍️': ['Рука писання'],
    '💪{{skin_tone}}‍': [
        'Флешані Байцепси',
        'Плексична зброя',
        'Musle',
        'Сильний'
    ],
    '🦵{{skin_tone}}‍': ['Нога'],
    '🦶{{skin_tone}}‍': ['Стопа'],
    '👂{{skin_tone}}‍': [
        'Вухо',
        'Вуха',
        'Слух',
        'Слухає'
    ],
    '👃{{skin_tone}}‍': [
        'Носе',
        'Згладжування',
        'Перехоплення',
        'Stinky'
    ],
    '🧠': ['Мізки'],
    '🦷': ['Зуби'],
    '👀': [
        'Очі',
        'Ейбеллс',
        'Манелюбні очі',
        'Мудрі очі'
    ],
    '👁️': [
        'Око',
        'Одиночне око'
    ],
    '👅': ['Язик'],
    '👄': [
        'Рот',
        'Поцілункові губи',
        'Губи'
    ],
    '🫀': ['Анатомічне серце'],
    '🫁': ['Легені'],
    '🦾': ['Механічні руки'],
    '🦿': ['Механічні ноги']
};
/*other*/
emojis_language[lang][13] = {
    '💩': [
        'Купа Пуської',
        'Собачий ґрунт',
        'Посмішка'
    ],
    '💋': [
        'Марка поцілунку',
        'Поцілункові губи'
    ],
    '💅': [
        'Ніл Польський',
        'Пальці',
        'Manicure',
        'Nonchalant'
    ],
    '🤳': [
        'Селфі',
        'Камера телефону',
        'Селфі Рука'
    ],
    '🦴': ['Кістка'],
    '🧳': [
        'З багажем',
        'Валіза'
    ],
    '🌂': [
        'Закрита парасолька',
        'Згорнута парасолька',
        'Рожева парасолька'
    ],
    '☂️': ['Парасоля'],
    '☔': [
        'Умбрелла з краплями дощем',
        'Дощ',
        'Rainy'
    ],
    '🧵': ['Огорожа ниток'],
    '🧶': ['Крен'],
    '💄': [
        'Lipstick',
        'Глосарій з губ',
        'Макіяж'
    ],
    '💍': [
        'Дзвінок',
        'Алмазне Кільце',
        'Заручники'
    ],
    '💥': [
        'Символи зіткнення',
        'Банг',
        'Вибух',
        'Зіткнення',
        'Червоний парк',
        'Вибух'
    ],
    '💫': [
        'Символ Діззі',
        'Круг і зірка'
    ],
    '💦': [
        'Символи розплавлення',
        'Плевдс',
        'Розлив води',
        'Водяні випади'
    ],
    '💨': [
        'Винищувач',
        'Швидко',
        'Пар',
        'Пастка',
        'Вітер',
        'Символ рядка',
        'Погруддя вітру'
    ],
    '🌬️': [
        'Обличчя вітру',
        'Хутер',
        'Мати природа',
        'Обличчя вітру'
    ],
    '🐾': [
        'Призупинення принтів',
        'Переваги для кішок папи',
        'Приставки собаки Папа',
        'Кіттен Пау',
        'Принципи Паку'
    ],
    '🕸️': [
        'Павутина',
        'Павутиння',
        'Веб',
        'Павутиння'
    ],
    '🦠': [
        'Мікроб',
        'Комірка',
        'Коронавірус',
        'КОВІД-19',
        'Росток',
        'Мікроорганізми',
        'Вірус'
    ],
    '💐': ['Букет з квітів'],
    '🌍': [
        'Глобус що крутить Європу',
        'Земля',
        'Глобус',
        'Планета',
        'Світ',
        'Глобус показують Європу та Африку'
    ],
    '🌎': [
        'Глобус показує Америку',
        'Земля',
        'Глобус',
        'Планета',
        'Світ'
    ],
    '🌏': [
        'Глобус шокується в Асія-Австралії',
        'Земля',
        'Глобус',
        'Планета',
        'Світ',
        'Глобус, що зображає Азію та Австралію'
    ],
    '🌐': [
        'Глобус із меридіанцями',
        'Інтернет',
        'Всесвітня павутина',
        'ЗхПдЗ'
    ],
    '🌑': [
        'Символ нового Місяця',
        'Темний Місяць',
        'Місяць тіні',
        'Сонячне затемнення'
    ],
    '🌒': ['Символи сходження Місяця сходження'],
    '🌓': ['Перший символ Quarter Moon'],
    '🌔': ['Символи сходження живого Місяця'],
    '🌕': ['Символ цілого місяця'],
    '🌖': ['Символ Гіббузового Місяця'],
    '🌗': ['Останній символ Quarter Moon'],
    '🌘': ['Символи Святого Мульця'],
    '🌙': ['Півмісяць'],
    '🌚': [
        'Молодий місяць з очима',
        'Місяць кріпі',
        'Обличчя темного місяця',
        'Молестер Мун'
    ],
    '🌝': [
        'Повні Місяці з обличчями',
        'Moonface',
        'Місячний смайлик',
        'Посвячений місяць'
    ],
    '🌛': ['Перший місяць у четверті на обличчі'],
    '🌜': ['Останній квартал Місяць з обличчя'],
    '🌞': [
        'Сонце і його обличчя',
        'Смайл Сан',
        'Sunface',
        'Смілінське Сонце'
    ],
    '☀️': [
        'НД',
        'Саншайн'
    ],
    '⭐': [
        'Зірка',
        'Біла середня зірка'
    ],
    '🌟': [
        'Освітлена зірка',
        'Сяюча зірка'
    ],
    '☁️': [
        'Хмара',
        'Хмарно',
        'Похмуро'
    ],
    '⛅': ['Хмара сонця'],
    '⛈️': [
        'Хмара з блискавкою і дощем',
        'Грім-хмара'
    ],
    '🌤️': ['Біле сонце з маленькою хмарою'],
    '🌥️': [
        'Велика хмара Сонця',
        'Вайт-Нед Хмара'
    ],
    '🌦️': ['Біле сонце і ясне хмари з дощем'],
    '🌧️': ['Хмара з дощем'],
    '🌨️': ['Хмара з снігом'],
    '🌩️': ['Хмара з блискавкою'],
    '🌪️': [
        'Смерч',
        'Хмара з торнадо'
    ],
    '🌫️': ['Fog'],
    '🌈': [
        'Веселка',
        'Гей-прайд',
        'Основна веселка'
    ],
    '❄️': [
        'Сніжинка',
        'Сніг',
        'Сніг'
    ],
    '🌀': [
        'Циклон',
        'Ураган',
        'Спіраль',
        'Швірл',
        'Смерч'
    ],
    '⚡': [
        'Знак підвищеної напруги',
        'Блискавка Bolt',
        'Громобій',
        'Висока напруга'
    ],
    '☃️': [
        'Сніговик',
        'Сніговик з сніжинками'
    ],
    '⛄': [
        'Сніговик без снігу',
        'Фрості Сніговик',
        'Olaf',
        'Сніговик'
    ],
    '☄️': ['Комета'],
    '🔥': [
        'Вогонь',
        'Полум\'я',
        'Спекотно',
        'Lit',
        'Очеретянка'
    ],
    '💧': [
        'Droplet',
        'Вода',
        'Падіння води'
    ],
    '✨': [
        'Спаркл',
        'Гліттер',
        'Shiny',
        'Новий'
    ],
    '🌊': [
        'Хвиля води',
        'Пляж',
        'Хвилі океану',
        'Море'
    ],
    '🎄': [
        'Різдвяна ялинка',
        'Різдво',
        'Різдвяне Дерево'
    ],
    '🎃': [
        'Джек-O-Ліхтар',
        'Halloween',
        'Гарбуз'
    ],
    '🌻': [
        'Соняшник',
        'Жовта квітка'
    ],
    '🌼': [
        'Blossom',
        'Квітонька квітки',
        'Daisy',
        'Жовта квітка'
    ],
    '🌷': ['Tulip'],
    '🌹': [
        'Квітка троянди',
        'Червона Троянда'
    ],
    '☘️': [
        'Шамрок',
        'Конюшина',
        'Трефойл'
    ],
    '🍀': [
        'Чотири Листа Конюшина',
        'Конюшина',
        'Ірландія',
        'Щасливий',
        'Фортуна'
    ],
    '🌸': [
        'Cherry Blossom',
        'Рожева квітка',
        'Sakura'
    ],
    '💮': [
        'Біла Квітка',
        'Cherry Blossom',
        'Паперовий дойлі',
        'Відзнака Молода'
    ],
    '🌺': ['Hibiscus'],
    '🏵️': ['Розетка'],
    '🌱': [
        'Проросток',
        'Спрінг',
        'Sprout',
        'Падіння'
    ],
    '🌲': [
        'Вічнозелене дерево',
        'Дерево',
        'Сосна'
    ],
    '🌳': [
        'Повільне дерево',
        'Заокруглене дерево'
    ],
    '🌴': [
        'Пальма',
        'Дерево Кокосу'
    ],
    '🎋': [
        'Танабата',
        'Tanabata',
        'Дерево бажань'
    ],
    '🎍': [
        'Піратська декорація',
        'Бамбук',
        'Кадомацу',
        'Новорічна Прикраса'
    ],
    '🌵': [
        'Cactus',
        'Desert'
    ],
    '🌾': [
        'Рисовий лист',
        'Кадрування',
        'Сільське господарство',
        'Пшениця',
        'Вуха Райса'
    ],
    '🌿': [
        'Трава',
        'Кадрування',
        'Рослина'
    ],
    '🍁': [
        'Листок Мейпла',
        'Канада',
        'Канадець',
        'Клен'
    ],
    '🍂': [
        'Полеглий листок',
        'Осінні листя',
        'Осіння листя',
        'Коричневе Листя',
        'Падіння листя',
        'Полегле листя'
    ],
    '🍃': [
        'Вітер',
        'Зелене листя',
        'Спрінг'
    ],
    '🪴': ['Потитований завод'],
    '🔑': [
        'Ключ',
        'Золотий ключ'
    ],
    '🗝️': ['Старий ключ'],
    '🔨': [
        'Молот',
        'Хаммер казура',
        'Handyman',
        'Інструмент'
    ],
    '⛏️': [
        'Вибрати',
        'Кирка'
    ],
    '🪓': ['Сокира'],
    '🪚': ['Теслярна пилка'],
    '🪛': ['Викрутка'],
    '🪝': ['Хук'],
    '🪠': ['Plunger'],
    '🪣': ['Відро'],
    '🔩': [
        'Гайковий болт',
        'Болт',
        'Гвинт'
    ],
    '🗜️': [
        'Затискач',
        'Злість таблиці',
        'WinZip',
        'Стиснення'
    ],
    '🔒': [
        'Заблоковано',
        'Закритий замок',
        'Навісний замок'
    ],
    '🔓': [
        'Розблоковано',
        'Відкрити Padlock',
        'Відкрити блокування'
    ],
    '🔏': [
        'Заблоковано Pen',
        'Замок та Пен',
        'Замок із фонтаном Пен',
        'Блокування чорнильною ручкою'
    ],
    '🔐': [
        'Заблоковано ключем',
        'Закритий замок з ключем'
    ],
    '🗡️': [
        'Dagger',
        'Зброя ножа'
    ],
    '⚔️': ['Перехрещено мечами'],
    '🔫': [
        'Pistol',
        'Зброя',
        'Револьвер',
        'Луската Гармата',
        'Водяний Кулемет',
        'Водяний пістоль'
    ],
    '🧰': ['Панель інструментів'],
    '🧲': ['Магніт'],
    '⛓️': ['Ланцюжки'],
    '💉': [
        'Syringe',
        'Пожертвування крові',
        'Тест крові',
        'Голка',
        'Вакцина'
    ],
    '🧬': [
        'ДНК',
        'Подвійний ДНК'
    ],
    '🧪': ['Тест труби'],
    '🛏️': [
        'Ліжко',
        'Спальня'
    ],
    '🛋️': [
        'Кушетка і лампа',
        'Кімната відпочинку',
        'Сетар',
        'Диван'
    ],
    '🪑': ['Стілець'],
    '🚪': [
        'Двері',
        'Дверний отвір',
        'Передні двері'
    ],
    '🪟': ['Вікно'],
    '🪜': ['Драбина'],
    '🪞': ['Дзеркало'],
    '🚽': [
        'Туалет',
        'Ванна кімната',
        'Лу',
        'Вбиральня',
        'Тиждень'
    ],
    '🚿': [
        'Душ',
        'Душова голова'
    ],
    '🛁': [
        'Ванна',
        'Бульбашка'
    ],
    '🧴': ['Лободна пляшка'],
    '🧷': ['Безпечна зв\'язка'],
    '🧺': ['Кошик'],
    '🧻': [
        'Нахил паперу',
        'Туалетний папір'
    ],
    '🧼': ['Бар мила'],
    '🧽': ['Губка'],
    '🧯': ['Вогнегасник'],
    '🚬': [
        'Сигарета',
        'Димовий символ'
    ],
    '⚰️': [
        'Труна',
        'Casket',
        'Похорон'
    ],
    '⚱️': [
        'Похоронна урна',
        'Ваза'
    ],
    '🛡️': ['Щит'],
    '⚙️': [
        'Шестерня',
        'Налаштунки',
        'Опції'
    ],
    '⚖️': [
        'Масштаб балансу',
        'Луска справедливості'
    ],
    '🔗': [
        'Лінк',
        'Ланцюг',
        'Гіперпосилання',
        'Зв\'язаний ланцюг'
    ],
    '💀': [
        'Череп',
        'Смерть',
        'Сірий череп',
        'Скелет'
    ],
    '☠️': ['Череп і кросбонес'],
    '🦻': ['Рух з шаленою допомогою'],
    '🎡': [
        'Чортове колесо',
        'Велике колесо',
        'Fairgroundl',
        'Точне кермо'
    ],
    '⛽': [
        'Паливний насос',
        'Нафта',
        'Бензин',
        'Газ'
    ],
    '🚨': [
        'Поліцейський автомобіль револьверний',
        'Екстрений світло',
        'Прошивка світла',
        'Siren'
    ],
    '🚥': ['Горизонтальний світлофора'],
    '🚦': ['Вертикальний світлофори'],
    '⚓': [
        'Адміралтейський візерунок',
        'Рибалка'
    ],
    '🚧': [
        'Реєстрація будівництва',
        'Чорний та Жовтий знак'
    ],
    '🪂': ['Parachute'],
    '💺': [
        'Місце',
        'Автобусний поїзд Літака в Аероплан'
    ],
    '🪐': ['Сатурн'],
    '🎆': [
        'Феєрверк',
        'Вибух'
    ],
    '🎇': [
        'Senko Hanabi',
        'Феєрверк Спарклер'
    ],
    '💷': [
        'Банкнота',
        'Примітка в £20',
        'Примітка Двадцять запитів',
        'Банкнот з фунтовим знаком'
    ],
    '💶': [
        'Euro Banknote',
        'Примітка до €100',
        'Банкнот з табличкою євро'
    ],
    '💵': [
        'Долар Банкнот',
        '$1 нотатка',
        'Банкнот з Знаком долара',
        'Долар Білл',
        'Американський долар'
    ],
    '💴': [
        'Банкнот Єн',
        '¥ 1000 Нотатка',
        'Примітка Єна',
        'Банкнот з підписом Єни'
    ],
    '⛺': ['Таборський намет'],
    '⛲': [
        'Фонтан',
        'Водоподібність',
        'Водофонтан',
        'Парк'
    ],
    '💰': [
        'Кошик грошей',
        'Грошові пакети',
        'Багатий',
        '$'
    ],
    '💸': [
        'Money with Wings',
        'Flying Money',
        ' Losing Money'
    ],
    '🏷️': ['Мітка'],
    '🔖': [
        'Закладка',
        'Тег ціни',
        'Тег'
    ],
    '📑': ['Вкладки в закладки'],
    '📯': [
        'Поштовий ріг',
        'Bugle',
        'Французький Ріг'
    ],
    '🪁': ['Кайт'],
    '🪀': ['Йо-Йо'],
    '🎊': [
        'Confetti Ball',
        'Confetti'
    ],
    '🎉': [
        'Партійний поппер',
        'Святкування',
        'Святковий капелюх'
    ],
    '🎈': [
        'Повітряна куля',
        'Вечірка',
        'Червона куля'
    ],
    '🌡️': [
        'Термометр',
        'Гаряча Погода',
        'Температура'
    ],
    '🛢️': ['Бочка з нафтою'],
    '💣': ['Бомба'],
    '🔪': [
        'Кухонний ніж',
        'Ніж',
        'Ніж м\'ясників',
        'Hocho'
    ],
    '🏺': [
        'Amphora',
        'Банка',
        'Ваза'
    ],
    '🗺️': ['Карта світу'],
    '🎼': [
        'Музичний результат',
        'Ноти',
        'Treble Clef'
    ],
    '🎬': [
        'Кластерна дошка',
        'Вирізати',
        'Дія',
        'Директор',
        'Кінопрокат'
    ],
    '🎻': [
        'Віолін',
        'Струнний квартет',
        'Найменша скрипка у світі'
    ],
    '🎺': [
        'Труба',
        'Ріг',
        'Джаз'
    ],
    '🎸': [
        'Гітара',
        'Акустична гітара',
        'Бас-гітара',
        'Електрична гітара'
    ],
    '🎷': [
        'Саксофон',
        'Джаз',
        'Сакс'
    ],
    '🥁': [
        'Барабан',
        'Барабан з драмсточками'
    ],
    '🎹': [
        'Піаніно',
        'Музична клавіатура'
    ],
    '🪕': ['Банджо'],
    '🪗': ['Акордеон'],
    '🪘': ['Довгий барабан'],
    '🎨': [
        'Художник Палета',
        'Мистецтво',
        'Живопис'
    ],
    '🧩': [
        'Петля головоломок',
        'Думки у головоломках'
    ],
    '🎲': [
        'Грати',
        'Дайс'
    ],
    '🎭': [
        'Театральне мистецтво',
        'Театр',
        'Театр',
        'Драма-маски',
        'Грецький театр',
        'Трагедія та комедія маски',
        'Венеція'
    ],
    '🔍': [
        'Збільшувальне скло зліва',
        'Magnifier',
        'Пошук значків',
        'Збільшення скла лівки',
        'Знайти'
    ],
    '🔎': [
        'Збільшувальне скло вправо',
        'Magnifier',
        'Пошук значків',
        'Збільшувальне скло правого штриха',
        'Знайти'
    ],
    '⌛': [
        'Годинник завершено',
        'Пісковий годинник'
    ],
    '⏳': [
        'Годинник не завершено',
        'Годинник із потоком піску'
    ],
    '🕐': [
        'Один О\'Годин',
        'Годинник обличчя один О\'Годинник'
    ],
    '🕜': ['Годинник - одна тридцята'],
    '🕑': [
        'Два О\'Годинники',
        'Годинник обличчя двох О\'Годинників'
    ],
    '🕝': ['Годинник обличчя два тридцять'],
    '🕒': [
        'Троє О\'Година',
        'Годинник лице три О\'Годинники'
    ],
    '🕞': ['Годинник три роки'],
    '🕓': [
        'Чотири О\'Годин',
        'Годинник складається з чотирьох О\'Годинників'
    ],
    '🕟': ['Годинник чотири-тридцять'],
    '🕔': [
        'П\'ять О\'Годинник',
        'Годинник виблискує п\'ять О\'годинник'
    ],
    '🕠': ['Годинник - п\'ять тридцять років'],
    '🕕': [
        'Шість О\'Годин',
        'Годинник-шість О\'Годинник'
    ],
    '🕡': ['Годинник - шість - тридцять'],
    '🕖': [
        'Сім О\'Годинник',
        'Годинник обличчя сім О\'Годинників'
    ],
    '🕢': ['Годинник - Севен-Тридцять'],
    '🕗': [
        'Вісім О\'Годин',
        'Годинник - Вісім О\'Годинників'
    ],
    '🕣': ['Годинник - вісімдесят три роки'],
    '🕘': [
        'Дев’ять О\'Годинник',
        'Годинник дев\'ять О\'Годинників'
    ],
    '🕤': ['Годинник дев\'ятидесяти років'],
    '🕙': [
        'Тен О\'Годин',
        'Годинник обличчя О\'годинник'
    ],
    '🕥': ['Годинник Тен-Тридті'],
    '🕚': [
        'одинадцять О\'Годин',
        'Годинник — одинадцять О\'годинник'
    ],
    '🕦': ['Годинник - одинадцята тридцять'],
    '🕛': [
        'Дванадцять О\'Годин',
        'Годинник дванадцяти О\'Годинник'
    ],
    '🕧': ['Годинник - дванадцять тридцять'],
    '♨️': [
        'Гот-Спрінгс',
        'Onsen',
        'Пар'
    ],
    '💈': [
        'Барбер-Поле',
        'Магазин перукарні',
        'Смуги Барбера',
        'Перукар'
    ],
    '🎪': [
        'Цирк',
        'Велика вершина',
        'Цирк'
    ],
    '💢': [
        'Символ Анджера',
        'Знак гнізда',
        'Вейн Поп'
    ],
    '🗯️': [
        'Правий люк гнізда',
        'Zig Zag Bubble',
        'Злий Лист Булька'
    ],
    '💊': [
        'Pill',
        'Капсула',
        'Планшет',
        'Ліки'
    ],
    '🎎': [
        'Ляльки',
        'Hinamatsuri',
        'Імперські ляльки',
        'Японські ляльки'
    ],
    '🎏': [
        'Карп Стрімер',
        'Стяг риби',
        'Koinobori',
        'Вітряні шкарпетки'
    ],
    '🎐': [
        'Шелест вітру',
        'Furin',
        'Медузи',
        'Вітряний дзвін'
    ],
    '🎀': [
        'Стрічковий Лук',
        'Рожевий лук',
        'Лук'
    ],
    '🎁': [
        'Втрачений подарунок',
        'День народження',
        'Різдво Подарунок',
        'Подарунок',
        'Подарункова Коробка',
        'Подарунок',
        'Загорнуті дані'
    ],
    '🎫': [
        'Квиток',
        'В центрі заявки',
        'Світовий тур'
    ],
    '🃏': [
        'Джокер',
        'Джокер Кард',
        'Грає в карту Black Joker'
    ],
    '💡': [
        'Лампочка',
        'Ідея',
        'Електричний ліхтар'
    ],
    '🔦': [
        'Ліхтарик',
        'Смолоскип',
        'Електричний смолоскип'
    ],
    '🏮': [
        'Червоний ліхтар',
        'Азійський ліхтар',
        'Японський ліхтар',
        'Червоний ліхтар',
        'Ізакая Ліхтар'
    ],
    '📦': [
        'Пакет',
        'Ящик',
        'Посилка'
    ],
    '📇': [
        'Індексувати картку',
        'Родекс',
        'Системна картка',
        'Індекс картки'
    ],
    '🕳️': ['Отвір'],
    '👁️‍🗨️': [
        'Я — свідок',
        'Чат ока'
    ],
    '⚜️': [
        'Fleur-de-lis',
        'Розвідники',
        'Нью-Орлінс Сейнтс'
    ],
    '⚗️': ['Alembic'],
    '🕯️': ['Свічка'],
    '🖼️': [
        'Зазначене зображення',
        'Живопис',
        'Каркас',
        'Кадр з картинкою'
    ],
    '🛍️': ['Товари для покупок'],
    '🎟️': ['Заявки для входу'],
    '🛎️': ['Bellhop Bell'],
    '🧾': ['Чек'],
    '🧮': ['Abacus'],
    '🧫': ['Петрі Діш'],
    '🧹': [
        'Мітла',
        'Щітка',
        'Змести'
    ],
    '🎰': [
        'Слот-машина',
        'Казино',
        'Фруктовий автомат',
        'Азартні ігри',
        'Комп\'ютер покеру'
    ],
    '🦽': ['Ручний інвалідний візок'],
    '🦼': ['Моторизований інвалідний візок'],
    '🪔': ['Лампа Дія'],
    '🦯': ['White Cane'],
    '🩸': ['Кров'],
    '🩹': ['Зручний бинт'],
    '🩺': ['Стетоскоп'],
    '🪶': ['Перо'],
    '🪤': ['Пастка миші'],
    '🫖': ['Teapot'],
    '🪨': ['Скеля'],
    '🪵': ['Деревина'],
    '🪄': ['Чарівна паличка'],
    '🔮': [
        'Crystal Ball',
        'Clairvoyant',
        'Fortune Teller',
        'Psychic',
        'Purple Crystal'
    ],
    '🪅': ['Піненіата'],
    '🪆': [
        'Наслідливі ляльки',
        'Матрьошка'
    ],
    '🪡': ['Голка'],
    '🪢': ['Вузол'],
    '🪙': ['Монета'],
    '🪃': ['Boomerang'],
    '🪥': ['Зубна щітка'],
    '🪦': ['Надгробок'],
    '🪧': ['Placard'],
    '🪒': ['Разор']
};