// descriptions took from Emojipedia.org
lang = 'uk';
//use i18n language code of the browser, more details: https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/API/i18n/LanguageCode
titles_language[lang] = {
    '🔍': 'Результати',
    '🕒': 'Найбільш використовувані емодзі',
    '😀': 'Усміхайлики',
    '🙋': 'Люди',
    '🦊': 'Тварини',
    '🅰️': 'Символи',
    '🍎': 'Їжа і напої',
    '🏳️‍🌈': 'Прапори',
    '🏊': 'Спортивні ігри',
    '✈️': 'Мандрівка та місця',
    '🖱️': 'Техніка і офіс',
    '👗': 'Одяг та аксесуари',
    '🖐️': 'Руки та частини тіла',
    '🛎️': 'Інше'
};
emojis_language[lang] = [];
/*search*/
emojis_language[lang][0] = {};
/*smileys*/
emojis_language[lang][2] = {
    '😀': [
        'Висіяти обличчя',
        ':grinning:',
        ':grinning_face:',
        '::):',
        'Щасливе обличчя',
        'Вираз усміхайлика'
    ],
    '😃': [
        'Висміювання обличчя з великими очима',
        ':smiley:',
        ':grinning_face_with_big_eyes:',
        '::D:',
        'Щасливе обличчя',
        'Вираз усміхайлика',
        'Посмішка з відкритим ротом'
    ],
    '😄': [
        'Висміювання обличчя з усміхаючими очима',
        ':smile:',
        ':grinning_face_with_smiling_eyes:',
        'Щасливе обличчя',
        'Вираз усміхайлика',
        'Висміювання обличчя з оченятами',
        'Похмурі обличчя з відкритим ротом та усміхненими очима'
    ],
    '😁': [
        'Очі сяють водоростям',
        ':grin:',
        ':beaming_face_with_smiling_eyes:',
        'Висміювання обличчя з усміхаючими очима'
    ],
    '😆': [
        'Висіти з шилінгу',
        ':grinning_squinting_face:',
        ':xD:',
        ':><:',
        'Біг-Грін',
        'Усмішка закритими очима',
        'Сміх',
        'Змішання обличчя з кричущими закритими очима',
        'Захоплення обличчя з відкритим ротом і тонко закритими очима'
    ],
    '😅': [
        'Усміхнений обличчя з піт',
        ':happy_sweat:',
        'Вправа',
        'Щасливий попіл',
        'Висміювання обличчя з очей і акуратним ударом',
        'Любов обличчя з відкритими ротом і холодним піт'
    ],
    '🤣': [
        'ROFL',
        ':rofl:',
        'Веселися на підлозі'
    ],
    '😂': [
        'Обличчя зі сльозами Джоя',
        ':lol:',
        'Сміх',
        'Смішний плач',
        'Смішні сльози',
        'Лол'
    ],
    '🙂': [
        'Трохи хрипіння',
        ':smile:',
        '::):',
        'Трохи щасливий',
        'Це добре'
    ],
    '🙃': [
        'Upside-Down Face',
        ':upside-down_face:',
        ':upside_down_face:',
        'Sarcasm',
        'Silly',
        'У напрямку до обличчя'
    ],
    '😉': [
        'Вигойдалка',
        ':winking:',
        ':;):',
        'Підморгнути',
        'Ефект підморгнути',
        'Лице Вінкі'
    ],
    '😊': [
        'Металеві обличчя з усміхаючими очима',
        ':smiling_face:',
        ':^^:',
        'Щасливе обличчя',
        'Посмішка',
        'Вираз усміхайлика'
    ],
    '😇': [
        'Обличчя з Halo',
        ':smiling_angel:',
        'Ангел',
        'Гало'
    ],
    '🥰': [
        'Хрипи з серцями',
        ':smiling_hearts:',
        'У очах кохання',
        'Посмішка обличчя з усміхненими очима та трьома серцями'
    ],
    '😍': [
        'Посмішка з очима серця',
        'любов',
        ':smiling_heart-eyes:',
        ':smiling_heart_eyes:',
        ':*.*:',
        'Очі серця',
        'Серце обличчя',
        'Посмішка з обличчя з гострим очима'
    ],
    '🤩': [
        'Стар-Струк',
        ':star_eyes:',
        'Схвильований',
        'Зоряні очі',
        'Старрі Еед',
        'Обличчя вау',
        'Обличчя зоряними очима',
        'Висміювання обличчя з зірками очима'
    ],
    '😘': [
        'Обличчя пронесіть поцілунок',
        'любов',
        ':kissing_face:',
        '::*:',
        '::-*:',
        'Поцілунок Клоу A',
        'Художній поцілунок',
        'Поцілунок',
        'Обличчя кидає поцілунок'
    ],
    '😗': [
        'Обличчя поцілунків',
        'поцілунок',
        ':kissing_face:',
        '::*:',
        '::-*:',
        'Обличчя качки',
        'Kissy Face',
        'Свист'
    ],
    '☺️': [
        'Обличчя посміхання',
        ':smiling_face:',
        'Щасливе обличчя',
        'Вираз усміхайлика',
        'Посмішка',
        'Обличчя біле усмішка'
    ],
    '😚': [
        'Поцілунок закритими очима',
        ':kissing_face:',
        'Поцілунок обличчя',
        'Kissy Face'
    ],
    '😙': [
        'Обличчя поцілунків з усміхаючими очима',
        ':kissing_face:',
        'Поцілунок обличчя',
        'Kissy',
        'Свисток',
        'Свист'
    ],
    '😋': [
        'Їжа для очистки',
        ':savoring_face:',
        'Гуфі',
        'Гунгрі',
        'Листі вказівки усміхнені',
        'Заворушення смаку їжі',
        'Юм Юм'
    ],
    '😛': [
        'Обличчя з язиком',
        ':tongue_face:',
        '::P:',
        'Брутальний',
        'Обличчя язика',
        'Тонге Аут',
        'Обличчя з яскравим голосом'
    ],
    '😜': [
        'Підморгнути обличчя з язиком',
        ':winking:',
        ':;P:',
        'Божевільний',
        'Божевільні обличчя',
        'Вигойдаючи, обличчя з голом духом',
        'Обличчя в голому язику і підморгування очей'
    ],
    '🤪': [
        'Zany Face',
        ':crazy_face:',
        'Божевільні очі',
        'Схвильований',
        'Дика партія',
        'Goofy Face',
        'Сісти в обличчя з одним великим і одним малим очима'
    ],
    '😝': [
        'Віч-на-всього — обличчя з язиком',
        ':tongue_face:',
        ':xP:',
        'Язик',
        'Обличчя та щойно закриті очі',
        'Обличчя автострадою та сильно закритими очима'
    ],
    '🤑': [
        'Лис для гроші-рота',
        ':money-mouth_face:',
        ':money_mouth_face:',
        '::$:',
        'Долар Очі жестів',
        'Грошовий вираз',
        'Багатий'
    ],
    '🤗': [
        'Затискаючи обличчя',
        ':hugging_face:',
        'Відтінок',
        'Горлінг',
        'Цигани',
        'Щасливого обличчя з обіймами'
    ],
    '🤭': [
        'Ой',
        ':oops:',
        'Обличчя об об рота',
        'Невдоволені обличчя з усміхненими очима та ручний рот'
    ],
    '🤫': [
        'Шх',
        ':shushing_face:',
        'Шуш',
        'Глибоке обличчя',
        'Спадщина',
        'Тихо',
        'Тиша',
        'Беззвучний',
        'Обличчя з закритими пальцями'
    ],
    '🤔': [
        'Що',
        ':thinking_face:',
        '?',
        'Гмм',
        'На обличчі',
        'Чин Томб',
        'Мислитель',
        'Метальна тінь'
    ],
    '🤐': [
        'Поштовий індекс',
        'тихий',
        'тиша',
        ':zip_face:',
        'Ефект зіппер-Мута',
        'На розверху',
        'Запечатані губи',
        'Поштовий індекс',
        'Обличчя з зіппер-ротом'
    ],
    '🤨': [
        'Обличчя з червоним списом',
        ':face_with_raised_eyebrow:',
        'Кольбер',
        'Скеля',
        'Обличчя з вихованим бровом',
        'Обличчя з одним бровою'
    ],
    '😐': [
        'Нейтральне обличчя',
        ':neutral_face:',
        ':|',
        'Обличчя з прямим ротом',
        'Прямо наштовхнуто'
    ],
    '😑': [
        'Без виразності',
        ':expressionless_face:',
        '-_-',
        'Обличчя з прямим ротом',
        'Пряме обличчя'
    ],
    '😶': [
        'Обличчя без рота',
        ':face_without_mouth:',
        'Обличчя порожнє',
        'Леза',
        'Тиша',
        'Беззвучний'
    ],
    '😏': [
        'Обличчя усміхнення',
        ':smirking_face:',
        'Флірт',
        'Сексуальна поверхня',
        'Обличчя Смуг',
        'Сугестивна посмішка'
    ],
    '😒': [
        'Обличчя за назвою',
        ':unamused_face:',
        'Незадоволені',
        'Погано',
        'Синус-Око',
        'Не визначено'
    ],
    '🙄': [
        'Обличчя з крутими очима',
        ':face_with_rolling_eye:',
        ':eye_roll:',
        'Вертіти Оком'
    ],
    '😬': [
        'Обличчя гриба',
        ':awkward:',
        'Незграбна',
        'Eek',
        'У горі',
        'Нервус',
        'Анонімна суміш для користувача #1'
    ],
    '🤥': [
        'Обличчя',
        ':lying_face:',
        'Брехун, мов',
        'Велика носа',
        'Pinocchio'
    ],
    '😌': [
        'Обличчя в очах',
        ':relieved_face:',
        'Зміст',
        'Задоволений'
    ],
    '😔': [
        'Вибачте',
        ':sad_face:',
        'Наступне обличчя',
        'Наступ',
        'Сум',
        'Садова особа',
        'Ссумний',
        'Сумне обличчя'
    ],
    '😪': [
        'Сліпі обличчя',
        ':sleepy_face:',
        'Біт-Сльоз',
        'Пузир'
    ],
    '🤤': [
        'Слина',
        ':saliva_face:',
        'Drooling Face',
        'Drool'
    ],
    '😴': [
        'Нічне обличчя',
        ':sleeping_face:',
        ':zzz:',
        'Зз',
        'Спляче обличчя',
        'Хропіння',
        'Обличчя Ззз'
    ],
    '🥱': [
        'Зява',
        'втомлений',
        ':yawning_face:'
    ],
    '😷': [
        'Обличчя з медичною маскою',
        'хворий',
        'документація',
        ':face_with_medical_mask:',
        'Коронавірус',
        'КОВІД-19',
        'Обличчя маски',
        'Маска хірургії',
        'ill'
    ],
    '🤒': [
        'Обличчя з Термометром',
        ':face_with_thermometer:',
        ':sick:',
        ':ill:',
        'Ill',
        'Хворий'
    ],
    '🤕': [
        'Обличчя з Head-Bandage',
        'шпиталь',
        'хворий',
        ':face_with_head-bandage:',
        ':face_with_head_bandage:',
        'Руйнівник',
        'Зневіра',
        'Травмовано',
        'ill'
    ],
    '🤢': [
        'Нісенітниця',
        'хворий',
        ':nauseated_face:',
        'Відраза',
        'Зелена обличчя',
        'Воміт',
        ':green:',
        'ill'
    ],
    '🤮': [
        'Фокус на лиці',
        'хворий',
        ':face_vomiting:',
        'Спів',
        'Bleah',
        'Bleurgh',
        'Юк',
        'Юки',
        'Ев',
        'Спів',
        'Покидання вгору',
        'Воміт',
        'Обличчя з відкритим ротом блювотами',
        'ill'
    ],
    '🤧': [
        'Чхання',
        'хворий',
        ':sneezing_face:',
        'Gesundheit',
        'ill'
    ],
    '🥵': [
        'Гаряча поверхня',
        ':hot_face:',
        'Огрівання',
        ':red:'
    ],
    '🥶': [
        'Обличчя холодного',
        ':cold_face:',
        'Холодний',
        'Холодний',
        'Крижане обличчя',
        ':blue:'
    ],
    '🥴': [
        'Дерев\'яне обличчя',
        ':woozy_face:',
        'Обличчя п\'яного',
        'Обличчя з нездоланними очима та Вейві рот'
    ],
    '😵': [
        'Dizzy Face',
        ':dizzy_face:',
        'Очі вибличчя',
        'Очі крутих очей'
    ],
    '🤯': [
        'Вибухова голова',
        'бум',
        ':exploding_head:',
        'Розумний Клоун',
        'Закріплена обличчя з вибухом голови'
    ],
    '🤠': [
        'Ковбойський капелюх',
        ':cowboy_hat_face:',
        'Ковбой',
        'Лице Ковбой',
        'Обличчя з капелюхом ковбоя'
    ],
    '🥳': [
        'Створення партнерства обличчя',
        ':partying_face:',
        'Обличчя партії',
        'Обличчя з рогом і капелюхом Партії'
    ],
    '😎': [
        'Посмішка на обличчя з сонцезахисні окуляри',
        ':smiling_face_with_sunglasses:',
        'Холодний',
        'Спільні найкращі друзі (Snapchat)',
        'Сонцезахисні окуляри'
    ],
    '🤓': [
        'Обличчя Нерда',
        ':nerd_face:',
        'Nerdy'
    ],
    '🧐': [
        'Обличчя з моноклом',
        ':face_with_monocle:'
    ],
    '😕': [
        'Обличчя затвердження',
        ':confused_face:',
        '::/:',
        '::S:',
        'Неплюсовані',
        'Запущено'
    ],
    '😟': [
        'Турбана лице',
        ':worried_face:',
        '::(:',
        'Сум',
        'Садова особа'
    ],
    '🙁': [
        'Блискавка до Ульоту',
        ':slightly_frowning_face:',
        '::(:',
        'Трохи сумний'
    ],
    '☹️': [
        'Метання обличчя',
        ':frowning_face:',
        '::(:',
        'Мегафрон',
        'Обличчя біле'
    ],
    '😮': [
        'Воу',
        ':wow:',
        '::O:',
        'Боже мій!',
        'Обличчя з відкритим ротом',
        'Відкритий рот',
        'Здивований обличчя з відкритим ротом'
    ],
    '😯': [
        'Затискається обличчя',
        ':husked_face:',
        '::O:',
        'Сюрприз',
        'Здивований обличчя'
    ],
    '😲': [
        'Стиснута обличчя',
        ':shocked_face:',
        '::O:',
        'Воу',
        'Приголомшлива Обличчя',
        'Обличчя п\'яного',
        'Обличчя Гаспінгу'
    ],
    '😳': [
        'Зрубане обличчя',
        ':flushed_face:',
        '::$:',
        'Обличчя розмивання',
        'Збентежений',
        'Сором',
        'Обличчя з широкими відкритими очима'
    ],
    '🥺': [
        'Обличчя в Пседі',
        ':pleading_face:',
        '::(:',
        'Початок',
        'Очі словникові',
        'Simp',
        'Обличчя з повіями'
    ],
    '😦': [
        'Метання обличчя з відкритим ротом',
        ':frowning_face_with_open_mouth:',
        ':D::',
        'Поява'
    ],
    '😧': [
        'Anguished Face',
        ':anguished_face:',
        ':anguished:',
        ':D::',
        'Pained Face'
    ],
    '😨': [
        'Катарта',
        ':scared:',
        ':D::',
        'Химерне обличчя',
        'Здивований'
    ],
    '😰': [
        'Тривожна лице з попілом',
        ':anxious_face_with_sweat:',
        'Синя поверхня',
        'Обличчя ж',
        'Нервус Обличчя',
        'Обличчя з відкритим ротом і холодним піт'
    ],
    '😥': [
        'Сумно, але обличчя у злодіїв',
        ':sad_but_relieved_face:',
        '::(:',
        'Бровий піт',
        'Обезцілена, але обличчя в залі'
    ],
    '😢': [
        'Обличчя',
        ':crying_face:',
        '::(:',
        'Плач',
        'Сльоза'
    ],
    '😭': [
        'Повільно плач',
        ':loudly_crying_face:',
        'Bawling',
        'Плач',
        'Сумно Сльози',
        'Sobbing'
    ],
    '😱': [
        'Крик обличчя в страху',
        ':face_screaming_in_fear:',
        'Сам удома',
        'Крик',
        'Обличчя крику'
    ],
    '😖': [
        'Обличчя схвалене',
        ':confounded_face:',
        'Квіверінг Рот',
        'Вищеплено обличчя'
    ],
    '😣': [
        'Обличчя особистості',
        ':persevering_face:',
        'Обличчя з безплідним',
        'Викрадані очі'
    ],
    '😞': [
        'Зруйнована лице',
        ':disappointed_face:',
        '::(:',
        'Сум',
        'Садова особа'
    ],
    '😓': [
        'Зливання з Попілом',
        ':downcast_face_with_sweat:',
        'Жорстка робота',
        'Обличчя сонця',
        'Обличчя з холодним пітом'
    ],
    '😩': [
        'Холодні обличчя',
        ':weary_face:',
        'Обличчя в космосі',
        'Вітрила'
    ],
    '😫': [
        'Виступова обличчя',
        ':tired_face:',
        'Виснаження',
        'Віддано',
        'Обличчя в космосі'
    ],
    '😤': [
        'Обличчя за допомогою Steam',
        ':face_with_steam_from_nose:',
        'Аеропорт Грівансів',
        'Руйнівні',
        'Божевільне обличчя',
        'Стежити',
        'Формування від гніву гнізда'
    ],
    '😡': [
        'Привид на лице',
        'fuck',
        ':pouting_face:',
        'Сердитий обличчя',
        'Обличчя Ґрумпі',
        'Божевільне обличчя',
        'Червона поверхня',
        ':red:'
    ],
    '😠': [
        'Сердитий обличчя',
        ':angry_face:',
        'Сердитий',
        'Обличчя Ґрумпі'
    ],
    '🤬': [
        'Ноутбук',
        'fuck',
        ':swearing:',
        '@#$%&!',
        'Обличчя з символами роту',
        'Лайка',
        'Кюзінг',
        'Grawlix',
        'Обличчя з символами над ротом',
        'Серйозні обличчя з символами роту',
        ':red:'
    ],
    '🥲': [
        'Обличчя з сльозами',
        ':smiling_face_with_tear:'
    ],
    '😮‍💨': [
        'Обличчя',
        ':face_exhaling:',
        'Сігль'
    ],
    '😵‍💫': [
        'Обличчя з спіральними очима',
        ':face_with_spiral_eyes:',
        'Dizzy Face'
    ],
    '😶‍🌫️': [
        'Обличчя в хмарах',
        'дим',
        ':face_in_clouds:',
        'Brain Fog',
        'Кувала',
        'Імла'
    ],
    '🥸': [
        'Обличчя замасковані',
        ':disguised_face:'
    ],
    '🫠': [
        'Обличчя, що плавиться',
        ':melting_face:'
    ],
    '🫢': [
        'Обличчя з відкритими очима і рукою біля рота',
        ':face_with_open_eyes_and_hand_over_mouth:'
    ],
    '🫣': [
        'Обличчя з оком, що підглядає',
        ':face_with_peeking_eye:'
    ],
    '🫡': [
        'Обличчя, що віддає честь',
        ':saluting_face:',
        'Військова справа',
        'Армія',
        'Повітряні сили Великої Британії',
        'Флот'
    ],
    '🫥': [
        'Обличчя з пунктирних ліній',
        ':dotted_line_face:',
        ':transparent:'
    ],
    '🫤': [
        'Обличчя з косим ротом',
        ':face_with_diagonal_mouth:'
    ],
    '🥹': [
        'Обличчя, що не стримує сльози',
        ':face_holding_back_tears:'
    ],
    '🫨': [
        'Shaking Face',
        ':shaking_face:'
    ],
    '🙂‍↔️': [
        'Head Shaking Horizontally',
        ':head_shaking_horizontally:'
    ],
    '🙂‍↕️': [
        'Head Shaking Vertically',
        ':head_shaking_vertically:'
    ],
    '😈': [
        'Любовна лице з рогами',
        ':smiling_face_with_horns:',
        'Диявол',
        'Ріг Диявола',
        'Щасливий Диявол',
        'Бузковий Диявол',
        'Червоний диявол',
        ':purple:'
    ],
    '👿': [
        'Злий лице з рогами',
        ':angry_face_with_horns:',
        'Диявол',
        'Ріг Диявола',
        'Бузковий Диявол',
        'Бузковий Гоблін',
        'Сумний диявол',
        'Imp',
        ':purple:'
    ],
    '🤡': [
        'Обличчя Клоуна',
        ':clown_face:',
        'Жахлива клоун',
        'Злий Клоун',
        'Страшний клоун'
    ],
    '👽': [
        'Чужий',
        ':alien:',
        'ET'
    ],
    '👾': [
        'Чужий монстр',
        ':alien_monster:',
        'Космічний інвуадер',
        'Відеогральний монстр'
    ],
    '🤖': [
        'Robot',
        ':robot:',
        'Обличчя робота'
    ],
    '👹': [
        'Ogre',
        ':ogre:',
        'Обличчя маски',
        'Oni',
        'Червоний монстр',
        'Огр японський',
        ':red:'
    ],
    '👻': [
        'Привид',
        ':ghost:',
        'Halloween'
    ],
    '🗣️': [
        'Голова',
        ':speaking_head:',
        'Менсплейнінг',
        'Крик',
        'Крик',
        'Говорити голові в Силуеті',
        ':blue:'
    ],
    '👤': [
        'Погруддя в Силуеті',
        ':bust_in_silhouette:',
        'Тінь',
        'Silhouette',
        'Користувач',
        'Силует Перський',
        ':blue:'
    ],
    '🫂': [
        'Люди Хуггінг',
        ':people_hugging:',
        ':blue:'
    ],
    '👥': [
        'Пориви силуету',
        ':busts_in_silhouette:',
        'Тіні',
        'Silhouettes',
        'Спільноти',
        'Силует двох людей',
        ':blue:'
    ]
};
/*people*/
emojis_language[lang][3] = {
    '👶{{skin_tone}}': [
        'Дитина',
        ':baby:',
        'Дитина',
        'Малюк'
    ],
    '🧒{{skin_tone}}': [
        'Дитина',
        ':child:',
        'Гендерне нейтральне дитя'
    ],
    '👧{{skin_tone}}': [
        'Дівчина',
        ':girl:',
        ':woman:'
    ],
    '🧑{{skin_tone}}': [
        'Особа',
        ':person:',
        'Гендерний нейтралітет',
        'Дорослий',
        ':person:'
    ],
    '🧔{{skin_tone}}': [
        'Person: Beard',
        ':person_beard:',
        'Beard',
        'Bearded Person',
        'Bearded Person',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦰': [
        'Особисті зачіски',
        ':person_red_hair:',
        'Джингер Персон',
        'Персон Редгед',
        'Людина з червоним волоссям',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦱': [
        'Особистий: Кучерява',
        ':person_curly_hair:',
        'Персон з Керлі волосся',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦳': [
        'Особисто : Біле волосся',
        ':person_white_hair:',
        'Людина з сірим волоссям',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦲': [
        'Персона: Лиса',
        ':person_bald:',
        'Персона без волосся',
        ':person:'
    ],
    '👱{{skin_tone}}': [
        'Особисті зачіпки: Волосся',
        ':person_blond_hair:',
        'Людина зі світлим волоссям',
        ':person:'
    ],
    '👨{{skin_tone}}': [
        'Чоловік',
        ':man:',
        'Чоловік',
        'Вуса',
        ':man:'
    ],
    '🧔{{skin_tone}}‍♂️': [
        'Чоловік: Борода',
        ':man_beard:',
        'Борода',
        'Бородата людина',
        'Бородата людина',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦰': [
        'Червоні волосся',
        ':man_red_hair:',
        'Джинґер',
        'Man Redhead',
        'Людина з червоним волоссям',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦱': [
        'Кучеряве волосся',
        ':man_curly_hair:',
        'Людина з кучерявим волоссям',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦳': [
        'Біле волосся',
        ':man_white_hair:',
        'Людина з сірим волоссям',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦲': [
        'Чоловік: Балд',
        ':man_bald:',
        'Людина без волосся',
        ':man:'
    ],
    '👱{{skin_tone}}‍♂️': [
        'Чоловік: Волосся',
        ':man_blond_hair:',
        'Чоловік з блондом Хайром',
        ':man:'
    ],
    '👩{{skin_tone}}': [
        'Жінка',
        ':woman:',
        'Жінка',
        'Леді',
        'Жовта жінка',
        ':woman:'
    ],
    '🧔{{skin_tone}}‍♀️': [
        'Борода',
        ':woman_beard:',
        'Борода',
        'Жінка з бородою',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦰': [
        'Червоне волосся',
        ':woman_red_hair:',
        'Жінка з імбиря',
        'Woman Redhead',
        'Жінка з червоною зачіска',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦱': [
        'Кучеряве волосся',
        ':woman_curly_hair:',
        'Жінка з кучерявим волосся',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦳': [
        'Біле волосся',
        ':woman_white_hair:',
        'Жінка з сірим волосся',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦲': [
        'Жінка: бард',
        ':woman_bald:',
        'Жінка без волосся',
        ':woman:'
    ],
    '👱{{skin_tone}}‍♀️': [
        'Волосся',
        ':woman_blond_hair:',
        'Жінка з блондом Хайром',
        ':woman:'
    ],
    '👴{{skin_tone}}': [
        'Старша людина',
        ':older_man:',
        ':older:',
        'Людина похилого віку',
        'Дідусь',
        'Старий чоловік',
        ':man:'
    ],
    '👵{{skin_tone}}': [
        'Старша жінка',
        ':older_woman:',
        ':older:',
        'Жінка похилого віку',
        'Бабуся',
        'Нанна',
        'Бабця',
        'Стара жінка',
        ':woman:'
    ],
    '🧓{{skin_tone}}': [
        'Старша людина',
        ':older_person:',
        ':older:',
        'Гендерно нейтральна літня людина',
        ':person:'
    ],
    '👼{{skin_tone}}': [
        'Дитячий янгол',
        ':baby_angel:',
        'Ангел',
        'Cherub',
        'Амур',
        'Путто'
    ],
    '🎅{{skin_tone}}': [
        'Santa Claus',
        ':santa_claus:',
        'Saint Nicholas',
        'Sinterklaas',
        'Father Christmas',
        ':man:'
    ],
    '🤶{{skin_tone}}': [
        'Mrs Claus',
        ':mrs_claus:',
        'Mother Christmas',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎄': [
        'Мкс Клаус',
        ':mx_clause:',
        'Різдво',
        ':person:'
    ],
    '🤴{{skin_tone}}': [
        'Принц',
        ':price:',
        ':man:'
    ],
    '👸{{skin_tone}}': [
        'Принцеса',
        ':pricess:',
        'Жірка блонде',
        'Дівчина з короною',
        'Дівчина з Тіарою',
        ':woman:'
    ],
    '🫅{{skin_tone}}': [
        'Особа з короною',
        ':person_with_crown:',
        ':person:'
    ],
    '👳{{skin_tone}}‍♂️': [
        'Чоловіча бродяга',
        ':man_wearing_turban:',
        ':wearing_turban:',
        'Арабська',
        'Мусульманство',
        'Сікх',
        'Чалма',
        ':man:'
    ],
    '👳{{skin_tone}}‍♀️': [
        'Жінка-пилосося',
        ':woman_wearing_turban:',
        ':wearing_turban:',
        'Арабська',
        'Мусульманство',
        'Сікх',
        'Чалма',
        ':woman:'
    ],
    '👳{{skin_tone}}': [
        'Турбан Персика',
        ':person_wearing_turban:',
        ':wearing_turban:',
        'Арабська',
        'Мусульманство',
        'Сікх',
        'Чалма',
        ':person:'
    ],
    '👲{{skin_tone}}': [
        'Персон з Skullcap',
        ':person_with_skullcap:',
        'Азійська людина',
        'Людина з китайською шапочкою',
        'Людина з Га Пі Мао',
        ':person:'
    ],
    '🧕{{skin_tone}}': [
        'Жінка з хусткою',
        ':woman_with_headscarf:',
        'Hijab',
        'Персон з Headscarf',
        ':woman:'
    ],
    '🤵{{skin_tone}}‍♀️': [
        'Чоловік у TTuxedo',
        ':man_in_tuxedo:',
        ':tuxedo:',
        'Groom',
        'Людина в костюмі',
        'Весілля',
        ':man:'
    ],
    '🤵{{skin_tone}}‍♂️': [
        'Жінка в тюкседо',
        ':woman_in_tuxedo:',
        ':tuxedo:',
        'Groom',
        'У костюмі жінки',
        'Весілля',
        ':woman:'
    ],
    '🤵{{skin_tone}}': [
        'Персон-ін-Тушедо',
        ':person_in_tuxedo:',
        ':tuxedo:',
        'Groom',
        'Особа в костюмі',
        'Весілля',
        ':person:'
    ],
    '👰{{skin_tone}}‍♂️': [
        'Чоловік з вуаль',
        ':man_with_veil:',
        ':veil:',
        'Весілля',
        'Наречений',
        'Шлюб',
        ':man:'
    ],
    '👰{{skin_tone}}‍♀️': [
        'Жінка з Вейлом',
        ':woman_with_veil:',
        ':veil:',
        'Весілля',
        'Наречена',
        'Наречена з вуаль',
        'Шлюб',
        ':woman:'
    ],
    '👰{{skin_tone}}': [
        'Персон з Вейлом',
        ':person_with_veil:',
        ':veil:',
        'Весілля',
        'Шлюб',
        ':person:'
    ],
    '👨{{skin_tone}}‍🍼': [
        'Чоловік годує немовля',
        ':man_feeding_baby:',
        ':feeding_baby:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🍼': [
        'Малюк, що боїться в жінці',
        ':woman_feeding_baby:',
        ':feeding_baby:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🍼': [
        'Дитина голоду',
        ':person_feeding_baby:',
        ':feeding_baby:',
        ':person:'
    ],
    '🥷': [
        'Ніндзя',
        ':ninja:'
    ],
    '🫃{{skin_tone}}': [
        'Вагітний чоловік',
        ':pregnant_man:',
        ':pregnant:',
        'Вагітність',
        ':man:'
    ],
    '🤰{{skin_tone}}': [
        'Жінка-вагітна',
        ':pregnant_woman:',
        ':pregnant:',
        'Вагітність',
        'Прегнантна леді',
        ':woman:'
    ],
    '🫄{{skin_tone}}': [
        'Вагітна особа',
        ':pregnant_person:',
        ':pregnant:',
        'Вагітність',
        ':person:'
    ],
    '🤱{{skin_tone}}': [
        'Breast-Feeding',
        ':breast-feeding:',
        ':breast_feeding:',
        'Breastfeeding'
    ],
    '🦸{{skin_tone}}‍♂️': [
        'Чоловік Супергерой',
        ':man_superhero:',
        ':superhero:',
        ':man:'
    ],
    '🦸{{skin_tone}}‍♀️': [
        'Жінка-супергерой',
        ':woman_superhero:',
        ':superhero:',
        ':woman:'
    ],
    '🦸{{skin_tone}}': [
        'Супергерой',
        ':person_superhero:',
        ':superhero:',
        ':person:'
    ],
    '🦹{{skin_tone}}‍♂️': [
        'Чоловік із супервіллен',
        ':man_supervillain:',
        ':supervillain:',
        ':man:'
    ],
    '🦹{{skin_tone}}‍♀️': [
        'Жінка-лиходій',
        ':woman_supervillain:',
        ':supervillain:',
        ':woman:'
    ],
    '🦹{{skin_tone}}': [
        'Персон Супервіллен',
        ':person_supervillain:',
        ':supervillain:',
        ':person:'
    ],
    '🧙{{skin_tone}}‍♂️': [
        'Ман Медж',
        ':man_mage:',
        ':mage:',
        'Чародій',
        'Чарівник',
        ':man:'
    ],
    '🧙{{skin_tone}}‍♀️': [
        'Жінка-маг',
        ':woman_mage:',
        ':mage:',
        'Відьма',
        'Суворство',
        'Чарівник',
        ':woman:'
    ],
    '🧙{{skin_tone}}': [
        'Медж Персона',
        ':person_mage:',
        ':mage:',
        'Чарівник',
        ':mage:',
        ':person:'
    ],
    '🧚{{skin_tone}}‍♂️': [
        'Чоловік з феї',
        ':man_fairy:',
        ':fairy:',
        ':man:'
    ],
    '🧚{{skin_tone}}‍♀️': [
        'Жінка з феї',
        ':woman_fairy:',
        ':fairy:',
        ':woman:'
    ],
    '🧚{{skin_tone}}': [
        'Персон Фейрі',
        ':person_fairy:',
        ':fairy:',
        ':person:'
    ],
    '🧛{{skin_tone}}‍♂️': [
        'Ман Вампір',
        ':man_vampire:',
        ':vampire:',
        'Дракула',
        ':man:'
    ],
    '🧛{{skin_tone}}‍♀️': [
        'Жінка вампір',
        ':woman_vampire:',
        ':vampire:',
        ':woman:'
    ],
    '🧛{{skin_tone}}': [
        'Особа вампір',
        ':person_vampire:',
        ':vampire:',
        ':person:'
    ],
    '🧜{{skin_tone}}‍♂️': [
        'Мерман',
        ':merman:',
        'Merboy',
        ':man:'
    ],
    '🧜{{skin_tone}}‍♀️': [
        'Русалка',
        ':mermaid:',
        'Мерґірл',
        ':woman:'
    ],
    '🧜{{skin_tone}}': [
        'Merperson',
        ':merperson:',
        ':person:'
    ],
    '🧝{{skin_tone}}‍♂️': [
        'Ман Ельф',
        ':man_elf:',
        ':elf:',
        ':man:'
    ],
    '🧝{{skin_tone}}‍♀️': [
        'Жінка-ельф',
        ':woman_elf:',
        ':elf:',
        ':woman:'
    ],
    '🧝{{skin_tone}}': [
        'Персон Ельф',
        ':person_elf:',
        ':elf:',
        ':person:'
    ],
    '🧞‍♂️': [
        'Man Genie',
        ':man_genie:',
        ':genie:',
        ':man:'
    ],
    '🧞‍♀️': [
        'Woman Genie',
        ':woman_genie:',
        ':genie:',
        ':woman:'
    ],
    '🧞': [
        'Персон Джин',
        ':person_genie:',
        ':genie:',
        ':person:'
    ],
    '🕵️{{skin_tone}}‍♂️': [
        'Людина детектив',
        ':man_detective:',
        ':detective:',
        'Приватне око',
        'Sleuth',
        'Шпигун',
        'Man Sleuth',
        'Сонце або шпигун',
        '007',
        'Інспектор',
        ':man:'
    ],
    '🕵️{{skin_tone}}‍♀️': [
        'Жінка-детектив',
        ':woman_detective:',
        ':detective:',
        'Приватне око',
        'Sleuth',
        'Шпигун',
        'Жінка спить',
        'Сонце або шпигун',
        '007',
        'Інспектор',
        ':woman:'
    ],
    '🕵{{skin_tone}}': [
        'Особа детектив',
        ':person_detective:',
        ':detective:',
        'Приватне око',
        'Sleuth',
        'Шпигун',
        'Персон Соль',
        'Сонце або шпигун',
        '007',
        'Інспектор',
        ':person:'
    ],
    '💂{{skin_tone}}‍♂️': [
        'Чоловік: Вартовий',
        ':man_guard:',
        ':guard:',
        'Британський гвардсмен',
        'Фут-Вартовий',
        ':man:'
    ],
    '💂{{skin_tone}}‍♀️': [
        'Жінка: охоронець',
        ':woman_guard:',
        ':guard:',
        'Британський гвардсмен',
        'Фут-Вартовий',
        ':woman:'
    ],
    '💂{{skin_tone}}': [
        'Персонал: варта',
        ':person_guard:',
        ':guard:',
        'Британський гвардсмен',
        'Фут-Вартовий',
        ':person:'
    ],
    '👮{{skin_tone}}‍♂️': [
        'Офіцер поліції',
        ':man_police_officer:',
        ':police_officer:',
        'Коп',
        'Поліція',
        'Поліцейський',
        ':man:'
    ],
    '👮{{skin_tone}}‍♀️': [
        'Жінка офіцер поліції',
        ':woman_police_officer:',
        ':police_officer:',
        'Коп',
        'Поліція',
        'Поліцейська',
        ':woman:'
    ],
    '👮{{skin_tone}}': [
        'Офіцер поліції',
        ':person_police_officer:',
        ':police_officer:',
        'Коп',
        'Поліція',
        ':person:'
    ],
    '👨{{skin_tone}}‍🚒': [
        'Людина пожежника',
        ':man_firefighter:',
        ':firefighter:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🚒': [
        'Жінка-пожежник',
        ':woman_firefighter:',
        ':firefighter:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🚒': [
        'Пожежник для людини',
        ':person_firefighter:',
        ':firefighter:',
        ':person:'
    ],
    '👨{{skin_tone}}‍✈️': [
        'Чоловік-пілот',
        ':man_pilot:',
        ':pilot:',
        ':man:'
    ],
    '👩{{skin_tone}}‍✈️': [
        'Жінка-пілот',
        ':woman_pilot:',
        ':pilot:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍✈️': [
        'Персон-Пілот',
        ':person_pilot:',
        ':pilot:',
        ':person:'
    ],
    '👨{{skin_tone}}‍💻': [
        'Людина технологічний',
        ':man_technologist:',
        ':technologist:',
        'Людина технологічний',
        ':man:'
    ],
    '👩{{skin_tone}}‍💻': [
        'Жінка-технології',
        ':woman_technologist:',
        ':technologist:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍💻': [
        'Персон Технологілог',
        ':person_technologist:',
        ':technologist:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🎤': [
        'Чоловік із співака',
        ':man_singer:',
        ':singer:',
        'Bowie',
        'Aladdin Sane',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎤': [
        'Зінгер',
        ':woman_singer:',
        ':singer:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎤': [
        'Персон Сінгер',
        ':person_singer:',
        ':singer:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🎨': [
        'Чоловік-художник',
        ':man_artist:',
        ':artist:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎨': [
        'Жінка-художник',
        ':woman_artist:',
        ':artist:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎨': [
        'Особовий художник',
        ':person_artist:',
        ':artist:',
        ':person:'
    ],
    '👷{{skin_tone}}‍♂️': [
        'Конструкціонер',
        ':man_contruction_worker:',
        ':contruction_worker:',
        ':man:'
    ],
    '👷{{skin_tone}}‍♀️': [
        'Конструкціонер жінки',
        ':woman_contruction_worker:',
        ':contruction_worker:',
        ':woman:'
    ],
    '👷{{skin_tone}}': [
        'Персона будівельного робітника',
        ':person_contruction_worker:',
        ':contruction_worker:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🚀': [
        'Ман Астронавт',
        ':man_astronaut:',
        ':astronaut:',
        'Чоловік Космонавт',
        ':man:'
    ],
    '👩{{skin_tone}}‍🚀': [
        'Жіночий астронавт',
        ':woman_astronaut:',
        ':astronaut:',
        'Жінка-космонавт',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🚀': [
        'Персон Астронавт',
        ':person_astronaut:',
        ':astronaut:',
        'Персон Космонавт',
        ':person:'
    ],
    '👨{{skin_tone}}‍🔬': [
        'Чоловік учений',
        ':man_scientist:',
        ':scientist:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🔬': [
        'Жінка-вчений',
        ':woman_scientist:',
        ':scientist:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🔬': [
        'Персон Науковець',
        ':person_scientist:',
        ':scientist:',
        ':person:'
    ],
    '👨{{skin_tone}}‍💼': [
        'Службовець',
        ':man_office_worker:',
        ':office_worker:',
        'Генеральний директор',
        'Бізінесман',
        ':man:'
    ],
    '👩{{skin_tone}}‍💼': [
        'Жіночий офіс',
        ':woman_office_worker:',
        ':office_worker:',
        'Бізінесжінка',
        'Генеральний директор',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍💼': [
        'Людина з Офісу',
        ':person_office_worker:',
        ':office_worker:',
        'Бізнес',
        'Генеральний директор',
        ':person:'
    ],
    '👨{{skin_tone}}‍🏭': [
        'Чоловічий завод',
        ':man_factory_worker:',
        ':factory_worker:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🏭': [
        'Жіночий завод',
        ':woman_factory_worker:',
        ':factory_worker:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🏭': [
        'Персональний проробник',
        ':person_factory_worker:',
        ':factory_worker:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🔧': [
        'Мен-Механік',
        ':man_mechanic:',
        ':mechanic:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🔧': [
        'Жіночий механік',
        ':woman_mechanic:',
        ':mechanic:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🔧': [
        'Персон Механік',
        ':person_mechanic:',
        ':mechanic:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🍳': [
        'Ман Кук',
        ':man_cook:',
        ':cook:',
        'Ман Шеф',
        'Чол. шеф',
        ':man:'
    ],
    '👩{{skin_tone}}‍🍳': [
        'Жінка кухарка',
        ':woman_cook:',
        ':cook:',
        'Жіночий шеф',
        'Жіноча шеф-кухня',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🍳': [
        'Персон Кук',
        ':person_cook:',
        ':cook:',
        'Персон Шеф',
        ':person:'
    ],
    '👨{{skin_tone}}‍🌾': [
        'Чоловічий фермер',
        ':man_farmer:',
        ':farmer:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🌾': [
        'Жіночий фермер',
        ':woman_farmer:',
        ':farmer:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🌾': [
        'Персон Фармер',
        ':person_farmer:',
        ':farmer:',
        ':person:'
    ],
    '👨{{skin_tone}}‍⚖️': [
        'Man Judge',
        ':man_judge:',
        ':judge:',
        ':man:'
    ],
    '👩‍{{skin_tone}}⚖️': [
        'Woman Judge',
        ':woman_judge:',
        ':judge:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍⚖️': [
        'Person Judge',
        ':person_judge:',
        ':judge:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🏫': [
        'Man Teacher',
        ':man_teacher:',
        ':teacher:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🏫': [
        'Woman Teacher',
        ':woman_teacher:',
        ':teacher:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🏫': [
        'Person Teacher',
        ':person_teacher:',
        ':teacher:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🎓': [
        'Людина-студент',
        ':man_student:',
        ':student:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎓': [
        'Жіночий студент',
        ':woman_student:',
        ':student:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎓': [
        'Співробітник',
        ':person_student:',
        ':student:',
        ':person:'
    ],
    '👨{{skin_tone}}‍⚕️': [
        'Здоров\'я',
        ':man_health_worker:',
        ':health_worker:',
        'Чол. доктор',
        'Чол. медсестра',
        ':man:'
    ],
    '👩{{skin_tone}}‍⚕️': [
        'Працівники здоров\'я жінки',
        ':woman_health_worker:',
        ':health_worker:',
        'Жіночий Доктор',
        'Жіноча сестра',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍⚕️': [
        'Person Health Worker',
        ':person_health_worker:',
        ':health_worker:',
        'Person Doctor',
        'Person Nurse',
        ':person:'
    ],
    '🤷{{skin_tone}}‍♂️': [
        'Чоловік стискання',
        ':man_shrugging:',
        ':shrugging:',
        'дивна людина',
        'dunno',
        ':man:'
    ],
    '🤷{{skin_tone}}‍♀️': [
        'Жінка зникає',
        ':woman_shrugging:',
        ':shrugging:',
        'вся жінка',
        'dunno',
        ':woman:'
    ],
    '🤷{{skin_tone}}': [
        'Персон Розмиває',
        ':person_shrugging:',
        ':shrugging:',
        'нехтувати людиною',
        'dunno',
        ':person:'
    ],
    '🤦{{skin_tone}}‍♂️': [
        'Фацепалг',
        ':man_facepalming:',
        ':facepalming:',
        ':man:'
    ],
    '🤦{{skin_tone}}‍♀️': [
        'Жінка Фацепалмінг',
        ':woman_facepalming:',
        ':facepalming:',
        ':woman:'
    ],
    '🤦{{skin_tone}}': [
        'Персон Фацепалмінг',
        ':person_facepalming:',
        ':facepalming:',
        ':person:'
    ],
    '🙇{{skin_tone}}‍♂️': [
        'Man Bowing',
        ':man_bowing:',
        ':bowing:',
        ':man:'
    ],
    '🙇{{skin_tone}}‍♀️': [
        'Woman Bowing',
        ':woman_bowing:',
        ':bowing:',
        ':woman:'
    ],
    '🙇{{skin_tone}}': [
        'Персон Борбоукс',
        ':person_bowing:',
        ':bowing:',
        ':person:'
    ],
    '🧏{{skin_tone}}‍♂️': [
        'Людина-глух',
        ':deaf_man:',
        ':deaf:',
        ':man:'
    ],
    '🧏{{skin_tone}}‍♀️': [
        'Deaf Woman',
        ':deaf_woman:',
        ':deaf:',
        ':woman:'
    ],
    '🧏{{skin_tone}}': [
        'глухі особи',
        ':deaf_person:',
        ':deaf:',
        ':person:'
    ],
    '🙋{{skin_tone}}‍♂️': [
        'Man Raising Hand',
        ':man_raising_hand:',
        'Happy Man Raising One Hand',
        ':raising_hand:',
        ':man:'
    ],
    '🙋{{skin_tone}}‍♀️': [
        'Жінка виховання рук',
        ':woman_raising_hand:',
        'Щаслива жінка з підвищенням однієї руки',
        ':raising_hand:',
        ':woman:'
    ],
    '🙋{{skin_tone}}': [
        'Персон підвищує руку',
        ':person_raising_hand:',
        'Щаслива особа підняти одну руку',
        ':raising_hand:',
        ':person:'
    ],
    '💁{{skin_tone}}‍♂️': [
        'Рука удару',
        ':man_tipping_hand:',
        'Інформаційний центр людини',
        ':tipping_hand:',
        ':man:'
    ],
    '💁{{skin_tone}}‍♀️': [
        'Жінка, накидаюча рука',
        ':woman_tipping_hand:',
        'Біля інформаційного центру',
        ':tipping_hand:',
        ':woman:'
    ],
    '💁{{skin_tone}}': [
        'Персона Підказка',
        ':person_tipping_hand:',
        'Інформаційний робочий стіл',
        ':tipping_hand:',
        ':person:'
    ],
    '🙆{{skin_tone}}‍♂️': [
        'Man Gesturing OK',
        ':man_gesturing_ok:',
        ':gesturing_ok:',
        ':man:'
    ],
    '🙆{{skin_tone}}‍♀️': [
        'Жінка-жестикуляр OK',
        ':woman_gesturing_ok:',
        ':gesturing_ok:',
        ':woman:'
    ],
    '🙆{{skin_tone}}': [
        'ОК Персона Гестурінга',
        ':person_gesturing_ok:',
        ':gesturing_ok:',
        ':person:'
    ],
    '🙅{{skin_tone}}‍♂️': [
        'Не наймит людина',
        ':man_gesturing_no:',
        ':gesturing_no:',
        ':man:'
    ],
    '🙅{{skin_tone}}‍♀️': [
        'Ніяких жіночих жертв',
        ':woman_gesturing_no:',
        ':gesturing_no:',
        ':woman:'
    ],
    '🙅{{skin_tone}}': [
        'Без жестів',
        ':person_gesturing_no:',
        ':gesturing_no:',
        ':person:'
    ],
    '🙎{{skin_tone}}‍♂️': [
        'Чоловік із Поутінгу',
        ':man_pouting:',
        ':pouting:',
        ':man:'
    ],
    '🙎{{skin_tone}}‍♀️': [
        'Woman Pouting',
        ':woman_pouting:',
        ':pouting:',
        ':woman:'
    ],
    '🙎{{skin_tone}}': [
        'Персон Путінг',
        ':person_pouting:',
        ':pouting:',
        ':person:'
    ],
    '🙍{{skin_tone}}‍♂️': [
        'Man Frowning',
        ':man_frowining:',
        ':frowining:',
        ':man:'
    ],
    '🙍{{skin_tone}}‍♀️': [
        'Жіночий потоп',
        ':woman_frowining:',
        ':frowining:',
        ':woman:'
    ],
    '🙍{{skin_tone}}': [
        'Персон Фоунінг',
        ':person_frowining:',
        ':frowining:',
        ':person:'
    ],
    '🧟‍♂️': [
        'Man Zombie',
        ':man_zombie:',
        ':zombie:',
        ':man:'
    ],
    '🧟‍♀️': [
        'Woman Zombie',
        ':woman_zombie:',
        ':zombie:',
        ':woman:'
    ],
    '🧟': [
        'Зомбі',
        ':person_zombie:',
        ':zombie:',
        ':person:'
    ],
    '🚶{{skin_tone}}‍♂️': [
        'Чоловіча ходьба',
        ':man_walking:',
        ':walking:',
        ':man:'
    ],
    '🚶{{skin_tone}}‍♀️': [
        'Жінка йде',
        ':woman_walking:',
        ':walking:',
        ':woman:'
    ],
    '🚶{{skin_tone}}': [
        'Персон йде',
        ':person_walking:',
        ':walking:',
        ':person:'
    ],
    '🚶{{skin_tone}}‍♂️‍➡️': [
        'Man Walking Facing Right',
        ':man_walking_facing_right:',
        ':walking:',
        ':man:'
    ],
    '🚶{{skin_tone}}‍♀️‍➡️': [
        'Woman Walking Facing Right',
        ':woman_walking_facing_right:',
        ':walking:',
        ':woman'
    ],
    '🚶{{skin_tone}}‍➡️': [
        'Person Walking Facing Right',
        ':person_walking_facing_right:',
        ':walking:',
        ':person:'
    ],
    '🧍{{skin_tone}}‍♂️': [
        'Чоловік що стоїть',
        ':man_standing:',
        ':standing:',
        ':man:'
    ],
    '🧍{{skin_tone}}‍♀️': [
        'Жінка, що сідає',
        ':woman_standing:',
        ':standing:',
        ':woman:'
    ],
    '🧍{{skin_tone}}': [
        'Персон Стендінг',
        ':person_standing:',
        ':standing:',
        ':person:'
    ],
    '🧎{{skin_tone}}‍♂️': [
        'Ман Нелінг',
        ':man_kneeling:',
        ':kneeling:',
        ':man:'
    ],
    '🧎{{skin_tone}}‍♀️': [
        'Жінка-плетун',
        ':woman_kneeling:',
        ':kneeling:',
        ':woman:'
    ],
    '🧎{{skin_tone}}': [
        'Персон Кнілінк',
        ':person_kneeling:',
        ':kneeling:',
        ':person:'
    ],
    '🧎{{skin_tone}}‍♂️‍➡️': [
        'Man Kneeling Facing Right',
        ':man_kneeling_facing_right:',
        ':kneeling:',
        ':man:'
    ],
    '🧎{{skin_tone}}‍♀️‍➡️': [
        'Woman Kneeling Facing Right',
        ':woman_kneeling_facing_right:',
        ':kneeling:',
        ':woman:'
    ],
    '🧎{{skin_tone}}‍➡️': [
        'Person Kneeling Facing Right',
        ':person_kneeling_facing_right:',
        ':kneeling:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦯': [
        'Людина з білою палицею',
        ':man_with_white_cane:',
        ':white_cane:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦯': [
        'Жінка з білою паличкою',
        ':woman_with_white_cane:',
        ':white_cane:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦯': [
        'Особа з Білим Петром',
        ':person_with_white_cane:',
        ':white_cane:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦯‍➡️': [
        'Man with White Cane Facing Right',
        ':man_with_white_cane_facing_right:',
        ':white_cane:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦯‍➡️': [
        'Woman with White Cane Facing Right',
        ':woman_with_white_cane_facing_right:',
        ':white_cane:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦯‍➡️': [
        'Person with White Cane Facing Right',
        ':person_with_white_cane_facing_right:',
        ':white_cane:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦼': [
        'Людина у моторейному візку',
        ':man_in_motorized_wheelchair:',
        ':motorized_wheelchair:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦼': [
        'Жінка у моторизованому візку',
        ':woman_in_motorized_wheelchair:',
        ':motorized_wheelchair:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦼': [
        'Персон у моторизованому інвалідному кріслі',
        ':person_in_motorized_wheelchair:',
        ':motorized_wheelchair:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦼‍➡️': [
        'Man in Motorized Wheelchair Facing Right',
        ':man_in_motorized_wheelchair_facing_right:',
        ':motorized_wheel:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦼‍➡️': [
        'Woman in Motorized Wheelchair Facing Right',
        ':woman_in_motorized_wheelchair_facing_right:',
        ':motorized_wheel:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦼‍➡️': [
        'Person in Motorized Wheelchair Facing Right',
        ':person_in_motorized_wheelchair_facing_right:',
        ':motorized_wheel:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦽': [
        'Людина в ручному візку',
        ':man_manual_wheelchair:',
        ':manual_wheelchair:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦽': [
        'Жінка за кермом вручну',
        ':woman_manual_wheelchair:',
        ':manual_wheelchair:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦽': [
        'Людина за допомогою ручного коліщатка',
        ':person_manual_wheelchair:',
        ':manual_wheelchair:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦽‍➡️': [
        'Man in Manual Wheelchair Facing Right',
        ':man_manual_wheelchair_facing_right:',
        ':manual_wheelchair:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦽‍➡️': [
        'Woman in Manual Wheelchair Facing Right',
        ':woman_manual_wheelchair_facing_right:',
        ':manual_wheelchair:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦽‍➡️': [
        'Person in Manual Wheelchair Facing Right',
        ':person_manual_wheelchair_facing_right:',
        ':manual_wheelchair:',
        ':person:'
    ],
    '👯‍♂️': [
        'Люди з вушками',
        ':men_with_bunny_hears:',
        ':bunny_ears:',
        ':man:'
    ],
    '👯‍♀️': [
        'Жінки з вушками кролика',
        ':women_with_bunny_hears:',
        ':bunny_ears:',
        ':woman:'
    ],
    '👯': [
        'Люди з вушками',
        ':people_with_bunny_hears:',
        ':bunny_ears:',
        ':person:'
    ],
    '🕴️{{skin_tone}}': [
        'Персон у костюмі в Левітації',
        ':person_in_suit_levitating:',
        'Наклейний чоловік',
        'Руд Бой',
        'Walt Jabsco',
        'Людина у діловому костюмі',
        ':person:'
    ],
    '🧖{{skin_tone}}‍♂️': [
        'Чоловік у Steamy Кімнаті',
        ':man_in_steamy_room:',
        ':steamy_room:',
        'Людина у сауні',
        ':man:'
    ],
    '🧖{{skin_tone}}‍♀️': [
        'Жінка у Steamy кімнаті',
        ':woman_in_steamy_room:',
        ':steamy_room:',
        'Жінка в сауні',
        ':woman:'
    ],
    '🧖{{skin_tone}}': [
        'Персон у Steamy кімнаті',
        ':person_in_steamy_room:',
        ':steamy_room:',
        'Персон-ін-Сауна',
        ':person:'
    ],
    '👫{{skin_tone}}': [
        'Жінка і людина Холдинг Руки',
        ':woman_and_man_holding_hands:',
        ':holding_hands:',
        'Гетеросексуальна пара',
        'Прямий купіль',
        'Чоловік і жінка тримаються за руки',
        ':woman:'
    ],
    '👬{{skin_tone}}': [
        'Чоловіки утримують руки',
        ':holding_hands:',
        ':men_holding_hands:',
        'Гей-купель',
        'Два чоловіки тримаються за руки',
        ':man:'
    ],
    '👭{{skin_tone}}': [
        'Жінки утримують руки',
        ':holding_hands:',
        ':women_holding_hands:',
        'Куполь лесбіянки',
        'Дві жінки тримати руки',
        ':woman:'
    ],
    '🧑‍🤝‍🧑': [
        'Люди тримаються за руки',
        ':holding_hands:',
        ':people_holding_hands:',
        'Дві людини тримаються за руки',
        'Гендерний включний Купул',
        'Гендерні нейтральні купули',
        'Гендер пари неконформації',
        ':person:'
    ],
    '🧑‍🧑‍🧒': [
        'Family: Adult, Adult, Child',
        ':family_adult_adult_child:',
        'Family: Person, Person, Child'
    ],
    '👨‍👩‍👦': [
        'Родина в Матері, отця і сина',
        ':family_with_mother_father_and_son:',
        'Сім\'я: Чоловік, жінка, хлопчик'
    ],
    '👨‍👩‍👧': [
        'Родина з мамою, батьком і дочкою',
        ':family_with_mother_father_and_daughter:',
        'Сім\'я: Людина, жінка, дівчина'
    ],
    '👨‍👨‍👦': [
        'Сім\'я з двома отцями і сином',
        ':family_with_two_fathers_and_son:',
        'Людина, чоловіче, хлопчик',
        ':man:'
    ],
    '👨‍👨‍👧': [
        'Родина з двома отцями і дочкою',
        ':family_with_two_fathers_and_daughter:',
        'Сім\'я: Людина, людина, дівчина',
        ':man:'
    ],
    '👩‍👩‍👦': [
        'Родина з двома матерями і сином',
        ':family_with_two_mothers_and_son:',
        'Сім\'я: Жінка, жінка',
        ':woman:'
    ],
    '👩‍👩‍👧': [
        'Родина з двома матерями та дочкою',
        ':family_with_two_mothers_and_daughter:',
        'Сім\'я: Жінка, Жінка, дівчина',
        ':woman:'
    ],
    '🧑‍🧑‍🧒‍🧒': [
        'Family: Adult, Adult, Child, Child',
        ':family_adult_adult_child_child:',
        'Family: Person, Person, Child, Child'
    ],
    '👨‍👩‍👧‍👦': [
        'Сімейство в матері, отче, син і дочка',
        ':family_with_mother_father_son_and_daughter:',
        'Сім\'я: Людина, Жінка, дівчина, хлопчик'
    ],
    '👨‍👩‍👦‍👦': [
        'Родина з мамою, батьком і двома синами',
        ':family_with_mother_father_and_two_sons:',
        'Сім\'я: Чоловік, жінка, хлопчик'
    ],
    '👨‍👩‍👧‍👧': [
        'Родина в Мати й батька та дві дочки',
        ':family_with_mother_father_and_two_daughters:',
        'Сім\'я: Людина, Жінка, дівчина, дівчина'
    ],
    '👨‍👨‍👧‍👦': [
        'Сімейство з двома Отцями, сином і дочкою',
        ':family_with_two_fathers_son_and_daughter:',
        'Сім\'я: людина, дівчина, хлопчик',
        ':man:'
    ],
    '👨‍👨‍👦‍👦': [
        'Сім\'я з двома отцями та двома синами',
        ':family_with_two_fathers_and_two_sons:',
        'Сім\'я: Чоловік, хлопчик',
        ':man:'
    ],
    '👨‍👨‍👧‍👧': [
        'Родина з двома отцями і двома дочками',
        ':family_with_two_fathers_and_two_daughters:',
        'Сім\'я: Людина, дівчина, дівчина',
        ':man:'
    ],
    '👩‍👩‍👧‍👦': [
        'Сімейство з двома матерцями, сином і дочкою',
        ':family_with_two_mothers_son_and_daughter:',
        'Сім\'я: Жінка, Жінка, дівчина',
        ':woman:'
    ],
    '👩‍👩‍👦‍👦': [
        'Родина з двома матерями та двома синами',
        ':family_with_two_mothers_and_two_sons:',
        'Сім\'я: Жінка, жінка хлопчик',
        ':woman:'
    ],
    '👩‍👩‍👧‍👧': [
        'Сім\'я разом з двома матерями та двома дочками',
        ':family_with_two_mothers_and_two_daughters:',
        'Сім\'я: Жінка, жінка, дівчина, дівчина',
        ':woman:'
    ],
    '🧑‍🧒': [
        'Family: Adult, Child',
        ':family_adult_child:',
        'Family: Person, Child'
    ],
    '👨‍👦': [
        'Родина з батьком і сином',
        ':family_with_father_and_son:',
        'Людина, хлопчик',
        ':man:'
    ],
    '👨‍👧': [
        'Родина з батьком і дочкою',
        ':family_with_father_and_daughter:',
        'Сім\'я: Людина, дівчина',
        ':man:'
    ],
    '👩‍👧': [
        'Родина з матір\'ю та дочкою',
        ':family_with_mother_and_daughter:',
        'Сім\'я: Жінка, дівчина',
        ':woman:'
    ],
    '👨‍👧‍👧': [
        'Сім\'я з батьком і двома дочками',
        ':family_with_father_and_two_daughters:',
        'Сім\'я: Людина, дівчина, дівчина',
        ':man:'
    ],
    '🧑‍🧒‍🧒': [
        'Family: Adult, Child, Child',
        ':family_adult_child_child:',
        'Family: Person, Child, Child'
    ],
    '👨‍👦‍👦': [
        'Сім\'я з батьком і двома синами',
        ':family_with_father_and_two_sons:',
        'Сім\'я: Чоловік, хлопчик',
        ':man:'
    ],
    '👨‍👧‍👦': [
        'Сімейство з отцем, сином і дочкою',
        ':family_with_father_son_and_daughter:',
        'Сім\'я: людина, дівчина, хлопця',
        ':man:'
    ],
    '👩‍👦': [
        'Родина з матір\'ю і сином',
        ':family_with_mother_and_son:',
        'Сім\'я: Жінка, хлопчик',
        ':woman:'
    ],
    '👩‍👦‍👦': [
        'Родина з матір\'ю та двома синами',
        ':family_with_mother_and_two_sons:',
        'Сім\'я: Жінка, хлопчик',
        ':woman:'
    ],
    '👩‍👧‍👦': [
        'Сімейство в матері, сина та дочці',
        ':family_with_mother_son_and_daughter:',
        'Сім\'я: Жінка, дівчинка, хлопчик',
        ':woman:'
    ],
    '👩‍👧‍👧': [
        'Родина з матір\'ю та двома дочками',
        ':family_with_mother_and_two_daughters:',
        'Сімея: Жінка, дівчина, дівчина',
        ':woman:'
    ],
    '💑{{skin_tone}}': [
        'Деякі з серцем',
        ':couple_with_heart:',
        'Пара кохання',
        'Парфура',
        'Гендерні нейтральні купули',
        ':person:'
    ],
    '👩‍❤️‍👨': [
        'Людина і жінка з серцем',
        ':man_and_woman_with_heart:',
        'Пара кохання',
        'Парфура',
        'Деякі з серцем'
    ],
    '👨‍❤️‍👨': [
        'Двоє людей з серцем',
        ':two_men_with_heart:',
        'Зв\'язані з серцем: чоловік, людина',
        ':man:'
    ],
    '👩‍❤️‍👩': [
        'Дві жінки з серцем',
        ':two_women_with_heart:',
        'Жінка, жінка',
        ':woman:'
    ],
    '💏{{skin_tone}}': [
        'Поцілунок',
        ':couple_kissing:',
        'Поцілунок',
        'Гендерні нейтральні кулуари',
        ':person:'
    ],
    '👩‍❤️‍💋‍👨': [
        'Чоловік і жінка цілуються',
        ':man_and_woman_kissing:'
    ],
    '👨‍❤️‍💋‍👨': [
        'Двоє чоловіків цілуються',
        ':two_men_kissing:',
        'Поцілунок людини',
        ':man:'
    ],
    '👩‍❤️‍💋‍👩': [
        'Поцілунок двох жінок',
        ':two_women_kissing:',
        'Жінка і жінка цілуються',
        ':woman:'
    ],
    '💆{{skin_tone}}‍♂️': [
        'Чоловік, що користується головою',
        ':man_getting_head_massage:',
        ':getting_head_massage:',
        ':man:'
    ],
    '💆{{skin_tone}}‍♀️': [
        'Жінка, що здобуває голова масаж',
        ':woman_getting_head_massage:',
        ':getting_head_massage:',
        ':woman:'
    ],
    '💆{{skin_tone}}': [
        'Людина Людина отримала месаж',
        ':person_getting_head_massage:',
        ':getting_head_massage:',
        ':person:'
    ],
    '💇{{skin_tone}}‍♂️': [
        'Людина, що приймає зачіски',
        ':man_getting_haircut:',
        ':getting_haircut:',
        ':man:'
    ],
    '💇{{skin_tone}}‍♀️': [
        'Жінка, що приймає зачіску',
        ':woman_getting_haircut:',
        ':getting_haircut:',
        ':woman:'
    ],
    '💇{{skin_tone}}': [
        'Зачіпати колючу',
        ':person_getting_haircut:',
        ':getting_haircut:',
        ':person:'
    ],
    '🛌{{skin_tone}}': [
        'Спляче житло',
        'втомлений',
        ':sleeping_accommodation:',
        'Особа в ліжку',
        'Сплячий сон'
    ],
    '🛀{{skin_tone}}': [
        'Купальні для персона',
        'Купання',
        ':bath:',
        ':person_taking_bath:',
        'Гаряча ванна',
        'Персон бере ванну',
        'Лазня',
        'Душ',
        'Мило',
        'Tidy',
        'Clean',
        'Scrub'
    ],
    '🧌': [
        'Троль',
        ':troll:'
    ],
    '👺': [
        'Гоблін',
        ':goblin:',
        'Обличчя з довгим носом',
        'Червона маска',
        'Тенґу',
        'Японський гоблін'
    ]
};
/*animals*/
emojis_language[lang][4] = {
    '😺': [
        'Кот Ґрінінґ',
        ':happy_cat:',
        ':smiling_cat:',
        '::):',
        'Щаслива кішка',
        'Сміхотворний кіт',
        'Щасливі обличчя кота',
        'Скам\'янілий кіт з відкритим ротом'
    ],
    '😸': [
        'Плавильний кіт з усміхненими очима',
        ':grinning_cat:',
        '::D:',
        'Кот Ґрінінґ',
        'Щаслива кішка',
        'Обличчя кота'
    ],
    '😹': [
        'Кіт із списами Джой',
        ':laughing_cat:',
        '::):',
        'Щасливі торти',
        'Смішний Кіт'
    ],
    '😻': [
        'Сміхотворний кіт з очима серця',
        ':heart_eyes_cat:',
        ':*.*:',
        'Кіт із сердечними очима',
        'Кохання кота',
        'Лице з усміхненими очима з серцем'
    ],
    '😼': [
        'Кет із гарною посмішкою',
        ':cat_with_wry_smile:',
        'Чат зі свербленням',
        'Обличчя з усмішкою',
        'Котяча особа з гарною посмішкою'
    ],
    '😽': [
        'Кит поцілунковий',
        ':kissing_cat:',
        '::*:',
        'Обличчя кота поцілунків',
        'Котисельні обличчя з закритими очима'
    ],
    '🙀': [
        'Холодний кіт',
        ':weary_cat:',
        '::O:',
        'Кат',
        'Кат на крику',
        'Крик обличчя кішок в страху',
        'Холостий кіт'
    ],
    '😿': [
        'Плач кота',
        ':crying_cat:',
        '::(:',
        'Сумний кіт',
        'Обличчя кота'
    ],
    '😾': [
        'Кіт-Путінг',
        ':pouting_cat:',
        'Grumpy Cat',
        'Лице з листом гидоти'
    ],
    '🙈': [
        'Не злий мавпа',
        'Мавпа',
        ':see-no-evil_mokey:',
        ':see_no_evil_mokey:',
        ':monkey:',
        'Мізару',
        'Мавпячі вигнуті очі'
    ],
    '🙉': [
        'Слух — незлий мавпа',
        'Мавпа',
        ':hear-no-evil_monkey:',
        ':hear_no_evil_monkey:',
        ':monkey:',
        'Kikazaru',
        'Мавпячі вуха'
    ],
    '🙊': [
        'Мовець — не злий мавпа',
        'Мавпа',
        ':speak-no-evil_monkey:',
        ':speak_no_evil_monkey:',
        ':monkey:',
        'Івадзару',
        'Мавпячий ковпак рот',
        'Без озвучування'
    ],
    '🐵': [
        'Поверхня мавпи',
        ':monkey_face:',
        'Мавпа',
        'Голова мавпи'
    ],
    '🐒': [
        'Мавпа',
        ':monkey:',
        'Мавпа Цілком'
    ],
    '🦍': [
        'Gorilla',
        ':gorilla:'
    ],
    '🐶': [
        'Обличчя собаки',
        ':dog_face:',
        'Собака',
        'Цуцик'
    ],
    '🐕': [
        'Собака',
        ':dog:',
        'Doggo',
        'Akita Inu'
    ],
    '🦮': [
        'Бачив собаку ока',
        ':seeing_eye_dog:',
        'Туман'
    ],
    '🐕‍🦺': [
        'Сервісний собака',
        ':service_dog:'
    ],
    '🐩': [
        'Пудель',
        ':poodle:',
        'Собака',
        'Мініатюрні капсули',
        'Стандартна пудель',
        'Іграшка пудель'
    ],
    '🐺': [
        'Вовк',
        ':wolf:',
        'Обличчя вовка',
        ':gray:',
        ':grey:'
    ],
    '🦊': [
        'Лисиця',
        ':fox:',
        'Лисенітниця',
        ':orange:'
    ],
    '🦝': [
        'Єнот',
        ':raccoon:'
    ],
    '🐱': [
        'Обличчя кішок',
        ':cat_face:',
        ':3',
        'Кіттен',
        'Кітті'
    ],
    '🐈': [
        'Кішка',
        ':cat:',
        'Домашня кішка',
        'Фелін',
        'Усека'
    ],
    '🐈‍⬛': [
        'Чорна Кішка',
        ':black_cat:',
        ':black:'
    ],
    '🦁': [
        'Лев',
        ':lion:',
        'Обличчя лев'
    ],
    '🐯': [
        'Обличчя тигра',
        ':tiger_face:',
        'Милий тигр'
    ],
    '🐅': [
        'Тигр',
        ':tiger:',
        'Бенгал Тайгер'
    ],
    '🐆': [
        'Leopard',
        ':leopard:',
        'Африканський леопард',
        'Jaguar'
    ],
    '🐴': [
        'Обличчя коня',
        ':horse_face:',
        'Голова коня'
    ],
    '🐎': [
        'Кінь',
        ':horse:',
        'Галлопінг',
        'Рейкінь'
    ],
    '🦄': [
        'Єдиноріг',
        ':unicorn:',
        'Обличчя єдинорога'
    ],
    '🦓': [
        'Zebra',
        ':zebra:',
        'Обличчя Зебра',
        ':white:',
        ':black:'
    ],
    '🦌': [
        'Оленеві',
        ':deer:',
        'Бак',
        'Різдвяний Олень',
        'Stag'
    ],
    '🐮': [
        'Обличчя корови',
        ':cow_face:',
        'Корова',
        'Щаслива корова'
    ],
    '🐂': [
        'Бик',
        ':ox:',
        'Булл',
        'Буллок',
        'Оксен',
        'Штайр'
    ],
    '🐃': [
        'Водне буфало',
        ':water_buffalo:',
        'Баффало',
        'Внутрішній Водна Буфало'
    ],
    '🐄': [
        'Корова',
        ':cow:',
        'Молочарня корова'
    ],
    '🐷': [
        'Обличчя свині',
        ':pig_fase:',
        'Свиня',
        'Порося голова',
        ':pink:'
    ],
    '🐖': [
        'Свиня',
        ':pig:',
        'Круг',
        'Sow',
        ':pink:'
    ],
    '🐗': [
        'Кабан',
        ':boar:',
        'Бородавочник',
        'Дикий векор',
        'Дика свиня'
    ],
    '🐽': [
        'Свиня Носе',
        ':pig_nose:'
    ],
    '🐏': [
        'Ram',
        ':ram:',
        'Вівця'
    ],
    '🐑': [
        'Ewe',
        ':ewe:',
        'Lamb',
        'Вівця'
    ],
    '🐐': [
        'Коза',
        ':goat:'
    ],
    '🐪': [
        'Верблюд',
        ':camel:',
        'Арабський камель',
        'Дромедарі Камель',
        'Однодамп камель'
    ],
    '🐫': [
        'Двогамм-камель',
        ':two-hump_camel:',
        ':two_hump_camel:',
        'Азійський верблюд',
        'Бактріан Кемел'
    ],
    '🦙': [
        'Llama',
        ':llama:',
        'Alpaca'
    ],
    '🦒': [
        'Giraffe',
        ':giraffe:',
        'Giraffe Face'
    ],
    '🐘': [
        'Слон',
        ':elephant:'
    ],
    '🦏': [
        'Rhinoceros',
        ':rhinoceros:',
        'Rhino'
    ],
    '🦛': [
        'Hippopotamus',
        ':hippopotamus:',
        'Hippo'
    ],
    '🐭': [
        'Лице мишки',
        ':mouse_face:',
        'Миша'
    ],
    '🐁': [
        'Миша',
        ':mouse:',
        'Вовчкові',
        'Гризуни',
        'Миші'
    ],
    '🐀': [
        'Щур',
        ':rat:',
        'Гризуни'
    ],
    '🐹': [
        'Хом\'яки',
        ':hamster:',
        'Обличчя Гамстера'
    ],
    '🐰': [
        'Обличчя кролика',
        ':rabbit_face:',
        'Великодній заєць'
    ],
    '🐇': [
        'Кролі',
        'Bunny',
        ':rabbit:',
        'Кролик кріликовий'
    ],
    '🐿️': [
        'Бурундук',
        ':chipmunk:',
        'Вивіркові'
    ],
    '🦔': [
        'Хеджхог',
        ':hedgehog:'
    ],
    '🦇': [
        'Кажан',
        ':bat:',
        'Бетмен',
        ':black:'
    ],
    '🐻': [
        'Ведмідь',
        ':bear:',
        'Ведмеді обличчя',
        'Тедді Ведмідь',
        ':brown:'
    ],
    '🐨': [
        'Коала',
        ':koala:',
        'Обличчя Коала'
    ],
    '🐼': [
        'Панда',
        ':panda:',
        'Обличчя панди'
    ],
    '🦘': [
        'Кенгуру',
        ':kangaroo:',
        'Ро'
    ],
    '🦡': [
        'Беджер',
        ':badger:'
    ],
    '🦃': [
        'Індик',
        ':turkey:',
        'Індичка до Дня Подяки',
        'Дика Туреччина'
    ],
    '🐔': [
        'Курка',
        ':chicken:',
        'Hen'
    ],
    '🐓': [
        'Кок',
        ':cock:',
        'Rooster',
        'Півник'
    ],
    '🐣': [
        'Висиджування чику',
        ':hatching_chick:',
        'Маленька курка',
        'Чік Гетчінг',
        ':yellow:'
    ],
    '🐤': [
        'Бебі Чик',
        ':baby_chick:',
        'Жовтий птах',
        ':yellow:'
    ],
    '🐥': [
        'Фронт-Фасинг',
        ':front_baby_chick:',
        'Бебі Чик',
        'Стендінг',
        ':yellow:'
    ],
    '🐦': [
        'Птахи',
        ':bird:'
    ],
    '🐧': [
        'Penguin',
        ':penguin:'
    ],
    '🕊️': [
        'Голуб',
        ':Dove:',
        'Голуб миру',
        ':white:'
    ],
    '🦅': [
        'Орел',
        ':Eagle:',
        'Білоголовий орлан'
    ],
    '🦆': [
        'Присісти',
        ':Duck:'
    ],
    '🦢': [
        'Лебідь',
        ':swan:',
        ':white:'
    ],
    '🦉': [
        'Совоподібні',
        ':owl:',
        ':brown:'
    ],
    '🦚': [
        'Павич',
        ':peacock:'
    ],
    '🦜': [
        'Папуга',
        ':parrot:'
    ],
    '🐸': [
        'Жаба',
        ':frog:',
        'Жаба',
        'Жаб\'яче обличчя',
        ':green:'
    ],
    '🐊': [
        'Крокодил',
        ':crocodile:',
        'Алігатор',
        'Крок',
        ':green:'
    ],
    '🐢': [
        'Черепаха',
        ':turtle:',
        'Tortoise',
        ':green:'
    ],
    '🦎': [
        'Ящірки',
        ':lizard:',
        'Гецко',
        ':green:'
    ],
    '🐍': [
        'Змія',
        ':snake:',
        'Змій'
    ],
    '🐲': [
        'Обличчя Дракона',
        ':dragon_face:',
        'Голова дракона'
    ],
    '🐉': [
        'Дракон',
        ':dragon:'
    ],
    '🦕': [
        'Завропод',
        ':sauropod:',
        'Brachiosaurus',
        'Brontosaurus',
        'Dinosaur'
    ],
    '🦖': [
        'T-Rex',
        ':t-rex:',
        ':t_rex:',
        'Tyrannosaurus Rex'
    ],
    '🐳': [
        'Дурений кит',
        ':spouting_whale:',
        'Милий кит'
    ],
    '🐋': [
        'Кит',
        ':whale:'
    ],
    '🐬': [
        'Дельфін',
        ':dolphin:'
    ],
    '🐟': [
        'Риба',
        ':fish:',
        'Прісноводна риба'
    ],
    '🐠': [
        'Тропічна риба',
        ':tropical_fish:',
        'Риба',
        'Жовтоблакитна риба'
    ],
    '🐡': [
        'Риба-клоун',
        ':blowfish:',
        'Fugu',
        'Риба-фугу'
    ],
    '🦈': [
        'Акула',
        ':shark:',
        'Велика біла іскарка'
    ],
    '🐙': [
        'Восьминіг',
        ':octopus:'
    ],
    '🐚': [
        'Спіральний снаряд',
        ':spiral_shell:',
        'Черепашка',
        'Оболонка'
    ],
    '🐌': [
        'Равлик',
        ':snail:',
        'Мітка',
        'Садовий равлик'
    ],
    '🦋': [
        'Метелик',
        ':butterfly:'
    ],
    '🐛': [
        'Помилка',
        ':bug:',
        'Гусениця',
        'Комаха'
    ],
    '🐜': [
        'Ant',
        ':ant:',
        'Помилка',
        'Комаха'
    ],
    '🐝': [
        'Медова бджола',
        ':honeybee:',
        'Бджола',
        'Bumblebee',
        ':yellow:',
        ':black:'
    ],
    '🐞': [
        'Леді-жук',
        ':lady_beetle:',
        'Ladybird',
        'Ladybug',
        'Помилка'
    ],
    '🦗': [
        'Крикет',
        ':cricket:',
        'Коник'
    ],
    '🕷️': [
        'Павук',
        ':spider:'
    ],
    '🦂': [
        'Скорпіон',
        ':scorpion:'
    ],
    '🦟': [
        'Комарі',
        ':mosquito:',
        ':black:'
    ],
    '🦀': [
        'Краб',
        ':crab:',
        ':red:'
    ],
    '🦞': [
        'Лобстери',
        ':lobster:'
    ],
    '🦐': [
        'Шрімп',
        ':shrimp:',
        'Prawn'
    ],
    '🦑': [
        'Кальмари',
        ':squid:'
    ],
    '🦧': [
        'Orangutan',
        ':orangutan:'
    ],
    '🦥': [
        'Лещачі',
        ':sloth:'
    ],
    '🦦': [
        'Otter',
        ':otter:'
    ],
    '🦨': [
        'Скунс',
        ':skunk:'
    ],
    '🦬': [
        'Бізон',
        ':bison:'
    ],
    '🦣': [
        'Мамонт',
        ':mammoth:',
        ':brown:'
    ],
    '🦫': [
        'Бобер',
        ':beaver:'
    ],
    '🐻‍❄️': [
        'Полярний ведмідь',
        ':polar_bear:',
        ':white:'
    ],
    '🦤': [
        'Dodo',
        ':dodo:'
    ],
    '🦭': [
        'Запечатка',
        ':seal:'
    ],
    '🪲': [
        'М\'ясо Жука',
        ':beetle:'
    ],
    '🪳': [
        'Таргани',
        ':cockroach:'
    ],
    '🪰': [
        'Політ',
        ':fly:'
    ],
    '🪱': [
        'Хробак',
        ':worm:'
    ],
    '🦩': [
        'Фламінго',
        ':flamingo:'
    ],
    '🪹': [
        'Порожнє гніздо',
        ':empty_nest:',
        'Пташки',
        'Дім'
    ],
    '🪺': [
        'Гніздо з яйцями',
        ':nest_with_eggs:',
        'Пташки',
        'Дім'
    ],
    '🫏': [
        'Donkey',
        ':donkey:',
        ':grey:',
        ':gray:'
    ],
    '🫎': [
        'Moose',
        ':moose:',
        'Moose Face',
        ':brown:'
    ],
    '🪿': [
        'Goose',
        ':goose:',
        ':white:'
    ],
    '🪼': [
        'Jellyfish',
        ':jellyfish:',
        ':blue:'
    ],
    '🐦‍⬛': [
        'Black bird',
        ':black_bird:',
        ':raven:',
        'Raven',
        'Crow',
        'Rook',
        ':black:'
    ],
    '🐦‍🔥': [
        'Phoenix',
        'Fire',
        'Reborn',
        ':phoenix:',
        ':red:'
    ]
};
/*symbols*/
emojis_language[lang][5] = {
    '💘': [
        'Серце зі стрілою',
        ':heart_with_arrow:',
        'Купідна стріла',
        'Lovestruck',
        ':pink:'
    ],
    '💝': [
        'Серце з стрічка',
        ':heart_with_ribbon:',
        'Шоколадний ящик',
        'Подарункова Коробка',
        'Подарункове серце',
        ':red:'
    ],
    '💖': [
        'Sparkling Heart',
        ':sparkling_heart:',
        'Серце свята',
        'Блискуче серце',
        'Зоряне серце',
        ':pink:'
    ],
    '💗': [
        'Зростаюче серце',
        ':growing_heart:',
        'Множичне серце',
        'Потрійне серце',
        ':pink:'
    ],
    '💓': [
        'Биття серця',
        ':beating_heart:',
        'Сигнал серця',
        'Heartbeat',
        'Wi-Fi Серце',
        ':pink:'
    ],
    '💞': [
        'Револьверні серця',
        ':revolving_hearts:',
        'Два серця',
        ':pink:'
    ],
    '💕': [
        'Два серця',
        ':two_hearts:',
        'Маленькі серця',
        'Два рожеві серця',
        ':pink:'
    ],
    '💟': [
        'Прикраса серця',
        ':heart_decoration:',
        ':purple:'
    ],
    '❣️': [
        'Вигук серця',
        ':heart_exclamation:',
        'Серце над краплями',
        'Червоне серце як марка оклику',
        'Виключення Важкого серця Марка Орнір',
        ':red:'
    ],
    '💔': [
        'Зламане серце',
        ':broken_heart:',
        'Ластове серце',
        'Гробовик',
        'Серце зламалося',
        ':red:'
    ],
    '❤️‍🩹': [
        'Середнє серце',
        ':mending_heart:',
        'Порушене серце',
        'Лікування серця',
        'Неполамане серце',
        ':red:'
    ],
    '❤️‍🔥': [
        'Серце у вогні',
        ':heart_on_fire:',
        ':red:'
    ],
    '❤️': [
        'Я тебе кохаю',
        ':red_heart:',
        'Червоне серце',
        'Серце',
        'Любовне серце',
        'Червоне серце',
        ':red:'
    ],
    '🧡': [
        'Помаранчеве Серце',
        ':orange_heart:',
        'Я тебе кохаю',
        ':orange:'
    ],
    '💛': [
        'Жовте серце',
        ':yellow_heart:',
        '#1 шлаф',
        'Золоте Серце',
        'Я тебе кохаю',
        ':yellow:'
    ],
    '💚': [
        'Зелене серце',
        ':green_heart:',
        'Озлобите серце',
        'Я тебе кохаю',
        ':green:'
    ],
    '💙': [
        'Синє серце',
        ':blue_heart:',
        'Я тебе кохаю',
        ':blue:'
    ],
    '💜': [
        'Пурпурне Серце',
        ':purple_heart:',
        'Я тебе кохаю',
        ':purple:'
    ],
    '🖤': [
        'Чорне серце',
        ':black_heart:',
        'Темне серце',
        'Я тебе кохаю',
        ':black:'
    ],
    '🤍': [
        'Біле серце',
        ':white_heart:',
        'Я тебе кохаю',
        ':white:'
    ],
    '🤎': [
        'Коричневе серце',
        ':brown_heart:',
        'Я тебе кохаю',
        ':brown:'
    ],
    '🩷': [
        'Pink Heart',
        ':pink_heart:',
        'I Love You',
        ':pink:'
    ],
    '🩵': [
        'Light Blue Heart',
        ':lightblue_heart:',
        'I Love You',
        ':blue:'
    ],
    '🩶': [
        'Grey Heart',
        'Gray Heart',
        ':grey_heart:',
        ':gray_heart:',
        'I Love You',
        ':gray:',
        ':grey:'
    ],
    '💯': [
        'Очки Сто',
        ':hundred_points:',
        '100',
        '%',
        'Тримайте це 100',
        'Досконала оцінка',
        'Символ верхніх точок'
    ],
    '💬': [
        'Мовна куля',
        ':speech_balloon:',
        'Чат Чат',
        'Булька Мовлення',
        ':white:'
    ],
    '💭': [
        'Думала куля',
        ':thought_balloon:',
        'Мислення бульбашки',
        'Думки',
        ':white:'
    ],
    '💤': [
        'Зз',
        ':zzz:',
        'Бедтим',
        'Буріння',
        'Сон',
        'Сплячий покажчик',
        'Символ сплячого режиму'
    ],
    '♠': [
        'Паростковий костюм',
        ':spade_suit:',
        'Spades',
        'Black Spade Suit'
    ],
    '♥': [
        'Костюм серця',
        ':heart_suit:',
        'Карта з серцем',
        'Серця',
        'Костюм Чорного Серця'
    ],
    '♦': [
        'Діамантовий костюм',
        ':diamond_suit:',
        'Ромби',
        'Чорний Діамантовий костюм'
    ],
    '♣': [
        'Костюм клубу',
        ':club_suit:',
        'Трефа',
        'Костюм Чорного клубу'
    ],
    '🏧': [
        'Знак банкомату',
        ':atm_sign:',
        'Банкомат',
        'Автоматизована машина Теллера',
        ':blue:'
    ],
    '🎧': [
        'Навушники',
        ':headphone:',
        'Навушник',
        'iPod',
        'Навушники'
    ],
    '🎵': [
        'Музична нотатка',
        ':musical_note:',
        'Смачная пари восьмих нотаток',
        'Красуня кваверів',
        'Музична примітка'
    ],
    '🎶': [
        'Нотатки',
        ':musical_notes:',
        'Музика',
        'Музичні нотатки',
        'Спів',
        'Кілька музичних нотаток'
    ],
    '🔔': [
        'Дзвін',
        ':bell:',
        'Дзвін Свободи',
        'Ringer',
        'Весільний дзвін',
        ':yellow:'
    ],
    '🔕': [
        'Дзвін із слеском',
        ':bell_with_slash:',
        'Сповіщення',
        'Дзвінок вимкнено',
        'Приглушений дзвін',
        'Белл з суцільним розчином',
        ':yellow:'
    ],
    '🔈': [
        'Низька гучність динаміка',
        ':speaker_low_volum:',
        'Об\'єм',
        'Динамік'
    ],
    '🔉': [
        'Середній гучність динаміка',
        ':speaker_medium_volume:',
        'Зменшити гучність',
        'Гучномовець з середнім гучністю',
        'Динамік з однією хвилею'
    ],
    '🔊': [
        'Висока гучність динаміка',
        ':speaker_high_volume:',
        'Збільшити гучність',
        'Гучномовець з трьома звуковими хвилями'
    ],
    '🔇': [
        'Приглушений динамік',
        ':muted_speaker:',
        'Вимкнути звук',
        'Гучномовець з обрисом скасування'
    ],
    '📢': [
        'Гучномовець',
        ':loudspeaker:',
        'Оголошення',
        'Система голосового сповіщення',
        'Гучномовець для публічних виступів'
    ],
    '⛔': [
        'Немає записів',
        ':no_entry:',
        ':red:'
    ],
    '🚫': [
        'Заборонено',
        ':prohibited:',
        'Забанений',
        'Бекслеш Кола',
        'Ні',
        'Червоне коло перейшло',
        'Обмежений',
        'Немає підпису запису',
        ':red:'
    ],
    '🚳': [
        'Немає велосипедів',
        ':no_bicycles:',
        'Знак велосипедів не знайдено',
        ':red:',
        ':black:'
    ],
    '🚭': [
        'Паління немає',
        ':no_smoking:',
        'Немає куріння символів',
        ':red:',
        ':black:'
    ],
    '🚯': [
        'Без лайкерів',
        ':no_littering:',
        'Без Litter символів',
        ':red:',
        ':black:'
    ],
    '🚱': [
        'Непотенційна вода',
        ':non-potable_water:',
        ':non_potable_water:',
        'Без води',
        'Немає питної води',
        'Символ непридатної води',
        ':red:',
        ':black:'
    ],
    '🚷': [
        'Немає пішоходів',
        ':no_pedestrians:',
        'Немає людей',
        'Ходьба немає',
        ':red:',
        ':black:'
    ],
    '🔞': [
        'Ніхто не знаходиться під тринадцятою',
        ':no_one_under_18:',
        'ПНС',
        'Ніхто не знаходиться під довжиною вісімнадцяти символів',
        '18',
        ':red:',
        ':black:'
    ],
    '📵': [
        'Немає телефонів для мобільних телефонів',
        ':no_mobile_phones:',
        'Немає телефонів в продажу',
        'Немає телефонів',
        'Немає смартфонів',
        ':red:',
        ':black:'
    ],
    '☢️': [
        'Radioactive',
        ':radioactive:',
        'Міжнародний символ випромінювання',
        'Ядерне',
        'Радіоактивний знак',
        ':orange:'
    ],
    '☣️': [
        'Біогазар',
        ':biohazard:',
        'Знак біотеги',
        ':orange:'
    ],
    '⬆️': [
        'Кнопка Стрілки вгору',
        ':up_arrow_button:',
        'Вгору по стрілці',
        'Верхня Чорна стріла',
        ':blue:'
    ],
    '↗️': [
        'Верхня права стрілка',
        ':up-right_arrow_button:',
        ':up_right_arrow_button:',
        'Діагональна верхня права стріла',
        'Північна Східна стріла',
        ':blue:'
    ],
    '➡️': [
        'Кнопка правої стрілки',
        ':right_arrow_button:',
        'Вправо на стрілку',
        'Чорна стріла',
        ':blue:'
    ],
    '↘️': [
        'Нижня права кнопка стрілки',
        ':down-right_arrow_button:',
        ':down_right_arrow_button:',
        'Діагональна нижня права стріла',
        'Південно-Східна стріла',
        ':blue:'
    ],
    '⬇️': [
        'Кнопка вниз',
        ':down_arrow_button:',
        'Вниз зі стрілками',
        'Нижня Чорна стріла',
        ':blue:'
    ],
    '↙️': [
        'Нижня ліва кнопка стрілки',
        ':down-left_arrow_button:',
        ':down_left_arrow_button:',
        'Діагональна нижня стріла ліворуч',
        'Саут-Вест-Стріла',
        ':blue:'
    ],
    '⬅️': [
        'Кнопка лівої стрілки',
        ':left_arrow_button:',
        'Вліво по стрілках',
        'Ліва Чорна стріла',
        ':blue:'
    ],
    '↖️': [
        'Кнопка Стрілки вгорі',
        ':up-left_arrow_button:',
        ':up_left_arrow_button:',
        'Діагональна Стрілка вгору-ліворуч',
        'Північна Західна стріла',
        ':blue:'
    ],
    '↕️': [
        'Кнопка Вгору-Стрілка',
        ':up-down_arrow_button:',
        ':up_down_arrow_button:',
        'Вертикальні стрілки',
        'Стрілка вниз',
        ':blue:'
    ],
    '↔️': [
        'Ліва ліва кнопка стрілки',
        ':left-right_arrow_button:',
        ':left_right_arrow_button:',
        'Горизонтальні стрілки',
        'На узбіччі стрілки',
        'Ліва стрілка',
        ':blue:'
    ],
    '↩️': [
        'Крива ліва кнопка зі стрілками',
        ':right_arrow_curving_left_button:',
        'Надіслати відповідь',
        'Ліва вигнута стріла',
        'Стріли з Гаком',
        ':blue:'
    ],
    '↪️': [
        'Крива правої кнопки стрілки',
        ':left_arrow_curving_right_button:',
        'Переслати',
        'Права вигнута стріла',
        'Стріла з Гаком',
        ':blue:'
    ],
    '⤴️': [
        'Крива кнопки вгору за правою стрілкою',
        ':right_arrow_curving_up_button:',
        'Стрілка в пункт призначення вперед і повороти вгору',
        ':blue:'
    ],
    '⤵️': [
        'Кнопка зміщення правої стрілки',
        ':right_arrow_curving_down_button:',
        'Вигнута стріла вниз',
        'Стрілка з направленою стрілкою вниз',
        ':blue:'
    ],
    '🔃': [
        'За годинниковою стрілкою',
        ':clockwise_vertical_button:',
        'За годинниковою стрілкою вниз та вгору відкриті круглі стрілки',
        ':blue:'
    ],
    '🔄': [
        'Проти-годинникова стрілка',
        ':counterclockwise_button:',
        'Оновити',
        'Обертати',
        'Перемкнути',
        'Проти годинникової стрілки',
        'Проти годинникової стрілки вниз та вгору відкрити коло стріл',
        ':blue:'
    ],
    '🔙': [
        'Задня стріла',
        ':back_arrow:',
        'Відмінити',
        'Назад з лівою стрілою вище',
        ':black:'
    ],
    '🔚': [
        'Стрілка в кінці',
        ':end_arrow:',
        'Кінець',
        'Завершити з лівою стрілою вище',
        ':black:'
    ],
    '🔛': [
        'ВК! Стріла',
        ':on_arrow:',
        'Увімк',
        'Увімкнути за допомогою позначки виключення з лівої правої стрілки',
        ':black:'
    ],
    '🔜': [
        'Скоро стріла',
        ':soon_arrow:',
        'Незабаром',
        'Скоро з направленою стрілою над',
        ':black:'
    ],
    '🔝': [
        'Стрілка вгорі',
        ':top_arrow:',
        'Верх',
        'Верхня — Стрілка над',
        ':black:'
    ],
    '🛐': [
        'Місце поклоніння',
        ':place_of_worship:',
        'Релігійний корпус',
        ':purple:'
    ],
    '⚛️': [
        'Символ Atom',
        ':atom_symbol:',
        ':purple:'
    ],
    '🕉️': [
        'Символ Om',
        ':om_symbol:',
        'Ом',
        'Aumkara',
        'Omkara',
        'Pranava',
        ':purple:'
    ],
    '✡️': [
        'Зірка Давида',
        ':star_of_david:',
        'Маген Девід',
        ':purple:'
    ],
    '☸️': [
        'Колесо Карми',
        ':wheel_of_dharma:',
        'Гелм',
        ':purple:'
    ],
    '☯️': [
        'Yin Yang',
        ':yin_yang:',
        ':purple:'
    ],
    '✝️': [
        'Латинський хрест',
        ':latin_cross:',
        'Християнський хрест',
        ':purple:'
    ],
    '☦️': [
        'Православний хрест',
        ':orthodox_cross:',
        ':purple:'
    ],
    '☪️': [
        'Зірка і Півмісяць',
        ':star_and_crescent:',
        ':purple:'
    ],
    '☮️': [
        'Символ миру',
        ':peace:',
        'Знак миру',
        ':purple:'
    ],
    '🕎': [
        'Менора',
        ':menorah:',
        'Candelabrum',
        'Свічки',
        'Чанукія',
        'Менора',
        'Менора з дев\'ятьма гілками',
        ':purple:'
    ],
    '🔯': [
        'Шестиставкова зірка з крапкою',
        ':dotted_six-pointed_star:',
        ':dotted_six_pointed_star:',
        'Шестизарядна зірка з середнім Дотом',
        ':purple:'
    ],
    '🪯': [
        'Khanda',
        ':khanda:',
        'Sikhism',
        ':purple:'
    ],
    '♈': [
        'Овен',
        ':aries:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♉': [
        'Taurus',
        ':taurus:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♊': [
        'Gemini',
        ':gemini:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♋': [
        'Рак',
        ':cancer:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♌': [
        'Лев',
        ':leo:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♍': [
        'Діва',
        ':virgo:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♎': [
        'Лібра',
        ':libra:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♏': [
        'Скорпіон',
        ':scorpio:',
        ':zodiac:',
        'Скорпіон',
        'Зодіак',
        ':purple:'
    ],
    '♐': [
        'Sagittarius',
        ':sagittarius:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♑': [
        'Козоріг',
        ':capricorn:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♒': [
        'Водолій',
        ':aquarius:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '♓': [
        'Pisces',
        ':pisces:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '⛎': [
        'Змієносця',
        ':ophiuchus:',
        ':zodiac:',
        'Зодіак',
        ':purple:'
    ],
    '⏭️': [
        'Пропустити символ Вперед',
        'Чорний правий прямокутник з вертикальною лінією',
        ':skip_forward_button:',
        'Наступна кнопка маршруту',
        ':blue:'
    ],
    '⏮️': [
        'Пропустити символ назад',
        'Чорний лівий точковий подвійний трикутник з вертикальною рискою',
        ':skip_backward_button:',
        'Кнопка останньої пісні',
        'Попередня композиція',
        ':blue:'
    ],
    '⏯️': [
        'Кнопка паузи',
        'Чорний правий прямокутник з подвійною вертикальною рискою',
        ':play_button:',
        ':pause_button:',
        ':play_or_pause_button:',
        'Символи Грати',
        'Символ паузи',
        ':blue:'
    ],
    '🔀': [
        'Кнопка перемішувати треки',
        ':shuffle_tracks_button:',
        'Скручені стріли',
        ':blue:'
    ],
    '🔁': [
        'Повторення кнопки',
        ':repeat_button:',
        'Символ циклу',
        'Ретвіт',
        'За годинниковою стрілкою та стрілою ліворуч',
        ':blue:'
    ],
    '🔂': [
        'Повторити одну кнопку',
        ':repeat_single_button:',
        'Стріли з номером 1',
        'Повторення символу',
        'Повторіть окремий символ окремого маршруту',
        'За годинниковою стрілкою та стрілою ліворуч з кружкою одним накриттям',
        ':blue:'
    ],
    '▶️': [
        'Кнопка Відтворення',
        ':play_button:',
        'Правий трикутник',
        'Право-пунктирний трикутник',
        'Чорний правий прямокутник',
        ':blue:'
    ],
    '◀️': [
        'Кнопка зворотного виклику',
        ':reverse_button:',
        'Лівий трикутник',
        'Ліво-полярний трикутник',
        'Чорний лівий трикутник',
        ':blue:'
    ],
    '🔼': [
        'Кнопка вгору',
        ':upwards_button:',
        'Вгору Трикутник',
        'Аппайнтинг-трикутник',
        'up-Pointing маленький червоний трикутник',
        ':blue:'
    ],
    '🔽': [
        'Кнопка вниз',
        ':downwards_button:',
        'Нижній трикутник',
        'Великий трикутник',
        'Великий червоний трикутник',
        ':blue:'
    ],
    '⏩': [
        'Швидка кнопка Вперед',
        ':fast-forward_button:',
        ':fast_forward_button:',
        'Перемотати вперед',
        'Символ швидкого переходу',
        'Чорний правий прямокутник опори',
        ':blue:'
    ],
    '⏪': [
        'Fast Reverse Button',
        ':fast_reverse_button:',
        'Rewind',
        'Символ перемотування',
        'Чорний лівий вказівник подвійний трикутник',
        ':blue:'
    ],
    '⏫': [
        'Швидка кнопка Вгору',
        ':fast_up_button:',
        'up-Pointing подвійний трикутник',
        'Чорний прямокутник "Двійковий трикутник"',
        ':blue:'
    ],
    '⏬': [
        'Швидка кнопка вниз',
        ':fast_down_button:',
        'Подвійний трикутник вниз',
        'Чорний униз для розгляду подвійного трикутника',
        ':blue:'
    ],
    '⏹️': [
        'Кнопка Stop Button',
        ':stop_button:',
        'Зупинити',
        'Зупинити символ',
        'Чорний квадрат для Стопа',
        ':blue:'
    ],
    '⏏️': [
        'Кнопка виймання',
        ':eject_button:',
        'Eject Symbol',
        ':blue:'
    ],
    '🎦': [
        'Кінофільм',
        ':cinema_button:',
        'Екран',
        'Фільми',
        'Кінофільм',
        'Символ кінотеатру',
        'Запис',
        ':blue:'
    ],
    '📶': [
        'Антена Барс',
        ':antenna_bars_button:',
        'Бали на повторення',
        'Рівень сигналу',
        'Stairs',
        'Символ підвищеної Сили',
        'Антена з барами',
        ':blue:'
    ],
    '✖️': [
        'Помножити',
        ':multiply:',
        'Разів',
        'Символ множення',
        'Важкий Множення X',
        ':black:'
    ],
    '➕': [
        'Плюс',
        ':plus:',
        'Символ плюс',
        'Знак важкого Plus',
        ':black:'
    ],
    '➖': [
        'Minus',
        ':minus:',
        'Minus Symbol',
        'Знак важкого мінімуму',
        ':black:'
    ],
    '➗': [
        'Розділити',
        ':divide:',
        'Символ дивізіону',
        'Знак важкої дивізія',
        ':black:'
    ],
    '🟰': [
        'Важкий знак рівності',
        ':heavy_equals_sign:',
        'Дорівнює',
        'Результат',
        ':black:'
    ],
    '♾️': [
        'Нескінченність',
        ':infinity:',
        'Постійний паперовий знак'
    ],
    '‼️': [
        'Подвійна позначка виключення',
        ':double_exclamation_mark:',
        'Подвійна позначка червоної оклику',
        ':red:'
    ],
    '⁉️': [
        'Марка питання щодо оклику',
        ':exclamation_question_mark:',
        'Марка червона знака і питання',
        ':red:'
    ],
    '❓': [
        'Марк питання',
        ':question_mark:',
        'Марка червоного питання',
        'Чорне питання і Марк Орнір',
        ':red:'
    ],
    '❔': [
        'Марка Білих питань',
        ':white_question_mark:',
        ':question_mark:',
        'Марка Білих питань',
        'Орнір білих питань',
        ':white:'
    ],
    '❗': [
        'Марка оклику',
        ':exclamation_mark:',
        'Марка червона окликання',
        'Символи знаку Жорсткого Виключення',
        ':red:'
    ],
    '❕': [
        'Марка білої оклику',
        ':white_exclamation_mark:',
        ':exclamation_mark:',
        'Виключення Білих Марків Орнір',
        ':white:'
    ],
    '⭕': [
        'Порожнє червоне коло',
        ':hollow_red_circle:',
        'Коло',
        'Правильно',
        'Червоне коло',
        'Марка',
        'Велике коло',
        ':red:'
    ],
    '☑️': [
        'Прапорець з позначкою',
        ':check_box_with_check:',
        'V',
        'Прапорець',
        'Відмітити у полях',
        'Шафа для балоту з галочкою'
    ],
    '✔️': [
        'Позначка',
        ':check_mark:',
        'V',
        'Перевірити',
        'Відмітити',
        'Checkmark',
        'Марка ваг',
        ':black:'
    ],
    '❌': [
        'Берег',
        ':cross_mark:',
        'Кросс',
        'Ікс',
        ':red:'
    ],
    '✅': [
        'Кнопка позначки',
        ':check_mark_button:',
        'V',
        'Марка зеленого позначки',
        'Зелений Тик',
        'Позначка',
        'Марка Білого Важки',
        ':green:'
    ],
    '❎': [
        'Кнопка перехресного позначки',
        ':cross_mark_button:',
        'Кросс',
        'Ікс',
        'X позначка',
        'Марка негативного квадратного хреста',
        ':green:'
    ],
    '#️⃣': [
        'Знак номера ключа',
        ':hash_key:',
        '#',
        'Хеш ключ',
        'Хештег',
        'Восьминіг',
        'Фунтовий ключ',
        'Числовий знак',
        ':blue:'
    ],
    '*️⃣': [
        'Keycap Asterisk',
        ':asterisk:',
        'Зоряний келих',
        ':blue:'
    ],
    '0️⃣': [
        'Число 0',
        ':number_0:',
        'Keycap Digit Zero'
    ],
    '1️⃣': [
        'Цифра 1',
        ':number_1:',
        'Цифровий номер один'
    ],
    '2️⃣': [
        'Число 2',
        ':number_2:',
        'Ідентифікатор ключа 2'
    ],
    '3️⃣': [
        'Цифра 3',
        ':number_3:',
        'Три ключа цифрового ключа'
    ],
    '4️⃣': [
        'Цифра 4',
        ':number_4:',
        'Цифровий номер чотири'
    ],
    '5️⃣': [
        'Цифра 5',
        ':number_5:',
        'Ключ-цифровий номер п\'ять'
    ],
    '6️⃣': [
        'Номер 6',
        ':number_6:',
        'Ключар Digit шість'
    ],
    '7️⃣': [
        'Число 7',
        ':number_7:',
        'Keycap Digit Seven'
    ],
    '8️⃣': [
        'Цифра 8',
        ':number_8:',
        'Вісім розрядів ключів'
    ],
    '9️⃣': [
        'Число 9',
        ':number_9:',
        'Число цифрового ключа'
    ],
    '🔟': [
        'Номер 10',
        ':number_10:',
        'Keycap: 10',
        '10',
        'Десять ключів'
    ],
    '🔠': [
        'Input Latin Uppercase',
        ':input_latin_uppercase:',
        'АБЛОН',
        'Верхній регістр',
        'Введіть символ для верхнього регістру символів',
        'Вхідний символ для латинських літер',
        ':blue:'
    ],
    '🔡': [
        'Input Latin Lowercase',
        ':input_latin_lowercase:',
        'абкорд',
        'Нижній регістр',
        'Символ вводу для малих літер',
        'Вхідний символ для латинських малих листів',
        ':blue:'
    ],
    '🔢': [
        'Input Numbers',
        ':input_numbers:',
        '1234',
        'Номери',
        'Numeric Input',
        'Введіть символ для цифр',
        ':blue:'
    ],
    '🔣': [
        'Введіть символ для символів',
        ':input_symbols:',
        'Символи',
        'Введення символу',
        ':blue:'
    ],
    '🔤': [
        'Input Latin Letters',
        ':input_latin_letters:',
        'абв',
        'Абетка',
        'Літери',
        'Введіть символ для букв',
        'Введіть символ для латинських літер',
        ':blue:'
    ],
    '🅰️': [
        'Кнопка (тип крові)',
        ':a_blood:',
        'Кров А',
        'Буква А',
        'Негативний квадратний латино-столичний лист А',
        ':red:'
    ],
    '🆎': [
        'AB кнопка (тип крові)',
        ':ab_blood:',
        'Листи В',
        'Тип крові АВ',
        'Негативний квадрат AB',
        ':red:'
    ],
    '🅱️': [
        'Кнопка B (тип крові)',
        ':b_blood:',
        'Буква Б',
        'Кров Б',
        'Негативний квадрат латино-столичного листа Б',
        ':red:'
    ],
    '🆑': [
        'Кнопка CL',
        ':cl_button:',
        'Очистити',
        'Кнопка очищення',
        'Підписка CL',
        'Квадратний CL',
        'Літери CL',
        ':red:'
    ],
    '🆒': [
        'Крута кнопка',
        ':cool_button:',
        'Холодна площа',
        'Класний знак',
        'Холодний квадрат',
        ':blue:'
    ],
    '🆓': [
        'Вільна кнопка',
        ':free_button:',
        'Безкоштовно',
        'Безкоштовний покажчик',
        'Квадратний фрі',
        ':blue:'
    ],
    'ℹ️': [
        'Інформація про нас',
        ':info_button:',
        'Інформація',
        'Малі літери я',
        'Інформація туриста',
        'Джерело інформації',
        ':blue:'
    ],
    '🆔': [
        'Кнопка ID',
        ':id_button:',
        'ІД',
        'Ідентифікація',
        'Ідентифікаційний знак',
        'Квадратний ID',
        ':purple:'
    ],
    '🆕': [
        'Нова кнопка',
        ':new_button:',
        'Новий',
        'Новий вказівник',
        'Розгорнутий новий',
        ':blue:'
    ],
    '🅾️': [
        'Кнопка O (тип крові)',
        ':0_blood:',
        'Група крові О',
        '0',
        'Негативний квадрат латино-столичного листа',
        'Буква О',
        ':red:'
    ],
    '🆗': [
        'Кнопка OK',
        ':ok_button:',
        'ОК',
        'Добре',
        'Квадрат',
        'Підпис',
        'У квадратному обсязі',
        ':blue:'
    ],
    '🅿️': [
        'Кнопка P',
        ':p_button:',
        ':parking_sign:',
        'Знак стоянки',
        'Негативний квадрат латино-столичного листа',
        'Буква P',
        ':blue:'
    ],
    '🆘': [
        'Кнопка SOS',
        ':sos_button:',
        'Сигнальний сигнал',
        'Аварійний',
        'SOS',
        'Підписка SOS',
        'Квадратний SOS',
        'Довідка',
        ':red:'
    ],
    '🆙': [
        'Кнопка вгору!',
        ':up_button:',
        'Підняти рівень',
        'Вгору',
        'Зареєструватися',
        'Зібрано з позначкою оклику',
        ':blue:'
    ],
    '🆚': [
        'Кнопка Vs',
        ':vs_button:',
        'Квадратний Vs',
        ':orange:'
    ],
    '🆖': [
        'NG кнопка',
        ':ng_button:',
        'Квадратний НГ',
        'Немає хорошого підпису',
        'Немає хорошого',
        ':ng:',
        'Блупер',
        ':blue:'
    ],
    '🔴': [
        'Червоне коло',
        ':red_circle:',
        'Велике червоне коло',
        ':red:'
    ],
    '🟠': [
        'Помаранчеве коло',
        ':orange_circle:',
        'Велике Помаранчеве коло',
        ':orange:'
    ],
    '🟡': [
        'Жовте коло',
        ':yellow_circle:',
        'Велике жовте коло',
        ':yellow:'
    ],
    '🟢': [
        'Зелене коло',
        ':green_circle:',
        'Велике зелене коло',
        ':green:'
    ],
    '🔵': [
        'Блакитне коло',
        ':blue_circle:',
        'Велике синє коло',
        ':blue:'
    ],
    '🟣': [
        'Бузкове коло',
        ':purple_circle:',
        'Велике фіолетове коло',
        ':purple:'
    ],
    '🟤': [
        'Коричневе коло',
        ':brown_circle:',
        'Велике коричневе коло',
        ':brown:'
    ],
    '⚫': [
        'Чорне коло',
        ':black_circle:',
        'Середнє чорне коло',
        ':black:'
    ],
    '⚪': [
        'Біле коло',
        ':white_circle:',
        'Середнє біле коло',
        ':white:'
    ],
    '🟥': [
        'Красна площа',
        ':red_square:',
        'Велика Червона площа',
        ':red:'
    ],
    '🟧': [
        'Помаранчева площа',
        ':orange_square:',
        'Велика Помаранчева площа',
        ':orange:'
    ],
    '🟨': [
        'Жовта площа',
        ':yellow_square:',
        'Велика жовта площа',
        ':yellow:'
    ],
    '🟩': [
        'Зелений квадрат',
        ':green_square:',
        'Велика зелена площа',
        ':green:'
    ],
    '🟦': [
        'Синій квадрат',
        ':blue_square:',
        'Велика синя площа',
        ':blue:'
    ],
    '🟪': [
        'Бузкова площа',
        ':purple_square:',
        'Велика фіолетова площа',
        ':purple:'
    ],
    '🟫': [
        'Коричнева площа',
        ':brown_square:',
        'Велика коричнева площа',
        ':brown:'
    ],
    '⬛': [
        'Чорна велика площа',
        ':black_large_square:',
        ':black:'
    ],
    '⬜': [
        'Біла велика площа',
        ':white_large_square:',
        ':white:'
    ],
    '◼️': [
        'Чорний середній квадрат',
        ':black_medium_square:',
        ':black:'
    ],
    '◻️': [
        'Білий середній квадрат',
        ':white_medium_square:',
        ':white:'
    ],
    '◾': [
        'Чорний середній квадрат',
        ':black_medium_small_square:',
        ':black:'
    ],
    '◽': [
        'Біла маленька площа',
        ':white_medium_small_square:',
        ':white:'
    ],
    '▪️': [
        'Чорний малий квадрат',
        ':black_small_square:',
        ':black:'
    ],
    '▫️': [
        'Біла маленька площа',
        ':white_small_square:',
        ':white:'
    ],
    '💠': [
        'Діамантова фігура з крапкою на стороні',
        ':diamond_shape_with_dot:',
        'Різноманітність',
        'Алмазна квітка',
        'Каваї'
    ],
    '🔶': [
        'Великий Помаранчевий Діамант',
        ':large_orange_diamond:',
        ':orange:'
    ],
    '🔷': [
        'Великий синій алмаз',
        ':large_blue_diamond:',
        ':blue:'
    ],
    '🔸': [
        'Маленький оранжевий діамант',
        ':small_orange_diamond:',
        ':orange:'
    ],
    '🔹': [
        'Синій алмаз',
        ':small_blue_diamond:',
        ':blue:'
    ],
    '🔺': [
        'Червоний трикутник угору',
        ':red_triangle_pointed_up:',
        'Верхньополярний червоний трикутник',
        ':red:'
    ],
    '🔻': [
        'Червоний трикутник опустився вниз',
        ':red_triangle_pointed_down:',
        'Донизу належний червоний трикутник',
        ':red:'
    ],
    '🔳': [
        'Кнопка Білого квадрату',
        ':white_square_button:',
        ':white:',
        ':black:'
    ],
    '🔲': [
        'Чорна квадратна кнопка',
        ':black_square_button:',
        ':white:',
        ':black:'
    ],
    '©️': [
        'Авторське право',
        ':copyright:',
        ':c:',
        'Підписка на авторські права'
    ],
    '®️': [
        'Зареєстровано',
        ':registered:',
        ':r:',
        'Зареєструватися'
    ],
    '™️': [
        'Марка угоди',
        ':trade_mark:',
        ':tm:',
        'Торгова марка',
        'Торговий знак'
    ],
    '🛅': [
        'Лівий багаж',
        ':left_luggage:',
        'Сумка з ключем',
        'Заблокована валіза',
        ':blue:'
    ],
    '🛄': [
        'Багажна угода',
        ':baggage_claim:',
        ':blue:'
    ],
    '🛃': [
        'Митниця',
        ':customs:',
        ':blue:'
    ],
    '🛂': [
        'Управління паспортом',
        ':passport_control:',
        'Контроль кордону',
        ':blue:'
    ],
    '🛜': [
        'Wireless',
        ':wireless:',
        ':wifi:',
        ':wi_fi:',
        'Wifi',
        'wi-fi',
        'wireless connection',
        ':blue:'
    ],
    '🚰': [
        'Символ води з можливістю',
        ':potable_water_symbol:',
        'Спрага',
        'Тридцять',
        'Водопровідний кран',
        'Водяний аусет'
    ],
    '🇦': [
        'Буква А',
        ':letter_a:',
        ':a:',
        'Символ-індикатора області А'
    ],
    '🇧': [
        'Буква Б',
        ':letter_b:',
        ':b:',
        'Символ-індикатора області B'
    ],
    '🇨': [
        'Буква C',
        ':letter_c:',
        ':c:',
        'Символ-індикатора області C'
    ],
    '🇩': [
        'Літера D',
        ':letter_d:',
        ':d:',
        'Символ-індикація області D'
    ],
    '🇪': [
        'Буква E',
        ':letter_e:',
        ':e:',
        'Символ-індикатора області E'
    ],
    '🇫': [
        'Буква F',
        ':letter_f:',
        ':f:',
        'Символ-індикатора області F'
    ],
    '🇬': [
        'Буква G',
        ':letter_g:',
        ':g:',
        'Символ-індикація області G'
    ],
    '🇭': [
        'Буква Н',
        ':letter_h:',
        ':h:',
        'Символ-індикатора області H'
    ],
    '🇮': [
        'Лист I',
        ':letter_i:',
        ':i:',
        'Символ-індикація області ІІ'
    ],
    '🇯': [
        'Лист J',
        ':letter_j:',
        ':j:',
        'Символ-індикатора області J'
    ],
    '🇰': [
        'Буква K',
        ':letter_k:',
        ':k:',
        'Символи області вказівника символів K'
    ],
    '🇱': [
        'Літера L',
        ':letter_l:',
        ':l:',
        'Символ-індикатора області L'
    ],
    '🇲': [
        'Буква М',
        ':letter_m:',
        ':m:',
        'Символи символа регіонального індикатора М'
    ],
    '🇳': [
        'Літера N',
        ':letter_n:',
        ':n:',
        'Символ-індикатора області літери N'
    ],
    '🇴': [
        'Буква О',
        ':letter_o:',
        ':o:',
        'Символи-індикатора регіонів'
    ],
    '🇵': [
        'Буква P',
        ':letter_p:',
        ':p:',
        'Символ-індикатора області літери P'
    ],
    '🇶': [
        'Літера Q',
        ':letter_q:',
        ':q:',
        'буква символу області регіону'
    ],
    '🇷': [
        'Буква В',
        ':letter_r:',
        ':r:',
        'Символ-індикація області R символів'
    ],
    '🇸': [
        'Літера S',
        ':letter_s:',
        ':s:',
        'Символ-індикатора області S'
    ],
    '🇹': [
        'Буква Т',
        ':letter_t:',
        ':t:',
        'Символ-індикація області T'
    ],
    '🇺': [
        'Буква U',
        ':letter_u:',
        ':u:',
        'Символ-індикатора області U'
    ],
    '🇻': [
        'Буква V',
        ':letter_v:',
        ':v:',
        'Символ-індикатора області V'
    ],
    '🇼': [
        'Літера W',
        ':letter_w:',
        ':w:',
        'Символ-індикатора області W'
    ],
    '🇽': [
        'Буква X',
        ':letter_x:',
        ':x:',
        'Символ-індикатора області X'
    ],
    '🇾': [
        'Буква Y',
        ':letter_y:',
        ':y:',
        'Символ-індикатора області Y'
    ],
    '🇿': [
        'Буква Z',
        ':letter_z:',
        ':z:',
        'Символ-індикатора області Z'
    ],
    '💌': [
        'Лист від кохання',
        ':love_letter:',
        'Конверт серця',
        'Нотатка кохання'
    ],
    '🚮': [
        'Покладіть Litter в його місце символів',
        ':put_litter_in_bing_sign:',
        'Блискавка в Кошику',
        'Помістіть літер у Кошик',
        'Особа зі смітником'
    ],
    '♿': [
        'Символ коліщатка',
        ':wheelchair_symbol:',
        'Доступ до ванноми'
    ],
    '🚹': [
        'Символ Менса',
        ':mens_symbol:',
        'Символ Менса',
        'Менс Туалет',
        'Чоловіча відлуння',
        'Чоловіча паличка',
        ':blue:'
    ],
    '🚺': [
        'Символ жінок',
        ':womens_symbol:',
        'Символ жінок',
        'Жінки Туалет',
        'Жіночий туалет',
        'Фамале-WC',
        ':purple:',
        ':pink:'
    ],
    '🚻': [
        'Вбиральня',
        ':restroom:',
        'Знак ванної кімнати',
        'Знак Туалету',
        'Знак WC',
        ':blue:'
    ],
    '🚼': [
        'Символи Немовлят',
        ':baby_symbol:',
        'Ремонтна станція',
        'Символи, які змінюють дитину',
        'Дитячі ясла',
        ':orange:'
    ],
    '🚾': [
        'Конслот для води',
        ':wc:',
        'Тиждень',
        'Тойлет WC',
        ':blue:'
    ],
    '⚠️': [
        'Попереджувальний знак',
        ':warning_sign:',
        'Символ сповіщення',
        ':yellow:'
    ],
    '🚸': [
        'Перехрестя дітей',
        ':children_crossing:',
        'Перехрестя дітей',
        'Тривога за школу',
        ':yellow:'
    ],
    '🔅': [
        'Символ низької яскравості',
        ':low_brightness_symbol:',
        'Кнопка затемнення',
        'Зменшити яскравість'
    ],
    '🔆': [
        'Символ високої яскравості',
        ':high_brightness_symbol:',
        'Збільшення яскравості',
        'Яскрава кнопка'
    ],
    '📳': [
        'Режим вібрації',
        ':vibration_mode:',
        'Серце телефону',
        'Беззвучний режим',
        ':orange:'
    ],
    '📴': [
        'Мобільний телефон вимкнено',
        ':mobile_phone_off:',
        ':orange:'
    ],
    '〰️': [
        'Хвиля',
        'Хвилі',
        ':wave:'
    ],
    '💱': [
        'Обмін валют',
        ':currency_exchange:'
    ],
    '💲': [
        'Символ важкого долара',
        ':dollar_symbol:',
        'Долар',
        'Знак долара'
    ],
    '♻️': [
        'Універсальний символ переробки в Чорному стилі',
        ':recycling_symbol:',
        'Символи переробки',
        'Кошик логотип',
        ':green:'
    ],
    '🔱': [
        'Тризубець Емблема',
        ':trident_emblem:',
        'Вила',
        'Тризубець'
    ],
    '📛': [
        'Назвати значок',
        ':name_badge:',
        'Тофу у вогні',
        'Тег імені',
        'Тег вогню'
    ],
    '🔰': [
        'Символ Японії для початківця',
        ':japanese_symbol_beginner:',
        'Шошинша Марк',
        'Жовтий Зелений Щит',
        ':green:',
        ':yellow:'
    ],
    '➰': [
        'Кучерявий цикл',
        ':curly_loop:',
        'Петля Керлінг',
        'Петля'
    ],
    '➿': [
        'Подвійне кучеряве тіло',
        ':double_curly_loop:',
        'Подвійне Петля Керлінг',
        'Голосова пошта'
    ],
    '〽️': [
        'Марка черги запчастини',
        ':part_alternation_mark:',
        'М-ль',
        'Макдональдс'
    ],
    '✳️': [
        'Вісім зіпсований астериськ',
        ':eight_spoked_asterisk:',
        ':green:'
    ],
    '✴️': [
        'Вісім пойнтована чорна зірка',
        ':eight_pointed_star:',
        'Помаранчева зірка',
        'Вісім крихітна зірка',
        ':orange:'
    ],
    '❇️': [
        'Спаркле',
        ':sparkle:',
        ':green:'
    ],
    'Ⓜ️': [
        'Циркли М',
        'Circled Latin Capital літера M',
        ':circled_m:',
        'Метро',
        ':blue:'
    ],
    '🈁': [
        'Тут знак японського слова',
        'Squared Katakana Koko',
        ':japanese_here:',
        'Тут',
        'Пункт призначення',
        ':blue:'
    ],
    '🈂️': [
        'Японський підпис має значення служби або досвід обслуговування',
        'Squared Katakana Sa',
        ':japanese_service:',
        ':blue:'
    ],
    '🈷️': [
        'Щомісячна сума японського жесту',
        'Уніфікований ієрогліфічний ідеограм-6708',
        ':japanese_monthly_amouny:',
        'Ключ 74',
        '月',
        ':orange:'
    ],
    '🈶': [
        'Японський знак означає не Безкоштовне заряджання',
        'Уніфікований ієрогліфічний ідеогра-6709',
        ':japanese_own:',
        'Власні',
        '有',
        ':orange:'
    ],
    '🈯': [
        'Японський знак',
        'Уніфікований ієрогліфічний ідеогра-6307',
        ':japanese_reserved:',
        'Відбиток пальця',
        '指',
        ':green:'
    ],
    '🉐': [
        'Договірний знак Японії',
        'Перевага Circled Ideograph',
        ':japanese_acquire:',
        'Придбання',
        '得',
        ':red:'
    ],
    '🈹': [
        'Знижка за японськими підписами',
        'Уніфікований ієрогліфічний ідеограм-5272 квадрат',
        ':japanese_discount:',
        'Розпродаж Баргеніну',
        '割',
        ':red:'
    ],
    '🈚': [
        'Японський знак означає вільний від Заряду',
        'Об\'єднаний ієрогліфічний ідеограм-7121 квадрат',
        ':japanese_lacking:',
        'Бракінг',
        '無',
        ':orange:'
    ],
    '🈲': [
        'Заборонено японський підпис',
        'Квадратний ієрогліфічний ідеограм-7981',
        ':japanese_prohibited:',
        'Forbid',
        '禁',
        ':red:'
    ],
    '🉑': [
        'Японський підпис має прийнятний',
        'Прийняти Circled Ideograph',
        ':japanese_accept:',
        'Прийняти',
        ':orange:'
    ],
    '🈸': [
        'Японська заявка на підпис',
        'Уніфікований ієрогліфічний ідеограм-7533',
        ':japanese_application_form:',
        'Форма додатку',
        'Мавпа',
        'Замовити',
        '申',
        ':orange:'
    ],
    '🈴': [
        'Свята князівства японських підписів (краде)',
        'Уніфікований ієрогліфічний ідеограм-5408',
        ':japanese_agreement:',
        'Угода',
        '合',
        ':red:'
    ],
    '🈳': [
        'Японська синознавство',
        'Квадратний ієрогліфічний ідеограм-7a7a',
        ':japanese_available:',
        'Порожній і доступний',
        '空',
        ':blue:'
    ],
    '㊗️': [
        'Вітаємо з японським підписом',
        'Вітання на тілу ідеографа',
        ':japanese_congratulations:',
        ':red:'
    ],
    '㊙️': [
        'Секрет Circled Ideograph',
        ':japanese_secret:',
        'Японський знак',
        'Секрет',
        ':red:'
    ],
    '🈺': [
        'Японські підписи мають на значення для бізнесу',
        'Об\'єднаний ієрогліфічний ідеограм-55b6 квадрат',
        ':japanese_open_for_business:',
        'Праця',
        '営',
        ':orange:'
    ],
    '🈵': [
        'Японський вказівник має значення повністю, без особливості',
        'Уніфікований ієрогліфічний ідеограм-6e80',
        ':japanese_full:',
        'Повна',
        '満',
        ':red:'
    ],
    '🔘': [
        'Перемикач',
        ':radio_button:'
    ],
    '🛑': [
        'Зупинити покажчик',
        ':stop_sign:',
        'Октагональний знак',
        ':red:'
    ],
    '⚕️': [
        'Знак аптечки',
        ':medical_symbol:',
        'Ескулапій',
        'Asklepios',
        'Посох Асклепійський',
        'Штаб Ескулапійський'
    ],
    '🛗': [
        'Ліфт',
        ':elevator:',
        ':lift:',
        'Ліфт'
    ],
    '⚧️': [
        'Символ трансгендеру',
        ':transgender_sign:'
    ],
    '♂️': [
        'Чоловічий знак',
        ':male_sign:',
        'Символ людини',
        'Марсове поле'
    ],
    '♀️': [
        'Жіноча табличка',
        ':female_sign:',
        'Символ жінки',
        'Venus Symbol'
    ]
};
/*food and drinks*/
emojis_language[lang][6] = {
    '🍇': [
        'Виноград',
        ':grapes:',
        'Виноград',
        ':purple:'
    ],
    '🍈': [
        'Диня',
        ':melon:',
        'Cantaloupe',
        'Медовий',
        'Диня'
    ],
    '🍉': [
        'Кавун',
        ':watermelon:',
        ':red:'
    ],
    '🍊': [
        'Tangerine',
        ':tangerine:',
        'Mandarin',
        ':orange:'
    ],
    '🍋': [
        'Лимон',
        ':lemon:',
        'Лимонад',
        ':yellow:'
    ],
    '🍌': [
        'Банан',
        ':banana:',
        'Плантан',
        ':yellow:'
    ],
    '🍍': [
        'Ананас',
        ':pineapple:'
    ],
    '🥭': [
        'Mango',
        ':mango:'
    ],
    '🍎': [
        'Червоне яблуко',
        ':red_apple:',
        ':apple:',
        'Червоне смачне яблуко',
        ':red:'
    ],
    '🍏': [
        'Зелене яблуко',
        ':green_apple:',
        ':apple:',
        'Золоте смачне яблуко',
        'Гренні Сміт Егл',
        ':green:'
    ],
    '🍐': [
        'Груша',
        ':pear:'
    ],
    '🍑': [
        'Персик',
        ':peach:',
        'Униз',
        'Піпа',
        ':orange:',
        ':pink:'
    ],
    '🍒': [
        'Вишні',
        ':cherry:',
        'Вишня',
        'Дика вишня',
        ':red:'
    ],
    '🍓': [
        'Полуничний',
        ':strawberry:',
        ':red:'
    ],
    '🥝': [
        'Фрукт Ківі',
        ':kiwi:',
        'Атерина китайська',
        'Ківі',
        'Ківі',
        ':green:'
    ],
    '🍅': [
        'Помідор',
        ':tomato:',
        ':red:'
    ],
    '🥥': [
        'Кокосова пальма',
        ':coconut:',
        'Cocoanut'
    ],
    '🥑': [
        'Авокадо',
        ':avocado:',
        ':green:'
    ],
    '🍆': [
        'Баклажан',
        ':eggplant:',
        ':aubergine:',
        'Aubergine',
        'Фалік',
        'Фіолетовий овочевий',
        ':purple:'
    ],
    '🥔': [
        'Картопля',
        ':potato:',
        'Запечена картопля',
        'Картопля Айдахо'
    ],
    '🥕': [
        'Морква',
        ':carrot:',
        ':orange:'
    ],
    '🌽': [
        'Вуха кукурудзи',
        ':ear_of_corn:',
        'Кукурудза',
        'Кукурудза у кабіні',
        'Кукурудза',
        'Вухо кукурудзи'
    ],
    '🌶️': [
        'Гарячий перець',
        ':hot_pepper:',
        'Чилі Пеппер',
        'Пряний',
        ':red:'
    ],
    '🥒': [
        'Огірок',
        ':cucumber:',
        'Геркін',
        'Пікл',
        ':green:'
    ],
    '🥬': [
        'Ліфі Грін',
        ':leafy_green:',
        'Бок Чой',
        'Китайська капуста',
        'Cos Lettuce',
        'Ромен Леттукюс',
        'Листя зелені',
        ':green:'
    ],
    '🥦': [
        'Броколі',
        ':broccoli:',
        ':green:'
    ],
    '🍋‍🟩': [
        'Lime',
        ':lime:',
        ':green:'
    ],
    '🍄': [
        'Гриб',
        ':mushroom:',
        'Гриб',
        'Toadstool'
    ],
    '🍄‍🟫': [
        'Brown Mushroom',
        ':brown_mushroom:',
        'Mushroom',
        'Shroom',
        'Toadstool',
        ':brown:'
    ],
    '🥜': [
        'Peanuts',
        ':peanuts:',
        'Божевільні',
        ':brown:'
    ],
    '🌰': [
        'Каштан',
        ':chestnut:',
        'Жолудь',
        'Нут',
        ':brown:'
    ],
    '🍞': [
        'Хліб',
        ':bread:',
        'колос хліба',
        ':brown:'
    ],
    '🥐': [
        'Croissant',
        ':croissant:',
        ':brown:'
    ],
    '🥖': [
        'Хліб балети',
        ':baguette_bread:',
        'Французький хліб',
        'Багет',
        ':brown:'
    ],
    '🥨': [
        'Pretzel',
        ':pretzel:',
        ':brown:'
    ],
    '🥯': [
        'Бублик',
        ':bagel:',
        ':brown:'
    ],
    '🥞': [
        'Млинці',
        ':pancakes:',
        'Крепес',
        'Хоткеси',
        ':yellow:'
    ],
    '🧀': [
        'Сир -Клин',
        ':cheese_wedge:',
        'Сир',
        ':yellow:'
    ],
    '🍖': [
        'М\'ясо на кістці',
        ':meat_on_bone:',
        'BBQ',
        'Барбекю',
        'Манга',
        ':red:'
    ],
    '🍗': [
        'Poultry Leg',
        ':poultry_leg:',
        'Барабанний',
        'Турецька нога',
        ':red:'
    ],
    '🥩': [
        'Вирізана кількість м\'яса',
        ':cut_of_meat:',
        'М\'ясо',
        'Стейк',
        ':red:'
    ],
    '🥓': [
        'Бекон',
        ':bacon:',
        'Rashers',
        ':red:'
    ],
    '🍔': [
        'Гамбургер',
        ':hamburger:',
        'Бургер',
        'Чизбургер'
    ],
    '🍟': [
        'Французька (Фріс)',
        ':french_fries:',
        'Чіп',
        'Фріс',
        'Макдональд Фріс',
        ':yellow:'
    ],
    '🍕': [
        'Піца',
        ':pizza:',
        'Пепероні Піцца',
        'Шматок Піци',
        ':red:'
    ],
    '🌭': [
        'Хот-пес',
        ':hot_dog:',
        'Хотдог',
        'Ковбаса',
        ':red:'
    ],
    '🥪': [
        'Сандвіч',
        ':sandwich:'
    ],
    '🌮': [
        'Тако',
        ':taco:'
    ],
    '🌯': [
        'Burrito',
        ':burrito:',
        'Перенос'
    ],
    '🥙': [
        'Гарматний хліб',
        ':stuffed_flatbread:',
        'Doner Kebab',
        'Gyro',
        'Шаурма',
        'Піта Сандвіч'
    ],
    '🍳': [
        'Кулінарія',
        ':cooking:',
        'Сніданок',
        'Смажене Яйце',
        'Засмаження панорами'
    ],
    '🥘': [
        'Мілководдя',
        ':shallow_pan_of_food:',
        'Paella',
        'Пан з їжі'
    ],
    '🍲': [
        'Їжа горщика',
        ':pot_of_food:',
        'Вежа з їжі',
        'Суп',
        'Стью'
    ],
    '🥣': [
        'Миска з лопатою',
        ':bowl_with_spoon:',
        'Цереал'
    ],
    '🥗': [
        'Зелений салат',
        ':green_salad:',
        'Салат',
        ':green:'
    ],
    '🍿': [
        'Попкорн',
        ':popcorn:',
        'Зринаюча кукурудза'
    ],
    '🧂': [
        'Сіль',
        ':salt:',
        'Солт Шакер',
        ':white:'
    ],
    '🥫': [
        'Консервовані продукти',
        ':canned_food:',
        'Банка їжі',
        'Бляшана',
        'Примма їжа'
    ],
    '🍱': [
        'Бенто Бокс',
        ':bento_box:',
        'Ланч'
    ],
    '🍘': [
        'Райс Крекер',
        ':rice_cracker:',
        'Крекер'
    ],
    '🍙': [
        'Рисова куля',
        ':rice_ball:',
        'Onigiri'
    ],
    '🍚': [
        'Приготований рис',
        ':cooked_rice:',
        'Вараний Райс',
        'Рис',
        'Боул Риса',
        'Вкрастимий рис'
    ],
    '🍛': [
        'Карі Райс',
        ':curry_rice:',
        'Карі',
        'Індійська корм',
        'Карі та Райс'
    ],
    '🍜': [
        'Паруючий м\'яч',
        ':steaming_bowl:',
        'Нудлес',
        'Локшина з паличками',
        'Рамен'
    ],
    '🍝': [
        'Spaghetti',
        ':spaghetti:',
        'Паста'
    ],
    '🍠': [
        'Висмажена солодка картопля',
        ':roasted_sweet_potato:',
        'Солодка картопля',
        'Ям'
    ],
    '🍢': [
        'Оден',
        ':oden:',
        'Kebab',
        'Лінійний удар'
    ],
    '🍣': [
        'Суші',
        ':sushi:',
        'Sashimi',
        'Морепродукти',
        ':pink:'
    ],
    '🍤': [
        'Смажені креветки',
        ':fried_shrimp:',
        'Смажений труб',
        'Шрімп Темпура'
    ],
    '🍥': [
        'Риб\'ячий пиріжок зі швейною',
        ':fish_cake_with_swirl:',
        'Вудка',
        'Pink Swirl'
    ],
    '🥮': [
        'Місячний Пиріг',
        ':moon_cake:',
        'Місячне Тістечко'
    ],
    '🍡': [
        'Dango',
        ':dango:',
        'Десерт Стік',
        'Рожеві білі зелені кулі'
    ],
    '🥟': [
        'Галушка',
        ':dumpling:',
        'Empanada',
        'Pierogi'
    ],
    '🥠': [
        'Печиво Фортуни',
        ':fortune_cookie:'
    ],
    '🥡': [
        'Коробка Takeout',
        ':takeout_box:',
        'Китайська кухня',
        'Oyster Pail'
    ],
    '🍦': [
        'М\'яке морозиво',
        ':soft_ice_cream:',
        'Пан Віппі',
        'М\'який сертифік'
    ],
    '🍧': [
        'Струрений лід',
        ':shaved_ice:',
        'Сніговий конус'
    ],
    '🍨': [
        'Морозиво',
        ':ice_cream:',
        'Боул льодовикового крему',
        'Десерт'
    ],
    '🍩': [
        'Пончик',
        ':doughnut:',
        'Donut'
    ],
    '🍪': [
        'Печиво',
        ':cookie:',
        'Бісквіт',
        'Шоколадний чіп Печиво',
        ':brown:'
    ],
    '🎂': [
        'Торт до Дня Народження',
        ':birthday_cake:',
        'День народження',
        'Торт',
        'Торт із свічками'
    ],
    '🍰': [
        'Короткий торт',
        ':shortcake:',
        'Торт',
        'Торт',
        'Полуничний Короткий торт'
    ],
    '🧁': [
        'Капкейк',
        ':cupcake:',
        'Печівний торт'
    ],
    '🥧': [
        'Пиріг',
        ':pie:'
    ],
    '🍫': [
        'Шоколадний батончик',
        ':chocolate_bar:',
        'Батончик',
        'Шоколад',
        ':brown:'
    ],
    '🍬': [
        'Цукерки',
        ':candy:',
        'Лоллі',
        'Солодкий'
    ],
    '🍭': [
        'Льодяник',
        ':lollipop:',
        'Роззява'
    ],
    '🍮': [
        'Дрохвові',
        ':custard:',
        'Creme Caramel',
        'Десерт',
        'Флан',
        'Пудинг'
    ],
    '🍯': [
        'Мед Пот',
        ':honey_pot:',
        'Мед',
        'Горщик',
        ':yellow:'
    ],
    '🍼': [
        'Пляшка',
        ':baby_bottle:',
        'Пляшкова постановка'
    ],
    '🥛': [
        'Скло молока',
        ':glass_of_milk:',
        'Молоко',
        ':white:'
    ],
    '☕': [
        'Гарячий джекер',
        ':hot_beverage:',
        'Кава',
        'Espresso',
        'Гарячий шоколад',
        'Чай'
    ],
    '🍵': [
        'Без обробки',
        ':green_tea:',
        'Зелений чай',
        'Matcha',
        'Матча Зелена',
        ':green:'
    ],
    '🍶': [
        'Sake',
        ':sake:',
        'Пляшка',
        'Рисова вино',
        'Кубок Сакка і пляшки'
    ],
    '🍾': [
        'Пляшка з корком',
        ':champagne:',
        'Святкування',
        'Champagne',
        'Вино з гострі'
    ],
    '🍷': [
        'Вино',
        ':wine_glass:',
        'Алкоголь',
        'Червоне Вино',
        'Вино'
    ],
    '🍸': [
        'Коктейльне скло',
        ':cocktail_glass:',
        'Коктейль',
        'Мартіні'
    ],
    '🍹': [
        'Тропічний напій',
        ':tropical_drink:',
        'Фруктовий удар',
        'Тікі Пийте'
    ],
    '🍺': [
        'Пивний мул',
        ':beer_mug:',
        'Пиво',
        'Пиво Штайн',
        ':yellow:'
    ],
    '🍻': [
        'Клінкінг Бір Мугс',
        ':clinking_beer_mugs:',
        'Пиво',
        'Ура'
    ],
    '🥂': [
        'Клінкінг Гласс',
        ':clinking_glasses:',
        'Святкування',
        'Шампанське Гласс',
        'Ура'
    ],
    '🥃': [
        'Скло тамблера',
        ':tumbler_glass:',
        'Бурбон',
        'Лікер',
        'Rum',
        'Віскі',
        'Whisky'
    ],
    '🥤': [
        'Кубок з соломою',
        ':cup_with_straw:',
        'Молочний коктейль',
        'Смузі',
        'Сода Поп',
        'М\'який напій'
    ],
    '🥢': [
        'Палички для їжі',
        ':chopsticks:'
    ],
    '🍽️': [
        'Форк-ніж із пластиною',
        ':fork_and_knife_with_plate:',
        'Обід',
        ':white:',
        ':gray:',
        ':grey:'
    ],
    '🍴': [
        'Дика та нож',
        ':fork_and_knife:',
        'Столові прибори',
        'Ніж і форк',
        'Срібний посуд',
        ':gray:',
        ':grey:'
    ],
    '🥄': [
        'Ложиця',
        ':spoon:',
        ':gray:',
        ':grey:'
    ],
    '🧄': [
        'Часник',
        ':garlic:'
    ],
    '🧅': [
        'Цибуля',
        ':onion:'
    ],
    '🧇': [
        'Waffle',
        ':waffle:'
    ],
    '🧆': [
        'Falafel',
        ':falafel:'
    ],
    '🧈': [
        'Масло',
        ':butter:'
    ],
    '🦪': [
        'Устриця',
        ':oyster:'
    ],
    '🧃': [
        'Розсіяна коробка',
        ':beverage_box:',
        'Жук-сік'
    ],
    '🧉': [
        'Матовий напой',
        ':mate_drink:',
        'ЧимарраВсе',
        'Cimarrón',
        'Єрба Мате'
    ],
    '🫒': [
        'Оливковий',
        ':olive:',
        ':green:'
    ],
    '🫐': [
        'Чорниця',
        ':blueberries:',
        ':blue:'
    ],
    '🫑': [
        'Белл Пеппер',
        ':bell_pepper:',
        ':green:'
    ],
    '🫓': [
        'Корж',
        ':flatbread:'
    ],
    '🫔': [
        'Тамале',
        ':tamale:',
        'Тамал'
    ],
    '🫕': [
        'Fondue',
        ':fondue:'
    ],
    '🧋': [
        'Чай Булька',
        ':boba:',
        'Boba'
    ],
    '🧊': [
        'Кубик льоду',
        ':ice_cube:'
    ],
    '🫘': [
        'Боби',
        'Flatulence',
        ':beans:',
        'Кавові боби',
        'Spill the beans'
    ],
    '🫗': [
        'Похмурий Liquid',
        ':puring_liquid:',
        'Духовний напій',
        'Вода'
    ]
};
/*flags*/
emojis_language[lang][7] = {
    '🏁': [
        'Замок в Чейвері',
        ':chequered_flag:',
        'Стяг',
        'Дівчина з ґратки',
        'Гоночний прапор',
        ':black:',
        ':white:'
    ],
    '🚩': [
        'Трикутний стяг',
        ':triangular_flag:',
        'Прапор на полі',
        'Червоний прапор',
        'Трикутний прапор повідомлення',
        ':red:'
    ],
    '🎌': [
        'Перехресні прапори',
        ':crossed_flags:',
        'Два прапори'
    ],
    '🏴': [
        'Чорний прапор',
        ':black_flag:',
        'Чорний прапор',
        ':black:'
    ],
    '🏳️': [
        'Білий прапор',
        ':white_flag:',
        'Білий прапор',
        ':white:'
    ],
    '🏳️‍🌈': [
        'Веселковий стяг',
        ':rainbow_flag:',
        'Pride Flag',
        'ЛГБТ',
        'ЛГБТЯ+',
        'Гей',
        'Трансгендерність',
        'Lesbian',
        'Асексуал',
        'Queer'
    ],
    '🏳️‍⚧️': [
        'Прапор трансгендеру',
        ':transgender_flag:',
        'Синій, рожевий та білий прапор',
        'Транс-прапор',
        'Blue',
        'Pink'
    ],
    '🏴‍☠️': [
        'Піратський прапор',
        ':pirate_flag:',
        'Веселий Роджер',
        ':black:',
        'Corsair',
        'Privateer',
        'Buccaneer'
    ],
    '🇺🇳': [
        'Прапор Організації Об\'єднаних Націй',
        ':un:',
        'Прапор: Організація'
    ],
    '🇪🇺': [
        'Прапор Європейського Союзу',
        ':eu:',
        'Прапор: Європейський Союз',
        'EU Flag'
    ],
    '🇦🇨': [
        'Прапор острова Вознесіння',
        ':ac:'
    ],
    '🇦🇩': [
        'Прапор Андорри',
        ':ad:',
        'Andorran Flag'
    ],
    '🇦🇪': [
        'Прапор Об\'єднаних Арабських Еміратів',
        ':ae:',
        'Emirati Flag',
        'Флаг ОАЕ'
    ],
    '🇦🇫': [
        'Прапор Афганістану',
        ':af:',
        'Afghan Flag'
    ],
    '🇦🇬': [
        'Прапор Антигуа і Барбуди',
        ':ag:'
    ],
    '🇦🇮': [
        'Прапор Ангільї',
        ':ai:',
        'Стяг Ангілли'
    ],
    '🇦🇱': [
        'Прапор Албанії',
        ':al:',
        'Албанський прапор'
    ],
    '🇦🇲': [
        'Прапор Вірменії',
        ':am:',
        'Прапор Вірменії'
    ],
    '🇦🇴': [
        'Прапор Анголи',
        ':ao:',
        'Ангольський прапор'
    ],
    '🇦🇶': [
        'Прапор Антарктиди',
        ':aq:',
        'Антарктичний прапор'
    ],
    '🇦🇷': [
        'Прапор Аргентини',
        ':ar:',
        'Прапор Аргентини'
    ],
    '🇦🇸': [
        'Прапор Американського Самоа',
        ':as:',
        'American Samoan Flag'
    ],
    '🇦🇹': [
        'Прапор Австрії',
        ':at:',
        'Austrian Flag'
    ],
    '🇦🇺': [
        'Прапор Австралії',
        ':au:',
        'Стяг Оссі',
        'Австралійський прапор'
    ],
    '🇦🇼': [
        'Прапор Аруби',
        ':aw:',
        'Стяг Аруби'
    ],
    '🇦🇽': [
        'Прапор Аль Островів',
        ':ax:',
        'Стяг Ал'
    ],
    '🇦🇿': [
        'Прапор Азербайджану',
        ':az:',
        'Азербайджанський прапор'
    ],
    '🇧🇦': [
        'Прапор Боснії і Герцеговини',
        ':ba:'
    ],
    '🇧🇧': [
        'Прапор Барбадосу',
        ':bb:',
        'Стяг Барбадоу',
        'Прапорець Баяна'
    ],
    '🇧🇩': [
        'Прапор Бангладеш',
        ':bd:',
        'Bangladeshi Flag'
    ],
    '🇧🇪': [
        'Прапор Бельгії',
        ':be:',
        'Стяг Бельгії'
    ],
    '🇧🇫': [
        'Прапор Буркіна-Фасо',
        ':bf:',
        'Прапор Буркінабе'
    ],
    '🇧🇬': [
        'Прапор Болгарії',
        ':bg:',
        'Болгарський прапор'
    ],
    '🇧🇭': [
        'Прапор Бахрейну',
        ':bh:',
        'Стяг Барані',
        'Бахрейнський прапор'
    ],
    '🇧🇮': [
        'Прапор Бурунді',
        ':bi:',
        'Burundian Flag'
    ],
    '🇧🇯': [
        'Прапор Беніну',
        ':bj:',
        'Бенійський прапор'
    ],
    '🇧🇱': [
        'Прапор Святого Бартеаретелеми',
        ':bl:',
        'Прапор: Сен-Бартепосулемі'
    ],
    '🇧🇲': [
        'Прапор Бермудських Островів',
        ':bm:',
        'Bermudan Flag'
    ],
    '🇧🇳': [
        'Прапор Брунею',
        ':bn:',
        'Стяг Брунея'
    ],
    '🇧🇴': [
        'Прапор Болівії',
        ':bo:',
        'Bolivian Flag'
    ],
    '🇧🇶': [
        'Прапор Карибських Нідерландів',
        ':bq:',
        'Bonaire'
    ],
    '🇧🇷': [
        'Прапор Бразилії',
        ':br:',
        'Бразильський прапор'
    ],
    '🇧🇸': [
        'Прапор Багамських Островів',
        ':bs:',
        'Багамський прапор'
    ],
    '🇧🇹': [
        'Прапор Бутану',
        ':bt:',
        'Бутанський прапор'
    ],
    '🇧🇻': [
        'Прапор Острова Буве',
        ':bv:',
        'Мітка: Буве острів'
    ],
    '🇧🇼': [
        'Прапор Ботсвани',
        ':bw:',
        'Batswana Flag'
    ],
    '🇧🇾': [
        'Прапор Білорусі',
        ':by:',
        'Прапор Білорусі'
    ],
    '🇧🇿': [
        'Прапор Белізу',
        ':bz:',
        'Стяг Белізея'
    ],
    '🇨🇦': [
        'Прапор Канади',
        'Канадський прапор',
        ':ca:'
    ],
    '🇨🇨': [
        'Прапор Кокосових (Кілінг) островів',
        ':cc:'
    ],
    '🇨🇩': [
        'Flag of Congo - Kinshasa',
        ':cd:'
    ],
    '🇨🇫': [
        'Прапор Центральноафриканської Республіки',
        ':cf:',
        'Центральноафриканський прапор'
    ],
    '🇨🇬': [
        'Прапор Конго — Браззавіль',
        ':cg:'
    ],
    '🇨🇭': [
        'Прапор Швейцарії',
        ':ch:',
        'Червоний хрест',
        'Швейцарський прапор'
    ],
    '🇨🇮': [
        'Прапор Кот-д\'Івуару',
        ':ci:',
        'Flag: Côte d’Ivoire'
    ],
    '🇨🇰': [
        'Прапор Островів Кука',
        ':ck:',
        'Прапор Островів Кука'
    ],
    '🇨🇱': [
        'Прапор Чилі',
        ':cl:',
        'Прапорець Чилі'
    ],
    '🇨🇲': [
        'Прапор Камеруну',
        ':cm:',
        'Стяг Камерунів'
    ],
    '🇨🇳': [
        'Прапор КНР',
        ':cn:',
        'Китайський прапор'
    ],
    '🇨🇴': [
        'Прапор Колумбії',
        ':co:',
        'Стяг Колумбії'
    ],
    '🇨🇵': [
        'Прапор Острова Кліппертон',
        ':cp:',
        'Прапор: Острів Кліппертон'
    ],
    '🇨🇷': [
        'Прапор Коста-Рики',
        ':cr:',
        'Флаг Костарикана'
    ],
    '🇨🇺': [
        'Прапор Куби',
        ':cu:',
        'Кубинський прапор'
    ],
    '🇨🇻': [
        'Прапор Кабо-Верде',
        ':cv:',
        'Прапор Кабо-Вердіану'
    ],
    '🇨🇼': [
        'Прапор Кюракао',
        ':cw:',
        'Curaçaoan Flag'
    ],
    '🇨🇽': [
        'Прапор Острова Різдва',
        ':cx:',
        'Острів різдва'
    ],
    '🇨🇾': [
        'Прапор Кіпру',
        ':cy:',
        'Прапор Кіпру'
    ],
    '🇨🇿': [
        'Прапор Чехії',
        ':cz:',
        'Чеський прапор'
    ],
    '🇩🇪': [
        'Прапор Німеччини',
        ':de:',
        'Німецький прапор',
        'Німецький прапор'
    ],
    '🇩🇬': [
        'Прапор Дієгогарсії',
        ':dg:',
        'Прапор: Дієго Гарсія'
    ],
    '🇩🇯': [
        'Прапор Джибуті',
        ':dj:',
        'Djibouti Flag',
        'Djiboutian Flag'
    ],
    '🇩🇰': [
        'Прапор Данії',
        ':dk:',
        'Данський прапор'
    ],
    '🇩🇲': [
        'Прапор Домініки',
        ':dm:'
    ],
    '🇩🇴': [
        'Прапор Домініканської Республіки',
        ':do:',
        'Прапорець Dom Rep',
        'Стяг Домінікану'
    ],
    '🇩🇿': [
        'Прапор Алжиру',
        ':dz:',
        'Algerian Flag'
    ],
    '🇪🇦': [
        'Прапор Сеути і Мелільї',
        ':ea:',
        'Прапор Мелільї',
        'Прапор Сеути',
        'Flag: Ceuta & Melilla'
    ],
    '🇪🇨': [
        'Прапор Еквадору',
        ':ec:',
        'Ecuadorian Flag'
    ],
    '🇪🇪': [
        'Прапор Естонії',
        ':ee:',
        'Естонський прапор'
    ],
    '🇪🇬': [
        'Прапор Єгипту',
        ':eg:',
        'Єгипетський прапор'
    ],
    '🇪🇭': [
        'Прапор Західної Сахари',
        ':eh:',
        'Західний прапор Сахари'
    ],
    '🇪🇷': [
        'Прапор Еритреї',
        ':er:',
        'Eritrean Flag'
    ],
    '🇪🇹': [
        'Прапор Ефіопії',
        ':et:',
        'Ethiopian Flag'
    ],
    '🇪🇸': [
        'Прапор Іспанії',
        ':es:',
        'Іспанський прапор'
    ],
    '🇫🇮': [
        'Прапор Фінляндії',
        ':fi:',
        'Фінський прапор'
    ],
    '🇫🇯': [
        'Прапор Фіджі',
        ':fj:',
        'Fijian Flag'
    ],
    '🇫🇰': [
        'Прапор Фолклендських Островів',
        ':fk:',
        'Фолклендерський прапор'
    ],
    '🇫🇲': [
        'Прапор Мікронезії',
        ':fm:',
        'Прапор Мікронезії'
    ],
    '🇫🇴': [
        'Прапор Фарерських островів',
        ':fo:',
        'Faroe Islander Flag'
    ],
    '🇫🇷': [
        'Прапор Франції',
        ':fr:',
        'Французький прапор'
    ],
    '🇬🇦': [
        'Прапор Габону',
        ':ga:',
        'Габонський прапор'
    ],
    '🇬🇧': [
        'Прапор Великої Британії',
        ':gb:',
        'Британський прапор',
        'Велика Британія',
        'Юніон Джек',
        'Великобританія'
    ],
    '🏴󠁧󠁢󠁥󠁮󠁧󠁿': [
        'Flag of England',
        ':england:',
        'St Georges Cross',
        'English Flag'
    ],
    '🏴󠁧󠁢󠁷󠁬󠁳󠁿': [
        'Flag of Wales',
        ':wales:',
        'Welsh Flag',
        'Red Dragon',
        'Baner Cymru',
        'Y Ddraig Goch'
    ],
    '🏴󠁧󠁢󠁳󠁣󠁴󠁿': [
        'Flag of Scotland',
        ':scotland:',
        'Scottish Flag',
        'St Andrews Cross',
        'Saltire'
    ],
    '🇬🇩': [
        'Прапор Гренади',
        ':gd:',
        'Флаг Гренади'
    ],
    '🇬🇪': [
        'Прапор Грузії',
        ':ge:',
        'Стяг Грузії'
    ],
    '🇬🇫': [
        'Прапор Французької Гвіани',
        ':gf:',
        'Прапор Французької Гвінеї'
    ],
    '🇬🇬': [
        'Прапор Гернсі',
        ':gg:',
        'Guernsey Flag'
    ],
    '🇬🇭': [
        'Прапор Гани',
        ':gh:',
        'Ганський прапор'
    ],
    '🇬🇮': [
        'Прапор Гібралтару',
        ':gi:',
        'Гібралтаріанський прапор'
    ],
    '🇬🇱': [
        'Прапор Ґренландії',
        ':gl:',
        'Greenlandic Flag'
    ],
    '🇬🇲': [
        'Прапор Гамбії',
        ':gm:',
        'Gambian Flag'
    ],
    '🇬🇳': [
        'Прапор Гвінеї',
        ':gn:',
        'Guinean Flag'
    ],
    '🇬🇵': [
        'Прапор Гваделупи',
        ':gp:',
        'Стяг Гваделупіана'
    ],
    '🇬🇶': [
        'Прапор Екваторіальної Гвінеї',
        ':gq:',
        'Equatorial Guinean Flag',
        'Екватогвінейський прапор'
    ],
    '🇬🇷': [
        'Прапор Греції',
        ':gr:',
        'Грецький прапор'
    ],
    '🇬🇸': [
        'Прапор Південної Джорджії та Південних Сандвічевих Островів',
        ':gs:'
    ],
    '🇬🇹': [
        'Прапор Гватемали',
        ':gt:',
        'Guatemalan Flag'
    ],
    '🇬🇺': [
        'Прапор Гуаму',
        ':gu:',
        'Гуаманський прапор',
        'Прапор Чаморо'
    ],
    '🇬🇼': [
        'Прапор Гвінеї-Бісау',
        ':gw:',
        'Guinea-Bissau Flag'
    ],
    '🇬🇾': [
        'Прапор Гаяни',
        ':gy:',
        'Прапор Гаянси'
    ],
    '🇭🇰': [
        'Прапор Гонконгу SAR Китаю',
        ':hk:',
        'Стяг Гонконгу'
    ],
    '🇭🇲': [
        'Прапор Островів Херд і Макдональд',
        ':hm:',
        'Прапор: Острови Херд і Макдональд'
    ],
    '🇭🇳': [
        'Прапор Гондурасу',
        ':hn:',
        'Стяг Гондурасу'
    ],
    '🇭🇷': [
        'Прапор Хорватії',
        ':hr:',
        'Хорватський прапор'
    ],
    '🇭🇹': [
        'Прапор Гаїті',
        ':ht:',
        'Haitian Flag'
    ],
    '🇭🇺': [
        'Прапор Угорщини',
        ':hu:',
        'Угорський прапор'
    ],
    '🇮🇨': [
        'Прапор Канарських островів',
        ':ic:'
    ],
    '🇮🇩': [
        'Прапор Індонезії',
        ':id:',
        'Прапор Індонезії'
    ],
    '🇮🇪': [
        'Прапор Ірландії',
        ':ie:',
        'Ірландський прапор'
    ],
    '🇮🇱': [
        'Прапор Ізраїлю',
        ':il:',
        'Ізраїльський прапор'
    ],
    '🇮🇲': [
        'Прапор Острова Мен',
        ':im:',
        'Manx Flag'
    ],
    '🇮🇳': [
        'Прапор Індії',
        ':in:',
        'Індійський прапор'
    ],
    '🇮🇴': [
        'Прапор Британської Території в Індійському Океані',
        ':io:',
        'Британський прапор території в Індійському океані'
    ],
    '🇮🇶': [
        'Прапор Іраку',
        ':iq:',
        'Iraqi Flag'
    ],
    '🇮🇷': [
        'Прапор Ірану',
        ':ir:',
        'Іранський прапор'
    ],
    '🇮🇸': [
        'Прапор Ісландії',
        ':is:',
        'Ісландський прапор'
    ],
    '🇮🇹': [
        'Прапор Італії',
        ':it:',
        'Прапор Італії'
    ],
    '🇯🇪': [
        'Прапор Джерсі',
        ':je:',
        'Стяг Джерсі'
    ],
    '🇯🇲': [
        'Прапор Ямайки',
        ':jm:',
        'Прапор Ямайки'
    ],
    '🇯🇴': [
        'Прапор Йорданії',
        ':jo:',
        'Йорданський прапор'
    ],
    '🇯🇵': [
        'Прапор Японії',
        ':jp:',
        'Прапорець Японії'
    ],
    '🇰🇪': [
        'Прапор Кенії',
        ':ke:',
        'Стяг Кенії'
    ],
    '🇰🇬': [
        'Прапор Киргизстану',
        ':kg:',
        'Kyrgyzstani Flag'
    ],
    '🇰🇭': [
        'Прапор Камбоджі',
        ':kh:',
        'Стяг Камбоджі'
    ],
    '🇰🇮': [
        'Прапор Кірибаті',
        ':ki:',
        'Стяг І-Кірибаті'
    ],
    '🇰🇲': [
        'Прапор Коморських Островів',
        ':km:',
        'Прапорець Комора'
    ],
    '🇰🇳': [
        'Прапор Сент-Кіттсу і Невісу',
        ':kn:'
    ],
    '🇰🇵': [
        'Прапор Північної Кореї',
        ':kp:',
        'Стяг Північної Кореї'
    ],
    '🇰🇷': [
        'Прапор Південної Кореї',
        ':kr:',
        'Південнокорейський прапор'
    ],
    '🇰🇼': [
        'Прапор Кувейту',
        ':kw:',
        'Kuwaiti Flag'
    ],
    '🇰🇾': [
        'Прапор Кайманових Островів',
        ':ky:',
        'Прапор Кайману'
    ],
    '🇰🇿': [
        'Прапор Казахстану',
        ':kz:',
        'Kazakhstani Flag',
        'Kazakh Flag'
    ],
    '🇱🇦': [
        'Прапор Лаосу',
        ':la:',
        'Лаоський прапор',
        'Лаос Стяг'
    ],
    '🇱🇧': [
        'Прапор Лівану',
        ':lb:',
        'Ліванський прапор'
    ],
    '🇱🇨': [
        'Прапор Сент-Люсії',
        ':lc:'
    ],
    '🇱🇮': [
        'Прапор Ліхтенштейну',
        ':lt:',
        'Прапор Ліхтенштейну'
    ],
    '🇱🇰': [
        'Прапор Шрі-Ланки',
        ':lk:',
        'Стяг Шрі-Ланки'
    ],
    '🇱🇷': [
        'Прапор Ліберії',
        ':lr:',
        'Прапор Ліберії'
    ],
    '🇱🇸': [
        'Flag of Lesotho',
        ':ls:',
        'Basotho Flag'
    ],
    '🇱🇹': [
        'Прапор Литви',
        ':lt:',
        'Прапор Литви'
    ],
    '🇱🇺': [
        'Прапор Люксембургу',
        ':lu:',
        'Стяг Люксембурга'
    ],
    '🇱🇻': [
        'Прапор Латвії',
        ':lv:',
        'Латвійський прапор'
    ],
    '🇱🇾': [
        'Прапор Лівії',
        ':ly:',
        'Лівійський прапор'
    ],
    '🇲🇦': [
        'Прапор Марокко',
        ':ma:',
        'Прапорець Мароккана'
    ],
    '🇲🇨': [
        'Прапор Монако',
        ':mc:',
        'Прапор Монеасгасу'
    ],
    '🇲🇩': [
        'Прапор Молдови',
        ':md:',
        'Молдовський прапор'
    ],
    '🇲🇪': [
        'Прапор Чорногорії',
        ':me:',
        'Прапор Чорногорії'
    ],
    '🇲🇫': [
        'Прапор Святого Мартіна',
        ':mf:',
        'Flag: St. Martin'
    ],
    '🇲🇬': [
        'Прапор Мадагаскару',
        ':mg:',
        'Madagascan Flag'
    ],
    '🇲🇭': [
        'Прапор Маршаллових Островів',
        ':mh:',
        'Прапор Маршаллу'
    ],
    '🇲🇰': [
        'Прапор Македонії',
        ':mk:',
        'Стяг Македонії'
    ],
    '🇲🇱': [
        'Прапор Малі',
        ':ml:',
        'Малійський прапор'
    ],
    '🇲🇲': [
        'Прапор М\'янми (Бірми)',
        ':mm:',
        'Прапор М\'янми',
        'Прапор для Бірми',
        'Бірманський прапор'
    ],
    '🇲🇳': [
        'Прапор Монголії',
        ':mn:',
        'Монгольський прапор'
    ],
    '🇲🇴': [
        'Прапор Макао-Сар Китаю',
        ':mo:',
        'Флаг Маканська'
    ],
    '🇲🇵': [
        'Прапор Північних Маріанських Островів',
        ':mp:',
        'Прапор Мікронезії'
    ],
    '🇲🇶': [
        'Прапор Мартиніки',
        ':mq:',
        'Зміїний Прапор Мартиніки',
        'Прапор Мартсайс'
    ],
    '🇲🇷': [
        'Прапор Мавританії',
        ':mr:',
        'Стяг Мавританії'
    ],
    '🇲🇸': [
        'Flag of Montserrat',
        ':ms:',
        'Montserratian Flag'
    ],
    '🇲🇹': [
        'Прапор Мальти',
        ':mt:',
        'Maltese Flag'
    ],
    '🇲🇺': [
        'Flag of Mauritius',
        ':mu:',
        'Стяг Маврикії'
    ],
    '🇲🇻': [
        'Прапор Мальдівів',
        ':mv:',
        'Прапор Мальдівів'
    ],
    '🇲🇼': [
        'Прапор Малаві',
        ':mw:',
        'Malawian Flag'
    ],
    '🇲🇽': [
        'Прапор Мексики',
        ':mx:',
        'Мексиканський прапор'
    ],
    '🇲🇾': [
        'Прапор Малайзії',
        ':my:',
        'Malaysian Flag'
    ],
    '🇲🇿': [
        'Прапор Мозамбіку',
        ':mz:',
        'Мозамбіцький прапор'
    ],
    '🇳🇦': [
        'Прапор Намібії',
        ':na:',
        'Namibian Flag'
    ],
    '🇳🇨': [
        'Прапор Нової Каледонії',
        ':nc:',
        'Новий Каледонський прапор'
    ],
    '🇳🇪': [
        'Прапор Нігеру',
        ':ne:',
        'Стяг Нігерії'
    ],
    '🇳🇫': [
        'Прапор Острова Норфолк',
        ':nf:',
        'Прапор острова Норфолк'
    ],
    '🇳🇬': [
        'Прапор Нігерії',
        ':ng:',
        'Прапор Нігерії'
    ],
    '🇳🇮': [
        'Flag of Nicaragua',
        ':ni:',
        'Nicaraguan Flag'
    ],
    '🇳🇱': [
        'Прапор Нідерландів',
        ':nl:',
        'Голландський прапор',
        'Голланд'
    ],
    '🇳🇴': [
        'Прапор Норвегії',
        ':no:',
        'Норвезький прапор'
    ],
    '🇳🇵': [
        'Прапор Непалу',
        ':np:',
        'Стяг Непалу'
    ],
    '🇳🇷': [
        'Прапор Науру',
        ':nr:',
        'Nauruan Flag'
    ],
    '🇳🇺': [
        'Прапор Ніуе',
        ':nu:',
        'Niuean Flag'
    ],
    '🇳🇿': [
        'Прапор Нової Зеландії',
        ':nz:',
        'Стяг Ківі'
    ],
    '🇴🇲': [
        'Прапор Оману',
        ':om:',
        'Стяг Омані'
    ],
    '🇵🇦': [
        'Прапор Панами',
        ':pa:',
        'Панаманійський прапор'
    ],
    '🇵🇪': [
        'Прапор Перу',
        ':pe:',
        'Прапор Перу'
    ],
    '🇵🇫': [
        'Прапор Французької Полінезії',
        ':pf:',
        'Прапор Французької Полінезії'
    ],
    '🇵🇬': [
        'Прапор Папуа Нової Гвінеї',
        ':pg:',
        'Стяг PNG',
        'Papua New Guinean Flag'
    ],
    '🇵🇭': [
        'Прапор Філіппін',
        ':ph:'
    ],
    '🇵🇰': [
        'Прапор Пакистану',
        ':pk:',
        'Пакістанський прапор'
    ],
    '🇵🇱': [
        'Прапор Польщі',
        ':pl:',
        'Польський прапор'
    ],
    '🇵🇲': [
        'Прапор Сен-П\'єру і Мікелону',
        ':pm:'
    ],
    '🇵🇳': [
        'Прапор Піткерна',
        ':pn:'
    ],
    '🇵🇷': [
        'Прапор Пуерто-Рико',
        ':pr:',
        'Стяг Пуерто-Рикану'
    ],
    '🇵🇸': [
        'Прапор палестинських територій',
        ':ps:',
        'Palestine'
    ],
    '🇵🇹': [
        'Прапор Португалії',
        ':pt:',
        'Прапор Португалії'
    ],
    '🇵🇼': [
        'Прапор Палау',
        ':pw:',
        'Стяг Палауа'
    ],
    '🇵🇾': [
        'Прапор Парагваю',
        ':py:',
        'Paraguayan Flag'
    ],
    '🇶🇦': [
        'Прапор Катару',
        ':qa:',
        'Стяг Катарі'
    ],
    '🇷🇪': [
        'Прапор Реюньйону',
        ':re:',
        'Прапор штату Реюньйоне'
    ],
    '🇷🇴': [
        'Прапор Румунії',
        ':ro:',
        'Румунський прапор'
    ],
    '🇷🇸': [
        'Прапор Сербії',
        ':rs:',
        'Сербський прапор'
    ],
    '🇷🇺': [
        'Прапор Росії',
        ':ru:',
        'Російський прапор'
    ],
    '🇷🇼': [
        'Flag of Rwanda',
        ':rw:',
        'Rwandan Flag'
    ],
    '🇸🇦': [
        'Прапор Саудівської Аравії',
        ':sa:',
        'Прапор Саудівської Аравії'
    ],
    '🇸🇧': [
        'Прапор Соломонових Островів',
        ':sb:',
        'Прапор Соломонових Островів'
    ],
    '🇸🇨': [
        'Прапор Сейшельських Островів',
        ':sc:',
        'Seychellois Flag'
    ],
    '🇸🇩': [
        'Прапор Судану',
        ':sd:',
        'Sudanese Flag'
    ],
    '🇸🇪': [
        'Прапор Швеції',
        ':se:',
        'Шведський прапор'
    ],
    '🇸🇬': [
        'Прапор Сінгапуру',
        ':sg:',
        'Сінгапурський прапор'
    ],
    '🇸🇭': [
        'Прапор острова Святої Єлени',
        ':sh:'
    ],
    '🇸🇮': [
        'Прапор Словенії',
        ':si:',
        'Словенський прапор'
    ],
    '🇸🇯': [
        'Прапор Шпіцбергену і Ян-Маєн',
        ':sj:'
    ],
    '🇸🇰': [
        'Прапор Словаччини',
        ':sk:',
        'Словацький прапор',
        'Slovakian Flag'
    ],
    '🇸🇱': [
        'Прапор Сьєрра-Леоне',
        ':sl:',
        'Sierra Leonean Flag'
    ],
    '🇸🇲': [
        'Прапор Сан-Марино',
        ':sm:',
        'Санмаринський прапор'
    ],
    '🇸🇳': [
        'Прапор Сенегалу',
        ':sn:',
        'Прапор Сенгали'
    ],
    '🇸🇴': [
        'Прапор Сомалі',
        ':so:',
        'Somalian Flag'
    ],
    '🇸🇷': [
        'Прапор Суринаму',
        ':sr:',
        'Прапор Сурінамера'
    ],
    '🇸🇸': [
        'Прапор Південного Судану',
        ':ss:',
        'Стяг Південного Судану'
    ],
    '🇸🇹': [
        'Прапор Саюріо Томе і Пріонсіпі',
        ':st:'
    ],
    '🇸🇻': [
        'Прапор Сальвадору',
        ':sv:',
        'Прапор Сальвадора'
    ],
    '🇸🇽': [
        'Прапор Сінт-Мартену',
        ':sx:'
    ],
    '🇸🇾': [
        'Прапор Сирії',
        ':sy:',
        'Прапорець Сирії'
    ],
    '🇸🇿': [
        'Прапор Свазіленду',
        ':sz:',
        'Прапор Есватіні'
    ],
    '🇹🇦': [
        'Flag of Tristan Da Cunha',
        ':ta:'
    ],
    '🇹🇨': [
        'Прапор Островів Теркс і Кайкос',
        ':tc:'
    ],
    '🇹🇩': [
        'Прапор Чаду',
        ':td:',
        'Стяг Чаду'
    ],
    '🇹🇫': [
        'Прапор Французьких Південних територій',
        ':tf:',
        'Французький прапор південних земель'
    ],
    '🇹🇬': [
        'Прапор Того',
        ':tg:',
        'Togolese Flag'
    ],
    '🇹🇭': [
        'Прапор Таїланду',
        ':th:',
        'Стяг Таїланду'
    ],
    '🇹🇯': [
        'Прапор Таджикистану',
        ':tj:',
        'Таджицький прапор'
    ],
    '🇹🇰': [
        'Прапор Токелау',
        ':tk:',
        'Стяг Токелауа'
    ],
    '🇹🇱': [
        'Прапор Тимор-Лешті',
        ':tl:',
        'Прапор Східного Тимору',
        'Прапор Східного Тимореса'
    ],
    '🇹🇲': [
        'Прапор Туркменістану',
        ':tm:',
        'Turkmen Flag'
    ],
    '🇹🇳': [
        'Прапор Тунісу',
        ':tn:',
        'Стяг Тунісу'
    ],
    '🇹🇴': [
        'Прапор Тонги',
        ':to:',
        'Tongan Flag'
    ],
    '🇹🇷': [
        'Прапор Туреччини',
        ':tr:',
        'Турецький прапор'
    ],
    '🇹🇹': [
        'Прапор Тринідаду і Тобаго',
        ':tt:'
    ],
    '🇹🇻': [
        'Прапор Тувалу',
        ':tv:',
        'Стяг Тувалуана'
    ],
    '🇹🇼': [
        'Прапор Тайваню',
        ':tw:',
        'Тайванський прапор'
    ],
    '🇹🇿': [
        'Прапор Танзанії',
        ':tz:',
        'Tanzanian Flag'
    ],
    '🇺🇦': [
        'Прапор України',
        ':ua:',
        'Український прапор'
    ],
    '🇺🇬': [
        'Прапор Уганди',
        ':ug:',
        'Стяг Уганди'
    ],
    '🇺🇲': [
        'Прапор: Віддалені острови США',
        ':um:'
    ],
    '🇺🇸': [
        'Прапор Сполучених Штатів Америки',
        ':us:',
        'Американський прапор',
        'Стяг США'
    ],
    '🇺🇾': [
        'Flag of Uruguay',
        ':uy:',
        'Uruguayan Flag'
    ],
    '🇺🇿': [
        'Flag of Uzbekistan',
        ':uz:',
        'Uzbekistani Flag',
        'Uzbek Flag'
    ],
    '🇻🇦': [
        'Прапор Ватикану',
        ':va:',
        'Прапорець Вантікану'
    ],
    '🇻🇨': [
        'Прапор Сент-Вінсенту і Гренадинів',
        ':vc:'
    ],
    '🇻🇪': [
        'Прапор Венесуели',
        ':ve:',
        'Венесуельський прапор'
    ],
    '🇻🇬': [
        'Прапор Британських Віргінських Островів',
        ':vg:',
        'Британський прапор Віргінського острова'
    ],
    '🇻🇮': [
        'Прапор Американських Віргінських Островів',
        ':vi:',
        'Прапор Американських Віргінських Островів'
    ],
    '🇻🇳': [
        'Прапор В\'єтнаму',
        ':vn:',
        'В\'єтнамський прапор'
    ],
    '🇻🇺': [
        'Flag of Vanuatu',
        ':vu:',
        'Ni-Vanuatu Flag'
    ],
    '🇼🇫': [
        'Прапор Воллісу і Футуни',
        ':wf:'
    ],
    '🇼🇸': [
        'Прапор Самоа',
        ':ws:',
        'Samoan Flag'
    ],
    '🇽🇰': [
        'Прапор Косова',
        ':xk:',
        'Kosovar Flag'
    ],
    '🇾🇪': [
        'Прапор Ємену',
        ':ye:',
        'Стяг Ємену'
    ],
    '🇾🇹': [
        'Прапор Майотти',
        ':yt:',
        'Стяг Майотти'
    ],
    '🇿🇦': [
        'Прапор Південної Африки',
        ':za:',
        'Південноафриканський прапор'
    ],
    '🇿🇲': [
        'Прапор Замбії',
        ':zm:',
        'Zambian Flag'
    ],
    '🇿🇼': [
        'Прапор Зімбабве',
        ':zw:',
        'Прапор Зімбабве',
        'Сім прапор'
    ]
};
/*sports*/
emojis_language[lang][8] = {
    '🧗{{skin_tone}}‍♂️': [
        'Сходження',
        ':man_climbing:',
        ':climbing:',
        'Мале Кам\'яне сходження',
        'Сходження людини',
        ':man:'
    ],
    '🧗{{skin_tone}}‍♀️': [
        'Жінка-скелелазіння',
        ':woman_climbing:',
        ':climbing:',
        'Кам\'яне сходження',
        'Жінка зі скелетом',
        ':woman:'
    ],
    '🧗{{skin_tone}}': [
        'Сходження перса',
        ':person_climbing:',
        ':climbing:',
        'Кам’яний скелелаж',
        'Лізильник персона',
        ':person:'
    ],
    '🏇{{skin_tone}}': [
        'Кінні перегони',
        ':horse_racing:',
        'Кінські перегони',
        'Жокей'
    ],
    '⛷{{skin_tone}}‍️': [
        'Скайер',
        ':skier:'
    ],
    '🏂{{skin_tone}}': [
        'Snowboarder',
        ':snowboarder:'
    ],
    '🏌️{{skin_tone}}‍♂️': [
        'Man Golfer',
        ':man_golfer:',
        ':golfer:',
        ':man:'
    ],
    '🏌️{{skin_tone}}‍♀️': [
        'Жінка-Голфер',
        ':woman_golfer:',
        ':golfer:',
        ':woman:'
    ],
    '🏌️{{skin_tone}}': [
        'Персон Голфер',
        ':person_golfer:',
        ':golfer:',
        ':person:'
    ],
    '🏄{{skin_tone}}‍♂️': [
        'Серфер',
        ':man_surfer:',
        ':surfer:',
        ':man:'
    ],
    '🏄{{skin_tone}}‍♀️': [
        'Жінка-серфер',
        ':woman_surfer:',
        ':surfer:',
        ':woman:'
    ],
    '🏄{{skin_tone}}': [
        'Персон Серфер',
        ':person_surfer:',
        ':surfer:',
        ':person:'
    ],
    '🚣{{skin_tone}}‍♂️': [
        'Чоловічий човен',
        ':man_rowing_boat:',
        ':rowing_boat:',
        ':man:'
    ],
    '🚣{{skin_tone}}‍♀️': [
        'Жіночий човен для королі',
        ':woman_rowing_boat:',
        ':rowing_boat:',
        ':woman:'
    ],
    '🚣{{skin_tone}}': [
        'Плоска голландка',
        ':person_rowing_boat:',
        ':rowing_boat:',
        ':person:'
    ],
    '🏊{{skin_tone}}‍♂️': [
        'Чоловік плаває',
        ':man_swimming:',
        ':swimming:',
        'Чоловік у плавання',
        ':man:'
    ],
    '🏊{{skin_tone}}‍♀️': [
        'Жінка плавання',
        ':woman_swimming:',
        ':swimming:',
        'Жінка Плавмер',
        ':woman:'
    ],
    '🏊{{skin_tone}}': [
        'Персон Плавання',
        ':person_swimming:',
        ':swimming:',
        'Персон Лампмер',
        ':person:'
    ],
    '⛹{{skin_tone}}‍️‍♂️': [
        'Мен Болл',
        ':man_bouncing_ball:',
        ':bouncing_ball:',
        'Людина з баскетболіста',
        ':man:'
    ],
    '⛹️{{skin_tone}}‍♀️': [
        'Жіноча кулька, що стрибає',
        ':woman_bouncing_ball:',
        ':boucing_ball:',
        'Жіночий баскетбольний програвач',
        ':woman:'
    ],
    '⛹️{{skin_tone}}': [
        'Водолазний бул',
        ':person_bouncing_ball:',
        ':boucing_ball:',
        'Відтворювач баскетболіста',
        ':person:'
    ],
    '🏋️{{skin_tone}}‍♂️': [
        'Людина, що піднімає ваги',
        ':man_lifting_weights:',
        ':lifting_weights:',
        'Важка атлетика',
        ':man:'
    ],
    '🏋️{{skin_tone}}‍♀️': [
        'Життєві ваги жінки',
        ':woman_lifting_weights:',
        ':lifting_weights:',
        'Важка жінка',
        ':woman:'
    ],
    '🏋️{{skin_tone}}': [
        'Підтягування ваги користувача',
        ':person_lifting_weights:',
        ':lifting_weights:',
        'Важка атлетика людини',
        ':person:'
    ],
    '🚴{{skin_tone}}‍♂️': [
        'Чоловічий велосипед',
        ':man_biking:',
        ':biking:',
        'Чоловік Цикліст',
        'Чоловічий цикліст',
        ':man:'
    ],
    '🚴{{skin_tone}}‍♀️': [
        'Жінка-байкінг',
        ':woman_biking:',
        ':biking:',
        'Цикліст жіночий',
        'Жін. цикліст',
        ':woman:'
    ],
    '🚴{{skin_tone}}': [
        'Персон Бікінг',
        ':person_biking:',
        ':biking:',
        'Персон Цикліст',
        'Персон Цикліст',
        ':person:'
    ],
    '🚵{{skin_tone}}‍♂️': [
        'Чоловіцький гірський байк',
        ':man_mountain_bike:',
        ':mountain_bike:',
        'Мен-Маунтен-байкер',
        ':man:'
    ],
    '🚵{{skin_tone}}‍♀️': [
        'Жіночий гірський велосипед',
        ':woman_mountain_bike:',
        ':mountain_bike:',
        'Жіночий гірський байкер',
        ':woman:'
    ],
    '🚵{{skin_tone}}': [
        'Персон Маунтінг',
        ':person_mountain_bike:',
        ':mountain_bike:',
        'Персон Байкер',
        ':person:'
    ],
    '🤸{{skin_tone}}‍♂️': [
        'Чоловіче укриття',
        ':man_cartwheeling:',
        ':cartwheeling:',
        'Чоловік з декартою',
        ':man:'
    ],
    '🤸{{skin_tone}}‍♀️': [
        'Жінка-картінг',
        ':woman_cartwheeling:',
        ':cartwheeling:',
        'Жінка-дзижчання',
        ':woman:'
    ],
    '🤸{{skin_tone}}': [
        'Персон Картрілінг',
        ':person_cartwheeling:',
        ':cartwheeling:',
        'Озерне колесо для перегону',
        ':person:'
    ],
    '🤼‍♂️': [
        'Чоловіча боротьба',
        ':men_wrestling:',
        ':wrestling:',
        'Боротьба',
        'Борці',
        ':man:'
    ],
    '🤼‍♀️': [
        'Жінки з боротьби',
        ':women_wrestling:',
        ':wrestling:',
        'Боротьба',
        'Борці',
        ':woman:'
    ],
    '🤼': [
        'Люди боротьби',
        ':people_wrestling:',
        ':wrestling:',
        'Боротьба',
        'Борці',
        ':person:'
    ],
    '🤽{{skin_tone}}‍♂️': [
        'Людина, що грає в водне поло',
        ':man_playing_water_polo:',
        ':playing_water_polo:',
        ':man:'
    ],
    '🤽{{skin_tone}}‍♀️': [
        'Жінка, яка грає в водне поло',
        ':woman_playing_water_polo:',
        ':playing_water_polo:',
        ':woman:'
    ],
    '🤽{{skin_tone}}': [
        'Особа, яка грає в водне поло',
        ':person_playing_water_polo:',
        ':playing_water_polo:',
        ':person:'
    ],
    '🤾{{skin_tone}}‍♂️': [
        'Людина, що грає в гандбол',
        ':man_playing_handball:',
        ':playing_handball:',
        ':man:'
    ],
    '🤾{{skin_tone}}‍♀️': [
        'Жінка, що грає в гандбол',
        ':woman_playing_handball:',
        ':playing_handball:',
        ':woman:'
    ],
    '🤾{{skin_tone}}': [
        'Хандбол',
        ':person_playing_handball:',
        ':playing_handball:',
        ':person:'
    ],
    '🤹{{skin_tone}}‍♂️': [
        'Жонглювання',
        ':man_juggling:',
        ':juggling:',
        'Чоловічий жонглер',
        ':man:'
    ],
    '🤹{{skin_tone}}‍♀️': [
        'Жіноча жонглювання',
        ':woman_juggling:',
        ':juggling:',
        'Жін. жонглер',
        ':woman:'
    ],
    '🤹{{skin_tone}}': [
        'Гоглядання до світу',
        ':person_juggling:',
        ':juggling:',
        'Персон Юглер',
        ':person:'
    ],
    '🧘{{skin_tone}}‍♂️': [
        'Людина в лотусі',
        ':man_lotus_position:',
        ':lotus_position:',
        'Медитація',
        'Zen',
        'Крос-нога',
        'Йога',
        ':man:'
    ],
    '🧘{{skin_tone}}‍♀️': [
        'Жінка в лотусі',
        ':woman_lotus_position:',
        ':lotus_position:',
        'Медитація',
        'Zen',
        'Крос-нога',
        'Йога',
        ':woman:'
    ],
    '🧘{{skin_tone}}': [
        'Персон-ін-Лотус',
        ':person_lotus:_position',
        ':lotus_position:',
        'Медитація',
        'Zen',
        'Крос-нога',
        'Йога',
        ':person:'
    ],
    '🏃{{skin_tone}}‍♂️': [
        'Чоловік, що біжить',
        ':man_running:',
        ':running:',
        ':man:'
    ],
    '🏃{{skin_tone}}‍♀️': [
        'Жінка-біг',
        ':woman_running:',
        ':running:',
        ':woman:'
    ],
    '🏃{{skin_tone}}': [
        'Персон Біг',
        ':person_running:',
        ':running:',
        ':person:'
    ],
    '🏃{{skin_tone}}‍♂️‍➡️': [
        'Man Running Facing Right',
        ':man_running_facing_right:',
        ':running:',
        ':man:'
    ],
    '🏃{{skin_tone}}‍♀️‍➡️': [
        'Woman Running Facing Right',
        'woman_running_facing_right:',
        ':running:',
        ':woman:'
    ],
    '🏃{{skin_tone}}‍➡️': [
        'Person Running Facing Right',
        ':person_running_facing_right:',
        ':running:',
        ':person:'
    ],
    '🕺{{skin_tone}}': [
        'Чоловік танцює',
        ':man_dancing:',
        ':dancing:',
        ':man:'
    ],
    '💃{{skin_tone}}': [
        'Жінка танцює',
        ':woman_dancing:',
        ':dancing:',
        ':woman:'
    ],
    '🤺': [
        'Персон Фехтування',
        ':person_fencing:',
        'Фансівники',
        ':fencing:'
    ],
    '🏆': [
        'Трофей',
        ':trophy:',
        'Чемпіонат',
        'Переможець',
        ':gold:',
        ':yellow:'
    ],
    '🏅': [
        'Медаль Спортів',
        ':sports_medal:',
        ':medal:',
        ':gold:',
        ':yellow:'
    ],
    '🥇': [
        'Медаль за перше місце',
        ':first_place_medal:',
        ':gold_medal:',
        'Медаль за перше місце',
        'Золота Медаль',
        ':yellow:',
        ':gold:'
    ],
    '🥈': [
        'Медаль за друге місце',
        ':second_place_medal:',
        ':silver_medal:',
        'Медаль за друге місце',
        'Срібна Медаль',
        ':gray:',
        ':grey:',
        ':silver:'
    ],
    '🥉': [
        'Медаль за 3-є місце',
        ':third_place_medal:',
        ':bronze_medal:',
        'Медаль за Третій Місце',
        'Бронзова медаль',
        ':brown:',
        ':bronze:'
    ],
    '⚽': [
        'Футбол',
        ':football:',
        'Футбол',
        ':white:',
        ':black:'
    ],
    '⚾': [
        'Бейсбол',
        ':baseball:',
        'Софтбол',
        ':white:'
    ],
    '🥎': [
        'Софтбол',
        ':softball:',
        ':yellow:'
    ],
    '🏀': [
        'Баскетбол',
        ':basketball:',
        ':orange:',
        'Баскетбол і хребет'
    ],
    '🏐': [
        'Волейбол',
        ':volleyball:',
        ':white:'
    ],
    '🏈': [
        'Американський футбол',
        ':american_football:',
        'Футбол',
        'Gridiron',
        'Суперчаша',
        ':brown:'
    ],
    '🏉': [
        'Регбі з футболу',
        ':rugby:',
        'Футбол',
        'Ліга',
        'Регбі',
        'Юніон'
    ],
    '🎾': [
        'Теніс',
        ':tennis:',
        ':ball:',
        'Куля',
        'Рекет',
        'Раке',
        ':yellow:'
    ],
    '🥏': [
        'Літаючий диск',
        ':flying_disk:',
        'Фрісбі'
    ],
    '🎳': [
        'Боулінг',
        ':bowling:',
        'Контакти',
        'Скотлз',
        'Десять Пін-Боулінг'
    ],
    '🏏': [
        'Крикет',
        ':cricket:',
        'Кажан',
        'Куля'
    ],
    '🏑': [
        'Польський хокей',
        ':field_hockey:',
        'Куля',
        'Прикріпити'
    ],
    '🏒': [
        'Хокей',
        ':ice_hockey:',
        'Куля',
        'Прикріпити'
    ],
    '🥍': [
        'Лакрос',
        ':lacrosse:',
        'Куля',
        'Прикріпити',
        ':red:'
    ],
    '🏓': [
        'Пінґ-понґ',
        ':ping_pong:',
        ':table_tennis:',
        'Настільний теніс',
        'Куля',
        'Paddle'
    ],
    '🏸': [
        'Badminton',
        ':badminton:',
        'Волан',
        'Раке'
    ],
    '🥊': [
        'Боксерські рукавички',
        ':boxing_glove:',
        ':red:'
    ],
    '🥋': [
        'Бойові мистецтва',
        ':martial_arts_uniform:',
        ':judo:',
        ':karate:',
        ':kung_fu:',
        'Дзюдо',
        'Карате',
        'Кунфу'
    ],
    '⛳': [
        'Прапор в дірі',
        ':flag_in_hole:',
        ':golf_flag:',
        'Стяг для гольфу'
    ],
    '⛸️': [
        'Ковзани',
        ':ice_skate:',
        'Катання на ковзанах'
    ],
    '🎣': [
        'Риболовля',
        ':fishing:',
        'Поле',
        'Риба',
        'Вудка'
    ],
    '🎽': [
        'Футболка з запуском',
        ':running_shirt:',
        'Сингле',
        'Сеш'
    ],
    '🎿': [
        'Скіс',
        ':skis:',
        'Катання на лижах',
        'Завантаження'
    ],
    '🛷': [
        'Сани',
        ':sled:'
    ],
    '🥌': [
        'Керлінг-камінь',
        ':curling_stone:'
    ],
    '🎯': [
        'Прямий Удар',
        ':direct_hit:',
        'Стрільба з лука',
        'Bullseye',
        'Дартс'
    ],
    '🎱': [
        'Куля басейну 8',
        ':pool_8_ball:',
        'Кий м\'яч',
        'Снукер',
        'Більярди',
        ':black:'
    ],
    '🎮': [
        'Режим Video Game Controller',
        ':video_game_controller:',
        ':playstation:',
        ':xbox:',
        'Плейстаціонація',
        'Xbox',
        'Геймпад',
        'Wii U'
    ],
    '♟️': [
        'Чорний шаховий пішак',
        ':black_chess_pawn:',
        ':black:'
    ],
    '🏹': [
        'Лук і стріла',
        ':arch:',
        'Арка'
    ],
    '🥅': [
        'Ціль сіткою',
        ':goal_net:'
    ],
    '🀄': [
        'Маджонг Ред Дракон',
        ':mahjong:',
        'Маджонг',
        'Mahjong Tile',
        '中',
        'Маджонг Тіл Ред Дракон'
    ],
    '🎴': [
        'Квіткові картки',
        ':flower_playing_cards:',
        'Колода карток',
        'Hanafuda',
        'Hwatu',
        'Гра у карти'
    ]
};
/*travel and places*/
emojis_language[lang][9] = {
    '🚂': [
        'Локомотив Steam',
        ':steam_train:',
        'Пар',
        'Залізничний локомотив'
    ],
    '🚃': [
        'Залізничний автомобіль',
        ':railway_car:',
        'Залізничний кар',
        'Залізничний автомобіль',
        'Залізнична карета',
        'Знак залізничного вагона'
    ],
    '🚄': [
        'Високошвидкісний поїзд',
        ':high_speed_train:'
    ],
    '🚅': [
        'Потяг з кулі',
        ':bullet_train:',
        'Shinkansen',
        'Покращений поїзд із кулями носа'
    ],
    '🚆': [
        'Поїзд',
        ':train:'
    ],
    '🚇': [
        'Андеґраунд',
        ':underground:',
        'Трубка',
        'Метро',
        'Метро'
    ],
    '🚈': [
        'Світла залізниця',
        ':light_rail:',
        'Поїзд'
    ],
    '🚊': [
        'Трамвай',
        ':tram:'
    ],
    '🚝': [
        'Монорейка',
        ':monorail:',
        'Поїзд'
    ],
    '🚞': [
        'Гірська залізниця',
        ':mountain_railway:',
        'Funicular',
        'Залізниця і гора'
    ],
    '🚋': [
        'Трамвайний автомобіль',
        ':tram_car:'
    ],
    '🚌': [
        'Автобус',
        ':bus:',
        'Тренер'
    ],
    '🚍': [
        'Поточний автобус',
        ':front_of_bus:',
        'Фронт автобуса'
    ],
    '🚎': [
        'Тролейбус',
        ':trolleybus:',
        'Електроавтобус'
    ],
    '🚐': [
        'Minibus',
        ':minibus:',
        'Мінівен',
        'Люль-Мувер'
    ],
    '🚑': [
        'Амоглентність',
        ':ambulance:'
    ],
    '🚒': [
        'Пожежний автомобіль',
        ':fire_engine:',
        'Вогняний відділ',
        'Вогнева Вантажівка'
    ],
    '🚓': [
        'Поліцейський автомобіль',
        ':police_car:',
        'Поліцейський автомобіль',
        'Відбіл поліцейського автомобіля'
    ],
    '🚔': [
        'Незабутній поліцейський автомобіль',
        ':front_of_police_car:',
        'Передня поліційний автомобіль',
        'Поліцейський автомобіль'
    ],
    '🚕': [
        'Таксі',
        ':taxi:',
        'Нью-Йорк Таксі',
        'Відхід від таксі'
    ],
    '🚖': [
        'Таксі',
        ':front_of_taxi:',
        'Прийдешні таксі',
        'Фронт таксі'
    ],
    '🚗': [
        'Автомобіль',
        ':car:',
        'Червоний автомобіль',
        'Біля автомобіля',
        'Автомобіль'
    ],
    '🚘': [
        'Поточний автомобіль',
        ':front_of_car:',
        'Червоний автомобіль',
        'Передня частина автомобіля'
    ],
    '🚚': [
        'Вантажівка доставки',
        ':lorry:',
        'Лоррі'
    ],
    '🚛': [
        'Артикуляція Лоррі',
        ':articulated_lorry:',
        'Зелена вантажівка'
    ],
    '🚜': [
        'Трактор',
        ':tractor:',
        'Ферма'
    ],
    '🛻': [
        'Пікап',
        ':pickup_truck:'
    ],
    '🏎️': [
        'Гонковий автомобіль',
        ':racing_car:',
        'Ф1',
        'Формула-1',
        'Гоночний автомобіль'
    ],
    '🏍️': [
        'Мотоцикл',
        ':motorbike:',
        'Мотоцикл'
    ],
    '🛵': [
        'Мотор самокат',
        ':motor_scooter:',
        'Vespa',
        'Моторний велосипед',
        'Моторний велосипед'
    ],
    '🛺': [
        'Авто Рікша',
        ':auto_rickshaw:',
        'Tuk Tuk'
    ],
    '🚲': [
        'Велосипед',
        ':bike:',
        'Велосипед'
    ],
    '🛴': [
        'Кік Скутер',
        ':kick_scooter:'
    ],
    '⛵': [
        'Сильний човен',
        ':sailboat:',
        'Дінгі',
        'Яхт'
    ],
    '🚤': [
        'Прискорювач',
        ':speedboat:',
        'Моторний човен',
        'Пауербот'
    ],
    '🛳️': [
        'Пасажирське судно',
        ':passenger_ship:'
    ],
    '⛴️': [
        'Феррі',
        ':ferry:'
    ],
    '🛥️': [
        'Моторний човен',
        ':motor_boat:'
    ],
    '🚢': [
        'Круїзний корабель',
        ':cruise_ship:'
    ],
    '✈️': [
        'Літак',
        ':airplane:',
        'Aeroplane'
    ],
    '🛩️': [
        'Маленький літак',
        ':small_airplane:',
        'Малий літак'
    ],
    '🚁': [
        'Вертоліт',
        ':helicopter:'
    ],
    '🚟': [
        'Підвісна залізниця',
        ':suspension_railway:'
    ],
    '🚠': [
        'Маунтен-Кейбвей',
        ':mountain_cableway:'
    ],
    '🚡': [
        'Повітряний трамвай',
        ':aerial_tramway:',
        'Кабельний автомобіль',
        'Gondola',
        'Ропуей'
    ],
    '🛰️': [
        'Супутниковий',
        ':satellite:'
    ],
    '🚀': [
        'Ракета',
        ':rocket:',
        'Спейс Шаттл'
    ],
    '🛸': [
        'Летючий блюдце',
        ':flying_saucer:',
        'УФО'
    ],
    '🚉': [
        'Залізничний вокзал',
        ':train_station:',
        'Залізнична платформа'
    ],
    '🚏': [
        'Автобусна зупинка',
        ':bus_stop:'
    ],
    '🛣️': [
        'Моторуей',
        ':motorway:',
        'Дорога',
        'Хайвей',
        'Інтердержава'
    ],
    '🛤️': [
        'Залізнична колія',
        ':railway_track:'
    ],
    '🛫': [
        'Від\'їзд літака',
        ':airplane_departure:',
        'Зліт'
    ],
    '🛬': [
        'Прибуття літака',
        ':airplane_arrival:',
        'У літаку',
        'Посадка'
    ],
    '🗾': [
        'Карта Японії',
        ':map_of_japan:'
    ],
    '⛰️': [
        'Гора',
        ':mountain:'
    ],
    '🏔️': [
        'Снігова гора',
        ':snow_capped_mountain:'
    ],
    '🌋': [
        'Вулкан',
        ':volcano:'
    ],
    '🗻': [
        'Гора Фудзі',
        ':mount_fuji:',
        'Фудзі-сан'
    ],
    '🏕️': [
        'Табір',
        ':camping:',
        'Кемпінг'
    ],
    '🏖️': [
        'Пляж із парасолькою',
        ':beach_with_umbrella:'
    ],
    '🏜️': [
        'Desert',
        ':desert:'
    ],
    '🏝️': [
        'Пустельний острів',
        ':desert_island:'
    ],
    '🏞️': [
        'Національний парк',
        ':national_park:'
    ],
    '🏟️': [
        'Стадіон',
        ':stadium:',
        'Грандстань',
        'Спорт Стедіум'
    ],
    '🏛️': [
        'Класичний будинок',
        ':classical_building:',
        'Грецька',
        'Рим'
    ],
    '🏗️': [
        'Будівництво Будівель',
        ':building_construction:',
        'Журавлі'
    ],
    '🏘️': [
        'Будинки будинків',
        ':houses_building:',
        'Група будинків'
    ],
    '🏚️': [
        'Будинок з Дерев',
        ':old_house:',
        'Занедбаний будинок',
        'Старий дім',
        'Будинок з привидами'
    ],
    '🏠': [
        'Головна',
        ':home:',
        'Будинок будинку'
    ],
    '🏡': [
        'Будинок з садом',
        ':house_with_garden:',
        'Дім та Дерево'
    ],
    '🏢': [
        'Офісний корпус',
        ':office_building:',
        'Міські будинки',
        'Покращений будинок'
    ],
    '🏣': [
        'Японський пост',
        ':japanese_post_office:',
        'Японська поштова марка'
    ],
    '🏤': [
        'Поштове відділення',
        ':european_post_office:',
        'Європейський поштовий відділ'
    ],
    '🏥': [
        'Лікарня',
        ':hospital:',
        'Ер',
        'A&E',
        'Аварійна кімната',
        'Аварія та надзвичайна ситуація',
        'Червоний хрест',
        'Медичні проблеми'
    ],
    '🏦': [
        'Банк',
        ':bank:',
        'BK',
        'Bakkureru',
        'Відділення банку',
        'Bakkureru'
    ],
    '🏨': [
        'Готель',
        ':hotel:',
        'Акомодація',
        'H-будівля'
    ],
    '🏩': [
        'Готель кохання',
        ':love_hotel:',
        'Готель любове серце'
    ],
    '🏪': [
        'Крамниця',
        ':convenience_store:',
        '24-годинний магазин',
        '7-Ілевен',
        'Магазин кутів',
        'Kwik-E-Mart'
    ],
    '🏫': [
        'Школа',
        ':school:',
        'Годинникова вежа',
        'Початковий високий середній'
    ],
    '🏬': [
        'Універмаг',
        ':department_store:',
        'Центр покупок',
        'Крамниця'
    ],
    '🏭': [
        'Фабрика',
        ':factory:',
        'Промисловий',
        'Промисловість',
        'Забруднення',
        'Смог'
    ],
    '🏯': [
        'Японський замок',
        ':japanese_castle:',
        'Фортеця'
    ],
    '🏰': [
        'Європейський Замок',
        ':european_castle:',
        'Turrets'
    ],
    '💒': [
        'Церковне серце',
        ':church_heart:',
        'Церковне весілля',
        'Шлюб'
    ],
    '🗼': [
        'Токійська вежа',
        ':tokyo_tower:',
        'Ейфелева вежа',
        'Червона вежа'
    ],
    '🗽': [
        'Статуя Свободи',
        ':statue_of_liberty:',
        'Нью-Йорк'
    ],
    '⛪': [
        'Церковний будівництво',
        ':church_building:',
        'Кросс'
    ],
    '🕌': [
        'Мечеть',
        ':mosque:',
        'Домед Покрівля',
        'Minaret'
    ],
    '🛕': [
        'Хіндуси',
        ':hindu_temple:'
    ],
    '🕍': [
        'Синагога',
        ':synagogue:',
        'Іудаїзм',
        'Synagog',
        'Темпл'
    ],
    '⛩️': [
        'Святилище',
        ':shinto_shrine:',
        'Камі-но-мичі'
    ],
    '🕋': [
        'Kaaba',
        ':kaaba:',
        'Mecca'
    ],
    '🏙️': [
        'Cityscape',
        ':cityscape:'
    ],
    '⛱️': [
        'Парасоля на суходолі',
        ':beach_umbrella:',
        'Пляжна парасолька'
    ],
    '🌄': [
        'Східний Схід',
        ':sunrise_over_mountains:',
        'Ранок',
        'Схід сонця'
    ],
    '🌅': [
        'Схід сонця',
        ':sunrise:',
        ':sunset:',
        'Захід Сонця'
    ],
    '🌆': [
        'Столичні рослини в сутінках',
        ':cityscape_at_dusk:',
        'Апельсинове небо',
        'Вест-Сіті'
    ],
    '🌇': [
        'Захід сонцем над будівлями',
        ':sunset_over_buildings:',
        'Місто сонця'
    ],
    '🌃': [
        'Ніч із зірками',
        ':night_with_stars:',
        'Місто на ночі',
        'Зоряна ніч'
    ],
    '🗿': [
        'Moai',
        ':moai:',
        'Пам\'ятник острову Пасхи',
        'Людські рок вирізьблення',
        'Статуя Мояї'
    ],
    '🌠': [
        'Стрільба зірка',
        ':shooting_star:',
        'Коли ви мрієте у зірці',
        'Метеороїд'
    ],
    '🌌': [
        'Чумацький шлях',
        ':milky_way:',
        'Галактика',
        'Нічне небо',
        'З відступом',
        'Зірочки',
        'Всесвіт'
    ],
    '🎑': [
        'Церемонія перегляду Місяця',
        ':moon_viewing_ceremony:',
        'Трава, Галушки та Мун',
        'Зібрати місяць',
        'Свято середини осені',
        'Tsukimi'
    ],
    '🛖': [
        'Халабуда',
        ':hut:'
    ],
    '🎢': [
        'Американські гірки',
        ':roller_coaster:',
        'Роллеркостер',
        'Парк тем'
    ],
    '🛝': [
        'Ігровий слайд',
        ':playground_slide:',
        'Дитина',
        'Дочірні елементи'
    ]
};
/*technologies (smartphones, laptops, etc.) and office*/
emojis_language[lang][10] = {
    '⌚': [
        'Дивитися',
        ':watch:',
        'Тімеп\'єке',
        'Apple Watch'
    ],
    '⏰': [
        'Будильник',
        ':alarm_clock:'
    ],
    '⏱️': [
        'Секундомір',
        ':stopwatch:'
    ],
    '⏲️': [
        'Годинник таймера',
        ':timer_clock:'
    ],
    '🕰️': [
        'Годинник із Святої Шври',
        ':mantelpiece_clock:'
    ],
    '🧭': [
        'Компас',
        ':compass:'
    ],
    '🕹️': [
        'Джойстик',
        ':joystick:'
    ],
    '🎙️': [
        'Мікрофон студії',
        ':studio_microphone:'
    ],
    '🎚️': [
        'Рівень повзунка',
        ':level_slider:'
    ],
    '🎛️': [
        'Керування вузлами',
        ':control_knobs:'
    ],
    '📻': [
        'Радіомодуль',
        ':radio:',
        'Цифрове радіо',
        'Бездротовий'
    ],
    '📱': [
        'Мобільний телефон',
        ':mobile_phone:',
        'Смартфон',
        'iPhone',
        'Мобільний телефон',
        'Device'
    ],
    '📲': [
        'Мобільний телефон з стрілою праворуч',
        ':phone_call:',
        'Дзвінок',
        'Вказівки на телефон'
    ],
    '☎️': [
        'Чорний телефон',
        ':rotary_phone:',
        'Обертати телефон',
        ':red:'
    ],
    '📞': [
        'Ресивер телефону',
        ':phone:',
        'Handset',
        'Телефон',
        ':black:',
        'Device'
    ],
    '📟': [
        'Пейджер',
        ':pager:',
        'Біпер',
        'Кровожера'
    ],
    '📠': [
        'Факс в машині',
        ':fax_machine:',
        'Facsimile',
        'Факс'
    ],
    '🔋': [
        'Батарея',
        ':battery:',
        'Зарядний пристрій',
        'Акумулятор телефону'
    ],
    '🔌': [
        'Електрична зарядка',
        ':power_cable:',
        'AC Adaptor',
        'Стебл',
        'Електрозарядний пристрій'
    ],
    '💻': [
        'Ноутбук',
        ':laptop:',
        ':computer:',
        'Notebook',
        'Personal Computer',
        'PC',
        'MacBook',
        'Surface',
        'Device'
    ],
    '🖥️': [
        'Стільничний комп\'ютер',
        ':desktop_computer:',
        ':computer:',
        'iMac',
        'PC',
        'Device'
    ],
    '🖨️': [
        'Принтер',
        ':printer:',
        'Device'
    ],
    '⌨️': [
        'Computer Keyboard',
        ':keyboard:',
        ':computer_keyboard:'
    ],
    '🖱️': [
        'Комп\'ютерна Миша',
        ':computer_mouse:',
        'Три кнопки миші'
    ],
    '🖲️': [
        'Трекбол',
        ':trackball:'
    ],
    '💽': [
        'Комп\'ютерний диск',
        ':blu_ray:',
        'Minidisc',
        'ЦентрЗах',
        'DVD',
        'Сині промені',
        'BD'
    ],
    '💾': [
        'диск Фліппі',
        ':floppy_disk:',
        '3.5icip<unk> диск',
        'Диск'
    ],
    '💿': [
        'Оптичний диск',
        ':cd:',
        'ЦентрЗах',
        'CD-ROM',
        'Компактний диск'
    ],
    '📀': [
        'DVD',
        'DVD-прошивка',
        ':dvd:',
        'DVD відео'
    ],
    '🎥': [
        'Кінокамера',
        ':movie_camera:',
        'Кінокамера',
        'Голлівуд',
        'Фільми'
    ],
    '🎞️': [
        'Кадри фільму',
        ':film_frames:'
    ],
    '📽️': [
        'Монтажний Проектор',
        ':film_projector:'
    ],
    '📺': [
        'Телебачення',
        ':tv:',
        'ТВ'
    ],
    '📷': [
        'Цифрова камера',
        ':digital_camera:'
    ],
    '📸': [
        'Камера з Flash',
        ':camera_flash:'
    ],
    '📹': [
        'Відеокамера',
        ':video_camera:',
        'Відеокамера'
    ],
    '📼': [
        'Відеокасета',
        ':vhs:',
        'ПО ВХС',
        'VCR',
        'Відеозйомка',
        'Відеокасета'
    ],
    '💳': [
        'Кредитна Картка',
        ':credit_card:',
        'Дебетова картка',
        'АМЕкс',
        'Diners Club',
        'Американський експрес',
        'Карти Mastercard',
        'VISA картка'
    ],
    '📧': [
        'Е-пошта',
        ':email:',
        'Ел. пошта'
    ],
    '📨': [
        'Конверт вхідних повідомлень',
        ':incoming_envelope:',
        'Конверт з рядками',
        'Швидкий Конверт'
    ],
    '📩': [
        'Конверт із нижньою Стрілою вище',
        ':insert_in_envelope:',
        'Конверт Стрілки вниз',
        'Вставити в конверті'
    ],
    '📤': [
        'Зафіксувати трей',
        ':outbox_tray:'
    ],
    '📥': [
        'Вхідний лоток',
        ':inbox_tray:'
    ],
    '📮': [
        'Постбокс',
        ':postbox:'
    ],
    '📁': [
        'Папка файлу',
        ':file_folder:',
        'Тека',
        'Каталог',
        'Тека закритого файлу'
    ],
    '📂': [
        'Відкрити теку з файлом',
        ':open_file_folder:',
        'Каталог'
    ],
    '🗂️': [
        'Роздільники карт',
        ':card_index_dividers:'
    ],
    '📅': [
        'Календар',
        ':calendar:',
        '17 липня',
        'Всесвітній день емодзі'
    ],
    '🗓️': [
        'Спіральний календар',
        ':spiral_calendar_pad:'
    ],
    '📆': [
        'Tear-Off Calendar',
        ':day_calendar:',
        'Календар дня',
        'Настільний календар'
    ],
    '📈': [
        'Збільшення діаграми',
        ':increasing_chart:',
        'Позитивна діаграма',
        'Графік Вказівника',
        'Графік з тенденцією зростання'
    ],
    '📉': [
        'Графік зменшено',
        ':decreasing_chart:',
        'Від\'ємна діаграма',
        'Вниз розташування графіка',
        'Графік із Динамічним трендом'
    ],
    '📊': [
        'Гістограма',
        ':bar_chart:',
        'Графік Бара'
    ],
    '📌': [
        'Пушпін',
        ':pushpin:',
        'Thumb Tack',
        ':red:'
    ],
    '📋': [
        'Буфер обміну',
        ':clipboard:'
    ],
    '📍': [
        'Раунд Пушпін',
        ':round_pushpin:',
        'Втрачена зв\'язка',
        'Закріплення мапи',
        'Закріплення повідомлень',
        'Червона Пінка',
        ':red:'
    ],
    '📎': [
        'Корабельна зйомка',
        ':paperclip:',
        'Кліппі'
    ],
    '📏': [
        'Прямий правитель',
        ':straight_ruler:'
    ],
    '📐': [
        'Трикутний завод',
        ':triangular_ruler:',
        'Лінійка трикутників'
    ],
    '✂️': [
        'Ножиці',
        ':scissors:',
        'Різання'
    ],
    '✏️': [
        'Олівець',
        ':pencil:',
        'Свинець Олівець'
    ],
    '✒️': [
        'Чорна курячка',
        ':black_nib:',
        'Пен Ніб',
        'Фонтан Пен'
    ],
    '🖋️': [
        'Фонтан Пен',
        ':fountain_pen:',
        'Нижня ліва фонтан Пен'
    ],
    '🖊️': [
        'Ручка',
        ':pen:',
        'Нижня ліва кулькова ручка',
        'Обмежувальна Пен'
    ],
    '🖌️': [
        'Пензлик',
        ':paintbrush:',
        'Щітка',
        'Нижня ліва фарба'
    ],
    '🖍️': [
        'Crayon',
        ':crayon:',
        'Нижній лівий крейон'
    ],
    '📝': [
        'Примітка',
        ':memo:',
        'Memorandum',
        'Примітка',
        'Олівець та папери'
    ],
    '🗑️': [
        'Кошик для Сховища',
        ':wastepaper_basket:',
        'Сміття Можна',
        'Корпус Рубіша',
        'Мітка в кошику'
    ],
    '📡': [
        'Супутникова антена',
        ':satellite_antenna:'
    ],
    '🔭': [
        'Телескоп',
        ':telescope:',
        'Зоряна брама'
    ],
    '🔬': [
        'Мікроскоп',
        ':microscope:',
        'Magnify',
        'Наука'
    ],
    '📭': [
        'Відкрийте поштову скриньку з низьким рівнем',
        ':open_mailbox_lowered:'
    ],
    '📬': [
        'Відкрийте поштову скриньку з піднятим прапором',
        ':open_mailbox_raised:',
        'Відкрити поштову скриньку'
    ],
    '📪': [
        'Закрита поштова скринька з низьким рівнем',
        ':closed_mailbox_lowered:'
    ],
    '📫': [
        'Закрита поштова скринька з піднятим Прапором',
        ':closed_mailbox_raised:'
    ],
    '📰': [
        'Газета',
        ':newspaper:'
    ],
    '🗞️': [
        'Прискорена газета',
        ':rolled_up_newspaper:',
        'Доставка газети'
    ],
    '📄': [
        'Сторінка фасаду вгору',
        ':printed_page:',
        'Друкована сторінка'
    ],
    '📜': [
        'Прокрутка',
        ':scroll:',
        'Градус',
        'Parchment'
    ],
    '📃': [
        'Сторінка з Curl',
        ':curled_page:',
        'Curled Page',
        'Curly Page'
    ],
    '📓': [
        'Записник',
        ':notebook:',
        'Чорна і Біла книга'
    ],
    '📔': [
        'Блокнот з декоративною обкладинкою',
        ':notebook_decorative_cover:'
    ],
    '📕': [
        'Закрита книга',
        ':closed_book:',
        'Червона книга',
        'Червоний підручник',
        ':red:'
    ],
    '📖': [
        'Відкрити книгу',
        ':open_book:',
        'Книжка',
        'Роман'
    ],
    '📗': [
        'Зелена книга',
        ':green_book:',
        'Зелений підручник',
        ':green:'
    ],
    '📘': [
        'Блакитна книга',
        ':blue_book:',
        'Синій Підручник',
        ':blue:'
    ],
    '📙': [
        'Помаранчева книга',
        ':orange_book:',
        'Помаранчевий Підручник',
        ':orange:'
    ],
    '📚': [
        'Книжки',
        ':books:',
        'Купа книг',
        'Стек книг'
    ],
    '🗳️': [
        'Коробка з кульоком',
        ':ballot_box:',
        'Коробка голосування',
        'Голосування'
    ],
    '🗄️': [
        'Кабінет файлів',
        ':file_cabinet:',
        'Шафа для фільтрації'
    ],
    '🗃️': [
        'Файл картки',
        ':card_file_box:'
    ],
    '🖇️': [
        'Пов\'язані скріжки',
        ':linked_paperclips:',
        ':gray:',
        ':grey:'
    ]
};
/*clothes and accessories*/
emojis_language[lang][11] = {
    '👣': [
        'Місця розташування',
        ':footprints:',
        'Ноги',
        'Кроки харчування'
    ],
    '👓': [
        'Окуляри',
        ':glasses:',
        'Евейкелихи'
    ],
    '🕶️': [
        'Сонцезахисні окуляри',
        ':sunglasses:'
    ],
    '🥽': [
        'Захисні окуляри',
        ':goggles:'
    ],
    '🥼': [
        'Лабораторія',
        ':lab_coat:'
    ],
    '👔': [
        'Necktie',
        ':necktie:',
        'Бізнес-сорочка',
        'Сорочка та лють'
    ],
    '👕': [
        'Футболка',
        ':t_shirt:',
        ':t-shirt:',
        'Чайна сорочка',
        'Поло Ширт'
    ],
    '👖': [
        'Джинси',
        ':jeans:',
        'Джинса',
        'Штани',
        'Штани'
    ],
    '🧣': [
        'Scarf',
        ':scarf:'
    ],
    '🧤': [
        'Рукавиці',
        ':gloves:'
    ],
    '🧥': [
        'Плащ',
        ':coat:'
    ],
    '🧦': [
        'Socks',
        ':socks:'
    ],
    '👗': [
        'Сукня',
        ':dress:',
        'Спідниця',
        'Місто'
    ],
    '👘': [
        'Kimono',
        ':kimono:',
        'Дрезінська брама',
        'Японська сукня'
    ],
    '👙': [
        'Бікіні',
        ':bikini:',
        'Ванна',
        'Купальний костюм'
    ],
    '🩱': [
        'Полум’яний костюм',
        'одне_кус_костюма',
        'односторонній_купальник'
    ],
    '👚': [
        'Жінки одягу',
        ':womans_clothes:',
        'Жінки одягу',
        'Blouse',
        'Рожева сорочка',
        'Blouse'
    ],
    '👛': [
        'Гаманець',
        ':purse:',
        'Гаманець'
    ],
    '👜': [
        'Сумка',
        ':handbag:'
    ],
    '👝': [
        'Зчеплення мішок',
        ':clutch_bag:',
        'Зчеплення',
        'Малий мішок',
        'Pouch'
    ],
    '🎒': [
        'Рюкзак',
        ':backpack:',
        'Сумка',
        'Шкільний мішок',
        'Школа Сатчел',
        'Rucksack'
    ],
    '👞': [
        'Mans Shoe',
        ':mans_shoe:',
        'Mans Shoe',
        'Легке взуття',
        'Коричневе шоу',
        'Серіал Сукні'
    ],
    '👟': [
        'Атлетичний череп',
        ':athletic_shoe:',
        'Запущене черево',
        'Sneaker',
        'Бігун',
        'Тренування',
        'Теніс взуття'
    ],
    '🥾': [
        'Чоботи на посяганні',
        ':hiking_boot:'
    ],
    '🥿': [
        'Плоский череп',
        ':flat_shoe:'
    ],
    '👠': [
        'Тіль під ногою',
        ':high_heeled_shoe:',
        ':high_heel:',
        'Стилетто',
        'Високі підбори'
    ],
    '👡': [
        'Жінки Сандал',
        ':womans_sandal:',
        'Жінки Сандал',
        'Ладан Сандал',
        'Сандалі',
        'Sandal'
    ],
    '👢': [
        'Чоботи жінок',
        ':womans_boots_',
        'Чоботи жінок',
        'Коров\'яче Чоботи',
        'Покращені Чоботи',
        'Чоботи на підборах'
    ],
    '👑': [
        'Корона',
        ':crown:',
        'Король',
        'Королева',
        'Принц',
        'Роял',
        'Принцеса',
        ':gold:',
        ':yellow:'
    ],
    '👒': [
        'Капелюх',
        ':hat:',
        'Жіночий капелюх',
        'Капелюх з луком',
        'Леді-Хат'
    ],
    '🎩': [
        'Циліндр',
        ':top_hat:',
        'Формальне Знос',
        'Groom',
        ':black:'
    ],
    '🎓': [
        'Кепка випускника',
        ':graduation_cap:',
        'Коледж',
        'Випускний',
        'Дошка розчину',
        'Університет',
        'Квадратна академічна шапка',
        ':black:'
    ],
    '🧢': [
        'Кришка оплаченого рахунку',
        ':billed_cap:',
        'Бейсболка'
    ],
    '⛑️': [
        'Шолом з Білим Хрестом',
        ':helmet_with_white_cross:',
        ':helmet_with_cross:',
        ':rescue_worker_helmet:',
        ':rescue_workers_helmet:',
        'Шолом робітників',
        ':red:',
        ':white:'
    ],
    '💼': [
        'Портфель',
        ':briefcase:',
        'Валіза'
    ],
    '🎖️': [
        'Військова Медаль',
        ':military_medal:',
        ':medal:',
        'Медаль',
        'Медальйон',
        'Прикраса військ'
    ],
    '📿': [
        'Молитви',
        ':prayer_beads:',
        'Зікр',
        'Розарі Біс'
    ],
    '🎗️': [
        'Нагадування Ріббо',
        ':reminder_ribbo:'
    ],
    '🤿': [
        'Маска для пірнання',
        ':diving_mask:'
    ],
    '🦺': [
        'Безпечний жилет',
        ':safety_vest:'
    ],
    '🥻': [
        'Сарі',
        ':sari:',
        'Сарі',
        'Шарі'
    ],
    '🩲': [
        'Брифи',
        ':briefs:',
        'Undies',
        'Underwear',
        'Underpants',
        'Jocks',
        'Panties'
    ],
    '🩳': [
        'Шорти',
        ':shorts:'
    ],
    '🛼': [
        'Ковзання на роликах',
        ':roller_skate:',
        'Вбудований ковзант',
        'Роллер Дербі'
    ],
    '🩴': [
        'Віддзеркалити підлогу',
        ':flip_flop:',
        'Тхонг Сандал'
    ],
    '🪖': [
        'Військовий Шолом',
        ':military_helmet:'
    ],
    '🩰': [
        'Балет-Черевики',
        ':ballet_shoes:',
        'Пуант-Шо'
    ],
    '🩼': [
        'Crutch',
        ':crutch:'
    ]
};
/*hands and parts of body*/
emojis_language[lang][12] = {
    '👋{{skin_tone}}': [
        'Похмура рука',
        ':wave:',
        ':waving_hand:',
        'До побачення',
        'Хвиля рук',
        'Привіт',
        'Hi'
    ],
    '🖐️{{skin_tone}}': [
        'Рука з пальцями',
        ':hand_splayed:',
        ':raised_hand_with_fingers_splayed:',
        ':hand_with_fingers_splayed:',
        'П\'ять рук',
        'Зроблена рука',
        'Розв\'язана рука з пальцями'
    ],
    '🤚{{skin_tone}}': [
        'Піднятий спиною від рук',
        ':raised_back_of_hand:',
        ':back_of_hand:',
        'Диск'
    ],
    '✋{{skin_tone}}': [
        'Піднесена рука',
        ':raised_hand:',
        ':hand:',
        'Висока п\'ята',
        'Зупинити'
    ],
    '🖖{{skin_tone}}': [
        'Vulcan Salute',
        ':vulcan_salute:',
        'Spock',
        'Зоряний шлях',
        'Піднята Рука між частинами між малими і кільцями'
    ],
    '👌{{skin_tone}}': [
        'ОК знак руки',
        ':ok_hand:',
        'Добре',
        'Чудово',
        'Так'
    ],
    '✌️{{skin_tone}}': [
        'Рука Перемоги',
        ':victory_hand:',
        'Повітряні лапки',
        'Знак миру',
        'Підпис V'
    ],
    '🤞{{skin_tone}}': [
        'Підключені пальці',
        ':crossed_fingers:',
        'Відбитки пальця перейшли',
        'Успіх',
        'Рука об Індекс і середні пальці перейшла'
    ],
    '🤟{{skin_tone}}': [
        'Чудово, ви жести',
        ':love_you_gesture:',
        ':i_love_you_hand_sign:',
        'Я люблю тобі наш вказівник'
    ],
    '🤘{{skin_tone}}': [
        'Знак Рогів',
        ':the_horns:',
        ':sign_of_the_horns:',
        ':metal:',
        'Диявольські пальці',
        'Важкий метал',
        'На камені'
    ],
    '🤙{{skin_tone}}': [
        'Називай мене вказівкою руки',
        ':call_me_hand:',
        ':call_me:',
        'Рука телефону',
        'Шака'
    ],
    '🤏{{skin_tone}}': [
        'Щипча рука',
        ':pinching_hand:'
    ],
    '👈{{skin_tone}}': [
        'Backhand індекс вказівника зліва',
        ':backhand_index_pointing_left:',
        ':point_left:',
        'Білий лівий індекс панелі керування'
    ],
    '👉{{skin_tone}}': [
        'Назад справа',
        ':backhand_index_pointing_right:',
        ':point_right:',
        'Білий правий індекс Backhand'
    ],
    '👆{{skin_tone}}': [
        'Положення індексу Панелі керування вгору',
        ':point_up_2:',
        ':backhand_index_pointing_up:',
        'Білий індекс Pointing Backhand',
        'Середній палець'
    ],
    '👇{{skin_tone}}': [
        'Backhand індекс скорочення',
        ':point_down:',
        ':backhand_index_pointing_down:',
        'Індекс білого вниз Pointing Backhand',
        'Вказівник'
    ],
    '☝{{skin_tone}}': [
        'Індекс вказівника пальцем вгору',
        ':point_up:',
        ':index_pointing_up:',
        'Індекс білих віршів',
        'Секрет'
    ],
    '🖕{{skin_tone}}': [
        'Середній палець',
        ':middle_finger:',
        'Клип птаха',
        'Грубе Фінджер',
        'Зворотна Рука з Middle Finger Extended'
    ],
    '👍{{skin_tone}}': [
        'Маршрут вгору',
        ':thumbs_up_sign:',
        'Подобається',
        'Так'
    ],
    '👎{{skin_tone}}': [
        'Нижній знак вниз',
        ':thumbs_down_sign:',
        'Погано',
        'Dislike',
        'Ні'
    ],
    '✊{{skin_tone}}': [
        'Кінський кулак',
        ':raised_fist:',
        'Кулачний насос'
    ],
    '👊{{skin_tone}}': [
        'Незабутній кулак',
        ':oncoming_fist:',
        'Bro Fist',
        'Brofist',
        'Куля для купи',
        'Панч',
        'Замкнутий кулак',
        'Фістинований вказівник руки'
    ],
    '🤛{{skin_tone}}': [
        'Лівий кулак',
        ':left_fist_bump:'
    ],
    '🤜{{skin_tone}}': [
        'Прямий кулак',
        ':right_fist:bump:'
    ],
    '🤌{{skin_tone}}': [
        'Закріплені пальці',
        ':pinched_fingers:',
        'Ma Che Vuoi',
        'Гаманець для Пальців'
    ],
    '👏{{skin_tone}}': [
        'Знак перекриття',
        ':cap:',
        ':clapping_hands:',
        'Аплодисменти',
        'Clap',
        'Кліп',
        'Гольф Клап',
        'Круглі оплесків'
    ],
    '🙌{{skin_tone}}': [
        'Розвиток підсилення обох часток',
        ':raised_hands:',
        ':raising_hands:',
        'Виховання рук',
        'Зброя в повітрі',
        'Banzai',
        'Діва Фестива',
        'Hallelujah',
        'Похвала',
        'Дві руки'
    ],
    '👐{{skin_tone}}': [
        'Відкрити блок',
        ':open_hands_sign:',
        'Відтінок',
        'Джазові Генди'
    ],
    '🤲{{skin_tone}}': [
        'Подальші пальми',
        ':palms_up_together:',
        'Dua'
    ],
    '🤝{{skin_tone}}': [
        'Handshake',
        ':handshake:',
        'Руки струшування'
    ],
    '🙏{{skin_tone}}': [
        'Відкладені руки',
        ':folded_hands:',
        'Namaste',
        'Будь ласка',
        'Молитва',
        'Дякуємо Вам',
        'Людина з відкинутою рукою'
    ],
    '✍{{skin_tone}}': [
        'Рука писання',
        ':writing_hand:'
    ],
    '🫱{{skin_tone}}': [
        'Стрілка праворуч',
        ':rightwards_hand:'
    ],
    '🫲{{skin_tone}}': [
        'Рука ліворуч',
        ':leftwards_hand:'
    ],
    '🫳{{skin_tone}}': [
        'Рука Palm вниз',
        ':palm_down_hand:'
    ],
    '🫴{{skin_tone}}': [
        'Рука Palm',
        ':palm_up_hand:'
    ],
    '🫰{{skin_tone}}': [
        'Рука з Індекс Finger і Thumb перекреслена',
        ':hand_with_index_finger_and_thumb_crossed:'
    ],
    '🫵{{skin_tone}}': [
        'Пойнтинг індекса у вікні перегляду',
        ':index_pointing_at_the_viewer:'
    ],
    '🫶{{skin_tone}}': [
        'Руки серця',
        ':heart_hands:',
        'Любов'
    ],
    '💪{{skin_tone}}': [
        'Флешані Байцепси',
        ':flexed_biceps:',
        'Плексична зброя',
        'Musle',
        'Сильний'
    ],
    '🦵{{skin_tone}}': [
        'Нога',
        ':leg:'
    ],
    '🦶{{skin_tone}}': [
        'Стопа',
        ':foot:'
    ],
    '👂{{skin_tone}}': [
        'Вухо',
        ':ear:',
        'Вуха',
        'Слух',
        'Слухає'
    ],
    '👃{{skin_tone}}': [
        'Носе',
        ':nose:',
        'Згладжування',
        'Перехоплення',
        'Stinky'
    ],
    '🦻{{skin_tone}}': [
        'Рух з шаленою допомогою',
        ':ear_with_hearing_aid:'
    ],
    '🧠': [
        'Мізки',
        ':brain:',
        ':pink:'
    ],
    '🦷': [
        'Зуби',
        ':tooth:',
        ':white:'
    ],
    '👀': [
        'Очі',
        ':eyes:',
        'Ейбеллс',
        'Манелюбні очі',
        'Мудрі очі'
    ],
    '👁️': [
        'Око',
        ':eye:',
        'Одиночне око'
    ],
    '👅': [
        'Язик',
        ':tongue_out:',
        ':red:'
    ],
    '👄': [
        'Рот',
        ':mouth:',
        'Поцілункові губи',
        'Губи',
        ':red:'
    ],
    '🫦': [
        'Кусаюча губа',
        ':biting_lip:',
        'Губи',
        ':red:'
    ],
    '🫀': [
        'Анатомічне серце',
        ':anatomical_heart:',
        ':red:'
    ],
    '🫁': [
        'Легені',
        ':lungs:',
        ':red:'
    ],
    '🦾': [
        'Механічні руки',
        ':mechanical_arm:',
        'Сильний',
        ':gray:',
        ':grey:'
    ],
    '🦿': [
        'Механічні ноги',
        ':mechanical_leg:',
        ':gray:',
        ':grey:'
    ],
    '💅{{skin_tone}}': [
        'Ніл Польський',
        ':nail_polish:',
        'Пальці',
        'Manicure',
        'Nonchalant'
    ],
    '🤳{{skin_tone}}': [
        'Селфі',
        ':selfie:',
        'Камера телефону',
        'Селфі Рука'
    ],
    '🫸{{skin_tone}}': [
        'Rightwards Pushing Hand',
        ':rightwards_pushing_hand:'
    ],
    '🫷{{skin_tone}}': [
        'Leftwards Pushing Hand',
        ':leftwards_pushing_hand:'
    ]
};
/*other*/
emojis_language[lang][13] = {
    '💩': [
        'Купа Пуської',
        ':pile_of_poo:',
        'Собачий ґрунт',
        'Посмішка',
        ':brown:'
    ],
    '💋': [
        'Марка поцілунку',
        ':kiss_mark:',
        'Поцілункові губи',
        ':red:'
    ],
    '🦴': [
        'Кістка',
        ':bone:'
    ],
    '🧳': [
        'З багажем',
        ':luggage:',
        'Валіза'
    ],
    '🌂': [
        'Закрита парасолька',
        ':closed_umbrella:',
        'Згорнута парасолька',
        'Рожева парасолька',
        ':pink:',
        ':purple:'
    ],
    '☂️': [
        'Парасоля',
        ':umbrella:',
        ':purple:'
    ],
    '☔': [
        'Умбрелла з краплями дощем',
        ':umbrella_with_rain_drops:',
        ':umbrella:',
        'Дощ',
        'Rainy'
    ],
    '🧵': [
        'Огорожа ниток',
        ':spool_of_thread:'
    ],
    '🧶': [
        'Крен',
        ':ball_of_yarn:'
    ],
    '💄': [
        'Lipstick',
        ':lipstick:',
        'Глосарій з губ',
        'Макіяж',
        ':red:'
    ],
    '💍': [
        'Дзвінок',
        ':ring:',
        'Алмазне Кільце',
        'Заручники'
    ],
    '💎': [
        'камінь коштовного каміння',
        ':gem_stone:',
        'Алмаз',
        'Самоцвіт',
        'Гемстоун',
        'Джуел',
        ':blue:'
    ],
    '💥': [
        'Символи зіткнення',
        ':collision_symbol:',
        'Банг',
        'Вибух',
        'Зіткнення',
        'Червоний парк',
        'Вибух'
    ],
    '💫': [
        'Символ Діззі',
        ':dizzy_symbol:',
        'Круг і зірка',
        ':yellow:'
    ],
    '💦': [
        'Символи розплавлення',
        'викид_пітніння',
        'при_пітнілі дроплети',
        'Плевдс',
        'Розлив води',
        'Водяні випади',
        ':blue:'
    ],
    '💨': [
        'Винищувач',
        ':dashing_away:',
        'Швидко',
        'Пар',
        'Пастка',
        'Вітер',
        'Символ рядка',
        'Погруддя вітру'
    ],
    '🌬️': [
        'Обличчя вітру',
        ':wind_face:',
        'Хутер',
        'Мати природа',
        'Обличчя вітру',
        ':white:'
    ],
    '🐾': [
        'Призупинення принтів',
        ':paw_prints:',
        'Переваги для кішок папи',
        'Приставки собаки Папа',
        'Кіттен Пау',
        'Принципи Паку'
    ],
    '🕸️': [
        'Павутина',
        ':spider_web:',
        'Павутиння',
        'Веб',
        'Павутиння'
    ],
    '🦠': [
        'Мікроб',
        ':microbe:',
        'Комірка',
        'Коронавірус',
        'КОВІД-19',
        'Росток',
        'Мікроорганізми',
        'Вірус',
        ':green:'
    ],
    '💐': [
        'Букет з квітів',
        ':bouquet_of_flowers:'
    ],
    '🌍': [
        'Глобус що крутить Європу',
        ':globe_showing_europe_africa:',
        ':earth_africa:',
        'Земля',
        'Глобус',
        'Планета',
        'Світ',
        'Глобус показують Європу та Африку',
        ':blue:'
    ],
    '🌎': [
        'Глобус показує Америку',
        ':globe_showing_americas:',
        ':earth_americas:',
        'Земля',
        'Глобус',
        'Планета',
        'Світ',
        ':blue:'
    ],
    '🌏': [
        'Глобус шокується в Асія-Австралії',
        ':globe_showing_asia_australia:',
        ':earth_asia:',
        'Земля',
        'Глобус',
        'Планета',
        'Світ',
        'Глобус, що зображає Азію та Австралію',
        ':blue:'
    ],
    '🌐': [
        'Глобус із меридіанцями',
        ':globe_with_meridians:',
        'Інтернет',
        'Всесвітня павутина',
        'ЗхПдЗ'
    ],
    '🌑': [
        'Символ нового Місяця',
        ':new_moon:',
        'Темний Місяць',
        'Місяць тіні',
        'Сонячне затемнення',
        ':black:'
    ],
    '🌒': [
        'Символи сходження Місяця сходження',
        ':waxing_crescent_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌓': [
        'Перший символ Quarter Moon',
        ':first_quarter_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌔': [
        'Символи сходження живого Місяця',
        ':moon:',
        ':waxing_gibbous_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌕': [
        'Символ цілого місяця',
        ':full_moon:',
        ':yellow:'
    ],
    '🌖': [
        'Символ Гіббузового Місяця',
        ':waning_gibbous_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌗': [
        'Останній символ Quarter Moon',
        ':last_quarter_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌘': [
        'Символи Святого Мульця',
        ':waning_crescent_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌙': [
        'Півмісяць',
        ':crescent_moon:',
        ':yellow:'
    ],
    '🌚': [
        'Молодий місяць з очима',
        ':new_moon_with_face:',
        'Місяць кріпі',
        'Обличчя темного місяця',
        'Молестер Мун',
        ':black:',
        ':gray:',
        ':grey:'
    ],
    '🌝': [
        'Повні Місяці з обличчями',
        ':full_moon_with_face:',
        'Moonface',
        'Місячний смайлик',
        'Посвячений місяць',
        ':yellow:'
    ],
    '🌛': [
        'Перший місяць у четверті на обличчі',
        ':first_quarter_moon_with_face:',
        ':first_quarter_moon_face:',
        ':yellow:'
    ],
    '🌜': [
        'Останній квартал Місяць з обличчя',
        ':last_quarter_moon_with_face:',
        ':last_quarter_moon_face:',
        ':yellow:'
    ],
    '🌞': [
        'Сонце і його обличчя',
        ':sun_with_face:',
        'Смайл Сан',
        'Sunface',
        'Смілінське Сонце',
        ':yellow:'
    ],
    '☀️': [
        'НД',
        ':sun:',
        'Саншайн',
        ':yellow:'
    ],
    '⭐': [
        'Зірка',
        ':star:',
        'Біла середня зірка',
        ':yellow:'
    ],
    '🌟': [
        'Освітлена зірка',
        ':glowing_star:',
        'Сяюча зірка',
        ':yellow:'
    ],
    '☁️': [
        'Хмара',
        ':cloud:',
        'Хмарно',
        'Похмуро',
        ':white:'
    ],
    '⛅': [
        'Хмара сонця',
        ':thunder_cloud_and_rain:',
        ':thunder_cloud_rain:',
        ':cloud_with_lightning_and_rain:',
        ':white:'
    ],
    '⛈️': [
        'Хмара з блискавкою і дощем',
        ':thunder_cloud_and_rain:',
        ':thunder_cloud_rain:',
        ':cloud_with_lightning_and_rain:',
        'Грім-хмара',
        ':white:'
    ],
    '🌤️': [
        'Біле сонце з маленькою хмарою',
        ':mostly_sunny:',
        ':sun_behind_small_cloud:',
        ':sun_small_cloud:',
        ':white_sun_small_cloud:',
        ':white_sun_with_small_cloud:',
        ':white:'
    ],
    '🌥️': [
        'Велика хмара Сонця',
        ':sun_behind_large_cloud:',
        'Вайт-Нед Хмара',
        ':white:'
    ],
    '🌦️': [
        'Біле сонце і ясне хмари з дощем',
        ':sun_behind_rain_cloud:',
        ':partly_sunny_rain:',
        ':white_sun_rain_cloud:',
        ':white_sun_behind_cloud_with_rain:',
        ':white:'
    ],
    '🌧️': [
        'Хмара з дощем',
        ':cloud_with_rain:',
        ':white:'
    ],
    '🌨️': [
        'Хмара з снігом',
        ':cloud_with_snow:',
        ':white:'
    ],
    '🌩️': [
        'Хмара з блискавкою',
        ':cloud_with_lightning:',
        ':white:'
    ],
    '🌪️': [
        'Смерч',
        ':tornado:',
        'Хмара з торнадо'
    ],
    '🌫️': [
        'Fog',
        ':fag:',
        ':white:',
        ':gray:',
        ':grey:'
    ],
    '🌈': [
        'Веселка',
        ':rainbow:',
        'Гей-прайд',
        'Основна веселка',
        'ЛГБТЯ+',
        'ЛГБТ+'
    ],
    '❄️': [
        'Сніжинка',
        ':snowflake:',
        'Сніг',
        'Сніг',
        ':white:'
    ],
    '🌀': [
        'Циклон',
        ':cyclone:',
        'Ураган',
        'Спіраль',
        'Швірл',
        'Смерч'
    ],
    '⚡': [
        'Знак підвищеної напруги',
        ':high_voltage_sign:',
        'Блискавка Bolt',
        'Громобій',
        'Висока напруга'
    ],
    '☃️': [
        'Сніговик',
        ':snowman:',
        'Сніговик з сніжинками',
        ':white:'
    ],
    '⛄': [
        'Сніговик без снігу',
        'Снігова _без снігу',
        ':snowman:',
        'Фрості Сніговик',
        'Olaf',
        'Сніговик',
        ':white:'
    ],
    '☄️': [
        'Комета',
        ':comet:'
    ],
    '🔥': [
        'Вогонь',
        ':fire:',
        'Полум\'я',
        'Спекотно',
        'Lit',
        'Очеретянка',
        ':red:'
    ],
    '💧': [
        'Droplet',
        ':droplet:',
        'Вода',
        'Падіння води',
        ':blue:'
    ],
    '✨': [
        'Спаркл',
        ':sparkles:',
        'Гліттер',
        'Shiny',
        'Новий'
    ],
    '🌊': [
        'Хвиля води',
        ':water_wave:',
        'Пляж',
        'Хвилі океану',
        'Море',
        ':blue:'
    ],
    '🎄': [
        'Різдвяна ялинка',
        'жорстока_дерево',
        'Різдво',
        'Різдвяне Дерево',
        ':green:'
    ],
    '🎃': [
        'Джек-O-Ліхтар',
        'ліхтар',
        'Halloween',
        'Гарбуз',
        ':orange:'
    ],
    '🌻': [
        'Соняшник',
        ':sunflower:',
        'Жовта квітка',
        ':yellow:'
    ],
    '🌼': [
        'Blossom',
        ':blossom:',
        'Квітонька квітки',
        'Daisy',
        'Жовта квітка',
        ':yellow:'
    ],
    '🌷': [
        'Tulip',
        ':tulip:',
        ':pink:'
    ],
    '🌹': [
        'Квітка троянди',
        ':rose_flower:',
        'Червона Троянда',
        ':red:'
    ],
    '☘️': [
        'Шамрок',
        ':shamrock:',
        'Конюшина',
        'Трефойл',
        ':green:'
    ],
    '🍀': [
        'Чотири Листа Конюшина',
        ':four_leaf_clover:',
        'Конюшина',
        'Ірландія',
        'Щасливий',
        'Фортуна',
        ':green:'
    ],
    '🌸': [
        'Cherry Blossom',
        ':cherry_blossom:',
        'Рожева квітка',
        'Sakura',
        ':pink:'
    ],
    '💮': [
        'Біла Квітка',
        ':white_flower:',
        'Cherry Blossom',
        'Паперовий дойлі',
        'Відзнака Молода',
        ':white:'
    ],
    '🌺': [
        'Hibiscus',
        ':hibiscus:',
        ':red:'
    ],
    '🏵️': [
        'Розетка',
        ':rosette:',
        ':orange:',
        ':yellow:'
    ],
    '🌱': [
        'Проросток',
        ':seedling:',
        'Спрінг',
        'Sprout',
        'Падіння',
        ':green:'
    ],
    '🌲': [
        'Вічнозелене дерево',
        ':evergreen_tree:',
        'Дерево',
        'Сосна',
        ':green:'
    ],
    '🌳': [
        'Повільне дерево',
        ':deciduous_tree:',
        'Заокруглене дерево',
        ':green:'
    ],
    '🌴': [
        'Пальма',
        ':palm_tree:',
        'Дерево Кокосу',
        ':green:'
    ],
    '🎋': [
        'Танабата',
        ':tanabata_tree:',
        'Tanabata',
        'Дерево бажань'
    ],
    '🎍': [
        'Піратська декорація',
        ':pine_decoration:',
        'Бамбук',
        'Кадомацу',
        'Новорічна Прикраса'
    ],
    '🌵': [
        'Cactus',
        ':cactus:',
        'Desert',
        ':green:'
    ],
    '🌾': [
        'Рисовий лист',
        ':sheaf_of_rice:',
        'Кадрування',
        'Сільське господарство',
        'Пшениця',
        'Вуха Райса'
    ],
    '🌿': [
        'Трава',
        ':herb:',
        'Кадрування',
        'Рослина',
        ':green:'
    ],
    '🍁': [
        'Листок Мейпла',
        ':maple_leaf:',
        'Канада',
        'Канадець',
        'Клен',
        ':brown:'
    ],
    '🍂': [
        'Полеглий листок',
        ':fallen_leaf:',
        'Осінні листя',
        'Осіння листя',
        'Коричневе Листя',
        'Падіння листя',
        'Полегле листя',
        ':brown:'
    ],
    '🍃': [
        'Вітер',
        ':leaf_fluttering_in_wind:',
        ':leaves:',
        'Зелене листя',
        'Спрінг',
        ':green:'
    ],
    '🪴': [
        'Потитований завод',
        ':potted_plant:',
        ':green:'
    ],
    '🪸': [
        'Кораловий колір',
        ':coral:',
        'Зміна клімату'
    ],
    '🪷': [
        'Лотос',
        ':lotus:',
        'Міль',
        'Краса',
        'Спокій',
        'Спокій'
    ],
    '🪻': [
        'Hyacinth',
        ':hyacinth:',
        'Purple flower',
        ':purple:'
    ],
    '🫛': [
        'Pea Pod',
        ':pea_pod:',
        ':green:'
    ],
    '🫚': [
        'Ginger root',
        ':ginger:',
        'Spice',
        'Flavour',
        ':brown:'
    ],
    '🔑': [
        'Ключ',
        ':key:',
        'Золотий ключ',
        ':gold:',
        ':yellow:'
    ],
    '🗝️': [
        'Старий ключ',
        ':old_key:',
        ':brown:'
    ],
    '🔨': [
        'Молот',
        ':hammer:',
        'Хаммер казура',
        'Handyman',
        'Інструмент'
    ],
    '⛏️': [
        'Вибрати',
        ':pick:',
        'Кирка'
    ],
    '🪓': [
        'Сокира',
        ':axe:',
        'пожежник'
    ],
    '🪚': [
        'Теслярна пилка',
        ':carpentry_saw:'
    ],
    '🪛': [
        'Викрутка',
        ':screwdriver:'
    ],
    '🪝': [
        'Хук',
        ':hook:'
    ],
    '🪠': [
        'Plunger',
        ':plunger:'
    ],
    '🪣': [
        'Відро',
        ':bucket:'
    ],
    '🔩': [
        'Гайковий болт',
        ':nut_and_bolt:',
        'Болт',
        'Гвинт',
        ':gray:',
        ':grey:'
    ],
    '🗜️': [
        'Затискач',
        ':clamp:',
        'Злість таблиці',
        'WinZip',
        'Стиснення',
        ':gray:',
        ':grey:'
    ],
    '🔒': [
        'Заблоковано',
        ':locked:',
        'Закритий замок',
        'Навісний замок'
    ],
    '🔓': [
        'Розблоковано',
        ':unlocked:',
        'Відкрити Padlock',
        'Відкрити блокування'
    ],
    '🔏': [
        'Заблоковано Pen',
        ':locked_with_pen:',
        'Замок та Пен',
        'Замок із фонтаном Пен',
        'Блокування чорнильною ручкою'
    ],
    '🔐': [
        'Заблоковано ключем',
        ':locked_with_key:',
        'Закритий замок з ключем'
    ],
    '🗡️': [
        'Dagger',
        ':dagger:',
        'Зброя ножа',
        ':gray:',
        ':grey:'
    ],
    '⚔️': [
        'Перехрещено мечами',
        ':crossed_swords:',
        ':gray:',
        ':grey:'
    ],
    '🔫': [
        'Pistol',
        ':pistol:',
        'Зброя',
        'Револьвер',
        'Луската Гармата',
        'Водяний Кулемет',
        'Водяний пістоль'
    ],
    '🧰': [
        'Панель інструментів',
        ':toolbox:',
        ':red:'
    ],
    '🧲': [
        'Магніт',
        ':magnet:',
        ':red:'
    ],
    '💉': [
        'Syringe',
        ':syringe:',
        'Пожертвування крові',
        'Тест крові',
        'Голка',
        'Вакцина',
        'кров',
        'хворий',
        'ill'
    ],
    '🧬': [
        'ДНК',
        ':dna:',
        'Подвійний ДНК'
    ],
    '🧪': [
        'Тест труби',
        ':test_tube:',
        ':green:'
    ],
    '🛏️': [
        'Ліжко',
        ':bed:',
        'Спальня'
    ],
    '🛋️': [
        'Кушетка і лампа',
        ':couch_and_lamp:',
        'Кімната відпочинку',
        'Сетар',
        'Диван'
    ],
    '🪑': [
        'Стілець',
        ':chair:'
    ],
    '🚪': [
        'Двері',
        ':door:',
        'Дверний отвір',
        'Передні двері'
    ],
    '🪟': [
        'Вікно',
        ':window:'
    ],
    '🪜': [
        'Драбина',
        ':ladder:'
    ],
    '🪞': [
        'Дзеркало',
        ':mirror:'
    ],
    '🚽': [
        'Туалет',
        ':toilet:',
        'Ванна кімната',
        'Лу',
        'Вбиральня',
        'Тиждень',
        ':white:'
    ],
    '🚿': [
        'Душ',
        ':shower:',
        'Душова голова',
        ':shower:'
    ],
    '🛁': [
        'Ванна',
        ':bathtub:',
        'Бульбашка',
        ':shower:'
    ],
    '🧴': [
        'Лободна пляшка',
        ':location_bottle:'
    ],
    '🧷': [
        'Безпечна зв\'язка',
        ':safety_pin:',
        ':gray:',
        ':grey:'
    ],
    '🧺': [
        'Кошик',
        ':basket:',
        ':brown:'
    ],
    '🧻': [
        'Нахил паперу',
        ':roll_of_paper:',
        'Туалетний папір',
        ':white:'
    ],
    '🧼': [
        'Бар мила',
        ':bar_of_soap:',
        'Tidy',
        'Clean',
        'Scrub'
    ],
    '🧽': [
        'Губка',
        ':sponge:',
        ':yellow:'
    ],
    '🧯': [
        'Вогнегасник',
        ':fire_extinguisher:',
        ':red:'
    ],
    '🚬': [
        'Сигарета',
        ':cigarette:',
        'Димовий символ'
    ],
    '⚰️': [
        'Труна',
        ':coffin:',
        'Casket',
        'Похорон',
        ':brown:'
    ],
    '⚱️': [
        'Похоронна урна',
        ':funeral_urn:',
        'Ваза'
    ],
    '🛡️': [
        'Щит',
        ':shield:'
    ],
    '⚙️': [
        'Шестерня',
        ':gear:',
        'Налаштування',
        'Опції',
        ':gray:',
        ':grey:'
    ],
    '⚖️': [
        'Масштаб балансу',
        ':balance_scale:',
        'Луска справедливості'
    ],
    '⛓️': [
        'Ланцюжки',
        ':chains:'
    ],
    '🔗': [
        'Лінк',
        ':link:',
        'Ланцюг',
        'Гіперпосилання',
        'Зв\'язаний ланцюг',
        ':gray:',
        ':grey:'
    ],
    '⛓️‍💥': [
        'Broken chain',
        ':broken_chain:',
        'Chain',
        'Hyperlink',
        'Linked Chain',
        'Unlinked chain',
        ':gray:',
        ':grey:'
    ],
    '💀': [
        'Череп',
        ':skull:',
        'Смерть',
        'Сірий череп',
        'Скелет',
        ':white:'
    ],
    '☠️': [
        'Череп і кросбонес',
        ':skull_and_crossbones:',
        ':white:'
    ],
    '🎡': [
        'Чортове колесо',
        ':ferris_wheel:',
        'Велике колесо',
        'Fairgroundl',
        'Точне кермо'
    ],
    '⛽': [
        'Паливний насос',
        'p_насос:',
        'Нафта',
        'Бензин',
        'Газ',
        ':red:'
    ],
    '🚨': [
        'Поліцейський автомобіль револьверний',
        ':rotating_light:',
        ':police_police_car:',
        'Екстрений світло',
        'Прошивка світла',
        'Siren',
        ':red:'
    ],
    '🚥': [
        'Горизонтальний світлофора',
        ':horizontal_traffic_light:',
        ':green:',
        ':red:',
        ':yellow:',
        ':orange:'
    ],
    '🚦': [
        'Вертикальний світлофори',
        ':vertical_traffic_light:',
        ':green:',
        ':red:',
        ':yellow:',
        ':orange:'
    ],
    '⚓': [
        'Адміралтейський візерунок',
        ':anchor:',
        'Рибалка'
    ],
    '🚧': [
        'Реєстрація будівництва',
        ':construction_sign:',
        'Чорний та Жовтий знак',
        ':yellow:',
        ':black:'
    ],
    '🪂': [
        'Parachute',
        ':parachute:'
    ],
    '💺': [
        'Місце',
        ':seat:',
        'Автобусний поїзд Літака в Аероплан'
    ],
    '🪐': [
        'Сатурн',
        ':saturn:'
    ],
    '🎆': [
        'Феєрверк',
        ':fireworks:',
        'Вибух'
    ],
    '🎇': [
        'Senko Hanabi',
        ':senko_hanabi:',
        'Феєрверк Спарклер'
    ],
    '💷': [
        'Банкнота',
        ':pound:',
        ':pound_banknote:',
        'Примітка в £20',
        'Примітка Двадцять запитів',
        'Банкнот з фунтовим знаком',
        ':purple:'
    ],
    '💶': [
        'Euro Banknote',
        ':euro:',
        ':euro_banknote:',
        'Примітка до €100',
        'Банкнот з табличкою євро',
        ':blue:'
    ],
    '💵': [
        'Долар Банкнот',
        ':dollar:',
        ':dollar_banknote:',
        '$1 нотатка',
        'Банкнот з Знаком долара',
        'Долар Білл',
        'Американський долар',
        ':green:'
    ],
    '💴': [
        'Банкнот Єн',
        ':yen:',
        ':yen_banknote:',
        '¥ 1000 Нотатка',
        'Примітка Єна',
        'Банкнот з підписом Єни',
        ':yellow:'
    ],
    '⛺': [
        'Таборський намет',
        ':camping_tent:'
    ],
    '⛲': [
        'Фонтан',
        ':fountain:',
        'Водоподібність',
        'Водофонтан',
        'Парк'
    ],
    '💰': [
        'Кошик грошей',
        ':money_bag:',
        'Грошові пакети',
        'Багатий',
        '$'
    ],
    '💸': [
        'Гроші з крилами',
        ':money_with_wings:',
        'Літаючі гроші',
        ' Втрата грошей'
    ],
    '🏷️': [
        'Мітка',
        ':label_tag:'
    ],
    '🔖': [
        'Закладка',
        ':bookmark:',
        'Тег ціни',
        'Тег'
    ],
    '📑': [
        'Вкладки в закладки',
        ':bookmark_tabs:',
        ':white:'
    ],
    '📯': [
        'Поштовий ріг',
        ':postal_horn:',
        'Bugle',
        'Французький Ріг'
    ],
    '🪁': [
        'Кайт',
        ':kite:',
        ':purple:'
    ],
    '🪀': [
        'Йо-Йо',
        ':yo_yo:',
        ':yo-yo:'
    ],
    '🎊': [
        'Confetti Ball',
        ':confetti_ball:',
        'Confetti'
    ],
    '🎉': [
        'Партійний поппер',
        ':party_popper:',
        'Святкування',
        'Святковий капелюх'
    ],
    '🎈': [
        'Повітряна куля',
        ':balloon:',
        'Вечірка',
        'Червона куля',
        ':red:'
    ],
    '🌡️': [
        'Термометр',
        ':thermometer:',
        'Гаряча Погода',
        'Температура',
        ':red:'
    ],
    '🛢️': [
        'Бочка з нафтою',
        ':oil_drum:'
    ],
    '💣': [
        'Бомба',
        ':bomb:',
        'бум'
    ],
    '🔪': [
        'Кухонний ніж',
        ':kitchen_knife:',
        'Ніж',
        'Ніж м\'ясників',
        'Hocho'
    ],
    '🏺': [
        'Amphora',
        ':amphora:',
        'Банка',
        'Ваза'
    ],
    '🗺️': [
        'Карта світу',
        ':world_map:'
    ],
    '🎼': [
        'Музичний результат',
        ':musical_score:',
        'Ноти',
        'Treble Clef'
    ],
    '🎬': [
        'Кластерна дошка',
        ':clapper_board:',
        'Вирізати',
        'Дія',
        'Директор',
        'Кінопрокат'
    ],
    '🎻': [
        'Віолін',
        ':violin:',
        'Струнний квартет',
        'Найдрібніші світи'
    ],
    '🎺': [
        'Труба',
        ':trumpet:',
        'Ріг',
        'Джаз'
    ],
    '🎸': [
        'Гітара',
        ':guitar:',
        'Акустична гітара',
        'Бас-гітара',
        'Електрична гітара'
    ],
    '🎷': [
        'Саксофон',
        ':saxophone:',
        'Джаз',
        'Сакс'
    ],
    '🥁': [
        'Барабан',
        ':drum:',
        'Барабан з драмсточками'
    ],
    '🎹': [
        'Піаніно',
        ':piano:',
        'Музична клавіатура',
        ':white:',
        ':black:'
    ],
    '🪕': [
        'Банджо',
        ':banjo:'
    ],
    '🪗': [
        'Акордеон',
        ':accordion:'
    ],
    '🪘': [
        'Довгий барабан',
        ':long_drum:'
    ],
    '🎨': [
        'Художник Палета',
        ':artist_palette:',
        'Мистецтво',
        'Живопис'
    ],
    '🧩': [
        'Петля головоломок',
        ':puzzle_piece:',
        'Думки у головоломках',
        ':green:'
    ],
    '🎲': [
        'Грати',
        ':game_die:',
        'Дайс',
        ':white:'
    ],
    '🎭': [
        'Театральне мистецтво',
        'виконаний_мистецтво',
        'Театр',
        'Театр',
        'Драма-маски',
        'Грецький театр',
        'Трагедія та комедія маски',
        'Венеція'
    ],
    '🔍': [
        'Збільшувальне скло зліва',
        ':mag:',
        ':magnifying_glass_tilted_left:',
        'Magnifier',
        'Пошук значків',
        'Збільшення скла лівки',
        'Знайти',
        ':transparent:'
    ],
    '🔎': [
        'Збільшувальне скло вправо',
        ':mag_right:',
        ':magnifying_glass_tilted_right:',
        'Magnifier',
        'Пошук значків',
        'Збільшувальне скло правого штриха',
        'Знайти',
        ':transparent:'
    ],
    '⌛': [
        'Годинник завершено',
        ':hourglass:',
        ':hourglass_done:',
        'Пісковий годинник',
        'Time',
        'Egg timer',
        'Empty',
        'Ended',
        'Finished',
        'Sand Clock'
    ],
    '⏳': [
        'Годинник не завершено',
        ':hourglass_flowing_sand:',
        ':hourglass_not_done:',
        'Годинник із потоком піску',
        'Busy',
        'Time',
        'Egg timer',
        'Flowing',
        'Sand Clock'
    ],
    '🕐': [
        'Один OClock',
        ':clock1:',
        ':one_oclock:',
        'Годинник обличчя один OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕜': [
        'Годинник - одна тридцята',
        ':clock130:',
        ':one_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕑': [
        'Два OClock',
        ':clock2:',
        ':two_oclock:',
        'Годинник обличчя два OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕝': [
        'Годинник обличчя два тридцять',
        ':clock230:',
        ':two_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕒': [
        'Три околиці',
        ':clock3:',
        ':three_oclock:',
        'Годинник обличчя три OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕞': [
        'Годинник три роки',
        ':clock330:',
        ':three_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕓': [
        'Чотири OClock',
        ':clock4:',
        ':four_oclock:',
        'Годинник складається з чотирьох OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕟': [
        'Годинник чотири-тридцять',
        ':clock430:',
        ':four_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕔': [
        'П\'ять ударів',
        ':clock5:',
        ':five_oclock:',
        'Годинник п\'ять разів',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕠': [
        'Годинник - п\'ять тридцять років',
        ':clock530:',
        ':five_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕕': [
        'Шість OClock',
        ':clock6:',
        ':size_oclock:',
        'Годинник - шість разів',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕡': [
        'Годинник - шість - тридцять',
        ':clock630:',
        ':six_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕖': [
        'Сім Огодинників',
        ':clock7:',
        ':seven_oclock:',
        'Годинник без вітрил',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕢': [
        'Годинник - Севен-Тридцять',
        ':clock730:',
        ':sever_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕗': [
        'Вісім годинник',
        ':clock8:',
        ':eight_oclock:',
        'Годинник 8 разів',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕣': [
        'Годинник - вісімдесят три роки',
        ':clock830:',
        ':eight_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕘': [
        'Дев\'ять околиць',
        ':clock9:',
        ':nine_clock:',
        'Годинник - Nine OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕤': [
        'Годинник дев\'ятидесяти років',
        ':clock930:',
        ':nine_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕙': [
        'Десять Очаси',
        ':clock10:',
        ':ten_oclock:',
        'Годинник обличчя Ten OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕥': [
        'Годинник Тен-Тридті',
        ':clock1030:',
        ':ten_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕚': [
        'Eleven OClock',
        ':click11:',
        ':eleven_oclock:',
        'Годинник — одинадцять OClock',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕦': [
        'Годинник - одинадцята тридцять',
        ':clock1130:',
        ':eleven_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕛': [
        'Дванадцять OClock',
        ':clock12:',
        ':twelve_oclock:',
        'Годинник - дванадцять годинників',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '🕧': [
        'Годинник - дванадцять тридцять',
        ':clock1230:',
        ':twelve_thirty:',
        ':gray:',
        ':grey:',
        'Time'
    ],
    '♨️': [
        'Гот-Спрінгс',
        ':hot_springs:',
        'Onsen',
        'Пар',
        ':red:'
    ],
    '💈': [
        'Барбер-Поле',
        ':barber_pole:',
        'Магазин перукарні',
        'Барбери смуги',
        'Перукар',
        ':blue:',
        ':red:'
    ],
    '🎪': [
        'Цирк',
        ':circus_tent:',
        'Велика вершина',
        'Цирк'
    ],
    '💢': [
        'Символ Анджера',
        ':anger_symbol:',
        'Знак гнізда',
        'Вейн Поп',
        ':red:'
    ],
    '🗯️': [
        'Правий люк гнізда',
        ':right_anger_bubble:',
        ':anger_right:',
        'Zig Zag Bubble',
        'Злий Лист Булька',
        ':white:'
    ],
    '🗨️': [
        'Лівий Булька Мови',
        ':left_speech_bubble:',
        ':speech_left:'
    ],
    '💊': [
        'Pill',
        ':pill:',
        'Капсула',
        'Планшет',
        'Ліки',
        'Хворий',
        'ill',
        ':yellow:',
        ':red:'
    ],
    '🎎': [
        'Ляльки',
        ':dolls:',
        'Hinamatsuri',
        'Імперські ляльки',
        'Японські ляльки'
    ],
    '🎏': [
        'Карп Стрімер',
        ':carp_streamer:',
        'Стяг риби',
        'Koinobori',
        'Вітряні шкарпетки'
    ],
    '🎐': [
        'Шелест вітру',
        ':wind_chime:',
        'Furin',
        'Медузи',
        'Вітряний дзвін'
    ],
    '🎀': [
        'Стрічковий Лук',
        ':ribbon_bow:',
        'Рожевий лук',
        'Лук',
        ':pink:'
    ],
    '🎁': [
        'Втрачений подарунок',
        ':wrapped_gift:',
        'День народження',
        'Різдво Подарунок',
        'Подарунок',
        'Подарункова Коробка',
        'Подарунок',
        'Загорнуті дані'
    ],
    '🎫': [
        'Квиток',
        ':ticket:',
        'В центрі заявки',
        'Світовий тур'
    ],
    '🃏': [
        'Джокер',
        ':joker:',
        'Джокер Кард',
        'Грає в карту Black Joker'
    ],
    '💡': [
        'Лампочка',
        ':light_bulb:',
        'Ідея',
        'Електричний ліхтар'
    ],
    '🔦': [
        'Ліхтарик',
        ':flashlight:',
        'Смолоскип',
        'Електричний смолоскип'
    ],
    '🏮': [
        'Червоний ліхтар',
        ':izakaya_lantern:',
        ':lantern:',
        ':red_paper_lantern:',
        'Азійський ліхтар',
        'Японський ліхтар',
        'Червоний ліхтар',
        'Ізакая Ліхтар',
        ':red:'
    ],
    '📦': [
        'Пакет',
        ':package:',
        'Ящик',
        'Посилка',
        ':brown:'
    ],
    '📇': [
        'Індексувати картку',
        ':card_index:',
        'Родекс',
        'Системна картка',
        'Індекс картки'
    ],
    '🕳️': [
        'Отвір',
        ':hole:',
        ':black:'
    ],
    '👁️‍🗨️': [
        'Я — свідок',
        ':eye_in_speech_bubble:',
        ':eye_speech_bubble:',
        ':eye-in-speech-bubble:',
        'Чат ока'
    ],
    '⚜️': [
        'Fleur-de-lis',
        ':fleur_de_lis:',
        'Розвідники',
        'Нью-Орлінс Сейнтс'
    ],
    '⚗️': [
        'Alembic',
        ':alembic:'
    ],
    '🕯️': [
        'Свічка',
        ':candle:',
        ':white:'
    ],
    '🖼️': [
        'Зазначене зображення',
        ':framed_picture:',
        'Живопис',
        'Каркас',
        'Кадр з картинкою'
    ],
    '🛍️': [
        'Товари для покупок',
        ':shopping_bags:'
    ],
    '🛒': [
        'Кошик покупок',
        ':shopping_cart:',
        'Торгівля',
        ':shopping_trolley:',
        ':gray:',
        ':grey:',
        'Market'
    ],
    '🎟️': [
        'Заявки для входу',
        ':admission_tickets:',
        'Theater',
        'Theatre',
        'Party'
    ],
    '🛎️': [
        'Bellhop Bell',
        ':bellhop_bell:',
        ':yellow:',
        ':gold:',
        'Hotel',
        'Reception'
    ],
    '🧾': [
        'Чек',
        ':receipt:',
        ':white:',
        'Bill'
    ],
    '🧮': [
        'Abacus',
        ':abacus:'
    ],
    '🧫': [
        'Петрі Діш',
        ':petri_dish:'
    ],
    '🧹': [
        'Мітла',
        ':broom:',
        'Щітка',
        'Змести',
        ':yellow:',
        'Tidy',
        'Clean'
    ],
    '🎰': [
        'Слот-машина',
        ':slot_machine:',
        'Казино',
        'Фруктовий автомат',
        'Азартні ігри',
        'Комп\'ютер покеру'
    ],
    '🦽': [
        'Ручний інвалідний візок',
        ':manual_wheelchair:',
        ':wheelchair:',
        'invalid',
        'disability',
        'accessibility',
        'mobility'
    ],
    '🦼': [
        'Моторизований інвалідний візок',
        ':motorized_wheelchair:',
        ':wheelchair:',
        'invalid',
        'disability',
        'accessibility',
        'mobility'
    ],
    '🪔': [
        'Лампа Дія',
        ':diya_lamp:'
    ],
    '🦯': [
        'White Cane',
        ':whie_cane:'
    ],
    '🩸': [
        'Кров',
        ':drop_of_blood:',
        ':red:'
    ],
    '🩹': [
        'Зручний бинт',
        ':adhesive_bandage:'
    ],
    '🩺': [
        'Стетоскоп',
        ':stethoscope:'
    ],
    '🪶': [
        'Перо',
        ':feather:',
        'Animal'
    ],
    '🪤': [
        'Пастка миші',
        ':mouse_trap:'
    ],
    '🫖': [
        'Teapot',
        ':teapot:'
    ],
    '🪨': [
        'Скеля',
        ':rock:',
        ':gray:',
        ':grey:'
    ],
    '🪵': [
        'Деревина',
        ':wood:',
        ':brown:'
    ],
    '🪄': [
        'Чарівна паличка',
        ':magin_wand:'
    ],
    '🔮': [
        'Кришталевий м\'яч',
        ':crystal_ball:',
        'Clairvoyant',
        'Фортуна Теллер',
        'Психіка',
        'Бузковий Кристал',
        ':purple:'
    ],
    '🪅': [
        'Піненіата',
        ':pinata:',
        ':piñata:'
    ],
    '🪆': [
        'Наслідливі ляльки',
        ':nesting_dolls:',
        'Матрьошка'
    ],
    '🪡': [
        'Голка',
        ':swing_needle:'
    ],
    '🪢': [
        'Вузол',
        ':knot:',
        ':red:',
        ':blue:'
    ],
    '🪙': [
        'Монета',
        ':coin:'
    ],
    '🪃': [
        'Boomerang',
        ':boomerang:',
        ':brown:'
    ],
    '🪥': [
        'Зубна щітка',
        ':toothbrush:'
    ],
    '🪦': [
        'Надгробок',
        ':headstone:',
        ':gray:',
        ':grey:'
    ],
    '🪧': [
        'Placard',
        ':placard:'
    ],
    '🪒': [
        'Разор',
        ':razor:'
    ],
    '🫙': [
        'Банка',
        ':jar:',
        ':transparent:'
    ],
    '🛞': [
        'Колесо',
        ':wheel:',
        'Автомобілі',
        'Автомобілі',
        ':black:'
    ],
    '🛟': [
        'Рятувальне круг',
        ':ring_buoy:',
        'Життєвий консервер',
        'Життєве кільце',
        'Човни',
        'Безпека',
        'Вода',
        'Лайфсавінг',
        ':red:',
        ':white:'
    ],
    '🪬': [
        'Hamsa',
        ':hamsa:',
        'Islam',
        'Юдаїзм',
        'Buddhism',
        'Християнство',
        'Релігії',
        'Удача',
        'Захист',
        'Супровід',
        'Фемінінова влада',
        'Віра',
        ':blue:'
    ],
    '🪩': [
        'Дзеркальна куля',
        ':mirror_ball:',
        'Диско-бал'
    ],
    '🪫': [
        'Низький заряд батареї',
        ':low_battery:',
        ':red:',
        'Енергія',
        'Червоний',
        'Device',
        'Smartphone',
        'Computer',
        'Console'
    ],
    '🩻': [
        'Рентген',
        ':x_ray:',
        ':x-ray:',
        ':blue:'
    ],
    '🫧': [
        'Бульбашки',
        ':bubbles:',
        'Милові суди',
        'Карбонування',
        'Єферентативність',
        ':transparent:'
    ],
    '🪪': [
        'Ідентифікаційна картка',
        ':identification_card:',
        'Тотожність',
        'Паспорт',
        'ID',
        'Country',
        'Security',
        'Travel'
    ],
    '🧿': [
        'Nazar Amulet',
        ':nazar_amulet:',
        'Зловісне око',
        ':blue:'
    ],
    '🧸': [
        'Тедді Ведмідь',
        ':teddy_bear:',
        'Іграшка',
        ':brown:',
        'Baby',
        'Child',
        'Children'
    ],
    '🪽': [
        'Wing',
        ':wing:',
        'Fly',
        ':white:'
    ],
    '🪭': [
        'Folding Hand Fan',
        ':folding_hand_fan:',
        'Fan',
        'Manual fan',
        'Summer',
        ':red:'
    ],
    '🪮': [
        'Hair Pick',
        ':hair_pick:',
        'Black culture',
        'Black pride',
        ':black:'
    ],
    '🪈': [
        'Flute',
        ':flute:',
        'Plastic flute',
        'Metal plute',
        'Bamboo flute',
        'Musical instrument',
        ':brown:'
    ],
    '🪇': [
        'Maracas',
        ':maracas:'
    ]
};