// descriptions took from Emojipedia.org
lang = 'ar';
//use i18n language code of the browser, more details: https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/API/i18n/LanguageCode
titles_language[lang] = {
    '🔍': 'النتائج',
    '🕒': 'الرموز التعبيرية الأكثر استخداما',
    '😀': 'ابتسامات',
    '🙋': 'الناس',
    '🦊': 'الحيوانات',
    '🅰️': 'الرموز',
    '🍎': 'الغذاء والمشروبات',
    '🏳️‍🌈': 'الأعلام',
    '🏊': 'الرياضة',
    '✈️': 'السفر والأماكن',
    '🖱️': 'التكنولوجيات والمكتب',
    '👗': 'الملابس والملحقات',
    '🖐️': 'الأيدي وأجزاء من الجسم',
    '🛎️': 'فئة أحرى'
};
emojis_language[lang] = [];
/*search*/
emojis_language[lang][0] = {};
/*smileys*/
emojis_language[lang][2] = {
    '😀': [
        'واجهة الغضب',
        ':)',
        'وجه سعيد',
        'الوجه المبتسم'
    ],
    '😃': [
        'غمر الوجه بالعين الكبيرة',
        ':D',
        'وجه سعيد',
        'الوجه المبتسم',
        'ابتسامة بالوجه مع فتحة القالب'
    ],
    '😄': [
        'غمر الوجه بالعين المبتسمة',
        'وجه سعيد',
        'الوجه المبتسم',
        'غضب الوجه مع العيون المبتهجة',
        'ابتسامة بالوجه مع عيون مفتوحة وبتسامة'
    ],
    '😁': [
        'وجه مع عيون الابتسامة',
        'غمر الوجه بالعين المبتسمة'
    ],
    '😆': [
        'واجهة المطهر',
        'xD',
        '><',
        'جرين كبير',
        'ابتسامة العيون المغلقة',
        'غضب',
        'غمر الوجه مع عيون مغلقة بشدة',
        'ابتسامة بالوجه مع العيون المفتوحة و العيون المغلقة بصوت قصير'
    ],
    '😅': [
        'غمر الوجه بالحلوة',
        'تمرين',
        'حلاقة سعيدة',
        'غمر الوجه مع العيون المتقطعة والسقوط الحلوي',
        'ابتسامة بالوجه مع الفتح والحلاقة الباردة'
    ],
    '🤣': [
        'ROFL',
        'الدوران على أرضية الابنة'
    ],
    '😂': [
        'وجه مع دموع الجاه',
        'غضب',
        'بكاء الاصطناعي',
        'دموع متنقلة',
        'قهرية'
    ],
    '🙂': [
        'وجه مبتسم طفيف',
        ':)',
        'سعيد قليلاً',
        'هذا جيد'
    ],
    '🙃': [
        'الوجه الأعلى-للأسفل',
        'Sarcasm',
        'Silly',
        'الوجه إلى الأسفل'
    ],
    '😉': [
        'الوجه الفوز',
        ';)',
        'ورق',
        'وجه ورقي',
        'الوجه الوهمي'
    ],
    '😊': [
        'ابتسامة الوجه بالعين المبتسمة',
        '^^',
        'وجه سعيد',
        'ابتسامة',
        'الوجه المبتسم'
    ],
    '😇': [
        'ابتسامة الوجه مع الهالو',
        'الملاك',
        'هالو'
    ],
    '🥰': [
        'ابتسامة الوجه مع القلب',
        'في وجه الحب',
        'يبتسم الوجه بالعين المبتسمة وثلاثة قلوب'
    ],
    '😍': [
        'ابتسامة الوجه بالعين القلبية',
        '*.*',
        'عيون القلب',
        'وجه القلب',
        'ابتسامة الوجه بالعين على شكل القلب'
    ],
    '🤩': [
        'هيكل النجوم',
        'متحمس',
        'عيون النجوم',
        'غائم النجم',
        'وجه Wow',
        'وجه مع عيون النجوم',
        'غمر الوجه بالعين النجمية'
    ],
    '😘': [
        'زرع قبيلة بالوجه',
        ':*',
        ':-*',
        'قبلة قبيلة',
        'قبيلة التوهج',
        'كيس',
        'وجه رمي قبيلة'
    ],
    '😗': [
        'كيس الوجه',
        ':*',
        ':-*',
        'وجه العربة',
        'Kissy Face',
        'تصفير'
    ],
    '☺️': [
        'وجه الابتسامة',
        'وجه سعيد',
        'الوجه المبتسم',
        'ابتسم',
        'وجه ابتسامة بيضاء'
    ],
    '😚': [
        'كيس الوجه بالعيون المغلقة',
        'وجه القِبَلة',
        'Kissy Face'
    ],
    '😙': [
        'كيس الوجه مع عيون الابتسامة',
        'وجه القِبَلة',
        'Kissy',
        'تصفير',
        'تصفير'
    ],
    '😋': [
        'طعام حفظ الوجه',
        'غضب',
        'جائع',
        'ابتسامة كلمات القص بالوجه',
        'حفظ الوجه للطعام الرائع',
        'يوم يوم'
    ],
    '😛': [
        'وجه مع التونغي',
        ':P',
        'شيكي',
        'وجه التونج',
        'النغمة',
        'وجه مع اللونج المخرج'
    ],
    '😜': [
        'الفوز بالوجه مع التونغي',
        ';P',
        'مجنون',
        'الوجه المجنون',
        'الفوز بالوجه مع اللونج المخرج',
        'وجه مع اللونج المخرج و العين الفوز'
    ],
    '🤪': [
        'Zany Face',
        'عيون جنونية',
        'متحمس',
        'برية',
        'Goofy Face',
        'غمر الوجه بعين واحد كبير وعين واحد صغير'
    ],
    '😝': [
        'واجهة مع التونغي',
        'xP',
        'النغمة',
        'الوجه مع عصا التونغو و و عيون مغلقة قفزة',
        'وجه مع قنبلة العين المغلقة بالقوة'
    ],
    '🤑': [
        'وجه المال',
        ':$',
        'عيون علامة الدولار',
        'وجه المال',
        'غني'
    ],
    '🤗': [
        'وجه القفز',
        'ضغطة',
        'قنبلة',
        'سماعات',
        'وجه سعيد مع اليد الغارقة'
    ],
    '🤭': [
        'عفوا',
        'وجه مع اليد فوق الفم',
        'ابتسامة الوجه مع عيون ابتسامة و غطاء البحر اليدوي'
    ],
    '🤫': [
        'شه',
        'إشاعة',
        'وجه مزعج',
        'شحذ',
        'هادئ',
        'صمت',
        'صامت',
        'وجه مع غطاء الأصابع المغلقة'
    ],
    '🤔': [
        'ماذا',
        '?',
        'همم',
        'وجه للتفكير',
        'دردشة تومب',
        'المفكر',
        'رمي الظل'
    ],
    '🤐': [
        'مضغوطة',
        'وجه Zipper-Mouth',
        'الشفائح المختومة',
        'الشفافات المختومة',
        'الرمز البريدي',
        'وجه مع قالب زيبر'
    ],
    '🤨': [
        'وجه مع العيب المرتفع',
        'كولبرت',
        'الصخرة',
        'وجه مع العيب المرتفع',
        'وجه مع عيان واحد مرتفع'
    ],
    '😐': [
        'الوجه المحايد',
        ':|',
        'وجه مع الفم المستقيم',
        'مواجهة مستقيمة'
    ],
    '😑': [
        'وجه غير معبر',
        '-_-',
        'وجه مع الفم المستقيم',
        'وجه مستقيم'
    ],
    '😶': [
        'وجه بدون مصباح',
        'وجه فارغ',
        'عديم',
        'صمت',
        'صامت'
    ],
    '😏': [
        'وجه الاستهزاء',
        'تطير',
        'الوجه الجنسي',
        'وجه الحبوب',
        'ابتسامة مقترحة'
    ],
    '😒': [
        'وجه غير مسمى',
        'غير راضٍ',
        'ميه',
        'العين الجانبي',
        'غير مثير للإعجاب'
    ],
    '🙄': [
        'وجه مع العيون المتدحرجة',
        'عين رملي'
    ],
    '😬': [
        'وجه غضب',
        'أووكوارد',
        'Eek',
        'القدم في جبل',
        'نيفوسي',
        'أفضل صديق مشترك لـ Snapchat #1'
    ],
    '🤥': [
        'وجه مغاير',
        'كاذب',
        'أنف طويل',
        'Pinocchio'
    ],
    '😌': [
        'الوجه المعوق',
        'محتوى',
        'مستأجرة'
    ],
    '😔': [
        'آسف',
        'وجه جنائي',
        'عقابي',
        'حزين',
        'الصادق',
        'حزن',
        'وجه جنبي حزين'
    ],
    '😪': [
        'وجه عازف',
        'الدموع الجانبي',
        'فقاعات الشبيهة'
    ],
    '🤤': [
        'ساليفا',
        'Drooling Face',
        'Drool'
    ],
    '😴': [
        'وجه النوم',
        'زتز',
        'الوجه السكون',
        'نَحْن',
        'وجه Zzz'
    ],
    '🥱': ['وجه الفتح'],
    '😷': [
        'وجه مع قناع طبي',
        'فيروس كورونا',
        'COVID-19',
        'قناع الوجه',
        'قناع جراحي'
    ],
    '🤒': [
        'وجه مع مقياس الحرارة',
        'Ill',
        'مريض'
    ],
    '🤕': [
        'وجه مع الضمادات الرئيسية',
        'رأس مقطوع',
        'سحابة',
        'مؤثر'
    ],
    '🤢': [
        'الوجه الموقوف',
        'قسيس',
        'الوجه الأخضر',
        'فيميت'
    ],
    '🤮': [
        'كسر الوجه',
        'سرعة',
        'Bleah',
        'Bleurgh',
        'يوك',
        'عالقة',
        'إيو',
        'سرعة',
        'الرمي للأعلى',
        'فيميت',
        'وجه مع كسر الفم المفتوح'
    ],
    '🤧': [
        'عطس الوجه',
        'Gesundheit'
    ],
    '🥵': [
        'وجه ساخن',
        'الوجه الزائد السخونة'
    ],
    '🥶': [
        'وجه بارد',
        'رائع',
        'منزل',
        'وجه التجميد'
    ],
    '🥴': [
        'وجه ووزي',
        'وجه الإسطوانة',
        'وجه مع العيون المتباينة وقماش الفاتح'
    ],
    '😵': [
        'Dizzy Face',
        'وجه عبر العيون',
        'وجه العيون الدائرية'
    ],
    '🤯': [
        'تفجير الرأس',
        'مهرج العقل',
        'وجه صدم برأس التفجير'
    ],
    '🤠': [
        'وجه القبعة',
        'الكبوت',
        'وجه المذنب',
        'وجه مع قبعة القبعة'
    ],
    '🥳': [
        'الوجه المتزوج',
        'وجه الحفل',
        'وجه مع قرن الحفل وقبعة الحفل'
    ],
    '😎': [
        'ابتسامة الوجه بنظارات شمسية',
        'رائع',
        'أفضل أصدقاء متبادلين (السنادشة)',
        'نظارات شمسية'
    ],
    '🤓': [
        'وجه مشرق',
        'Nerdy'
    ],
    '🧐': ['وجه مع Monocle'],
    '😕': [
        'وجه مشتت',
        ':/',
        ':S',
        'غير مضافة',
        'محير'
    ],
    '😟': [
        'وجه مقلق',
        ':(',
        'حزين',
        'الصادق'
    ],
    '🙁': [
        'وجه القذف البسيط',
        ':(',
        'حزين بقليل'
    ],
    '☹️': [
        'وجه الإغراق',
        ':(',
        'ميغافون',
        'وجه القذف الأبيض'
    ],
    '😮': [
        'واجهة',
        ':O',
        'يا إلهي!',
        'وجه مع فتح الفم',
        'فتح الفم',
        'واجهة مفاجئة مع فتح القالب'
    ],
    '😯': [
        'وجه مشحون',
        ':O',
        'مفاجأة',
        'وجه مفاجئ'
    ],
    '😲': [
        'وجه صدم',
        ':O',
        'واجهة',
        'الوجه المصيد',
        'وجه الإسطوانة',
        'واجهة الغاز'
    ],
    '😳': [
        'وجه مضغوط',
        ':$',
        'الوجه المدمر',
        'مجنون',
        'العار',
        'وجه مع العيون المفتوحة'
    ],
    '🥺': [
        'الوجه الرائد',
        ':(',
        'النزول',
        'عيون المسقط',
        'Simp',
        'وجه مع قيادة العيون'
    ],
    '😦': [
        'عرض الوجه مع فتح البحر',
        'دان:',
        'النزول'
    ],
    '😨': [
        'عجبت',
        'دان:',
        'وجه مخيف',
        'مدهش'
    ],
    '😰': [
        'وجه متعب مع الحلو',
        'الوجه الأزرق',
        'الوجه المثير للقلق',
        'وجه عنيف',
        'وجه مع الفتح والحلاقة الباردة'
    ],
    '😥': [
        'واجهة حزينة ولكن تم إعاقتها',
        ':\'(',
        'حلاقة عيسى',
        'وجه مخيب للآمال ولكنه معوق'
    ],
    '😢': [
        'بكاء الوجه',
        ':\'(',
        'البكاء',
        'دموع'
    ],
    '😭': [
        'وجه لودلي',
        'Bawling',
        'البكاء',
        'دموع حزينة',
        'Sobbing'
    ],
    '😱': [
        'شاشة الوجه في الخوف',
        'المنزل وحده',
        'سكرام',
        'الوجه الظاهر'
    ],
    '😖': [
        'وجه معتمد',
        'تفكيك الفم',
        'وجه متقطع'
    ],
    '😣': [
        'المثابرة على الوجه',
        'وجه لا حول له',
        'عيون سكر'
    ],
    '😞': [
        'الوجه المخيب للآمال',
        ':(',
        'حزين',
        'الصادق'
    ],
    '😓': [
        'تنزيل الوجه مع الحلوى',
        'العمل الشاق',
        'وجه حزين',
        'وجه مع الحلاقة الباردة'
    ],
    '😩': [
        'وجه الوزن',
        'الوجه المعطل',
        'الإبحار'
    ],
    '😫': [
        'الوجه الملك',
        'مستنفد',
        'رفع الاحتياطي الفيدرالي',
        'الوجه المعطل'
    ],
    '😤': [
        'وجه مع ستيم من الأنف',
        'انتداب المظالم',
        'محبطة',
        'الوجه المجنون',
        'الخردة',
        'الضغائن مع وجه الغضب'
    ],
    '😡': [
        'وجه اللمس',
        'الوجه الغاضب',
        'الوجه الكبير',
        'الوجه المجنون',
        'الوجه الأحمر'
    ],
    '😠': [
        'الوجه الغاضب',
        'غاضب',
        'الوجه الكبير'
    ],
    '🤬': [
        'تجميل',
        '@#$%&!',
        'وجه مع الرموز على الفم',
        'اللعنة',
        'خادم',
        'Grawlix',
        'وجه مع الرموز عبر الفم',
        'وجه جدي مع الرموز التي تغطي الفم'
    ],
    '🥲': ['ابتسامة بالوجه مع الدموع'],
    '😮‍💨': [
        'كشف الوجه',
        'فطيرة'
    ],
    '😵‍💫': [
        'وجه مع عيون حلزونية',
        'Dizzy Face'
    ],
    '🥸': ['الوجه المخفي'],
    '🫠': ['Melting Face'],
    '🫢': ['Face with Open Eyes and Hand Over Mouth'],
    '🫣': ['Face with Peeking Eye'],
    '🫡': [
        'Saluting Face',
        'Military',
        'Army',
        'RAF',
        'Navy'
    ],
    '🫥': ['Dotted Line Face'],
    '🫤': ['Face with Diagonal Mouth'],
    '🥹': ['Face Holding Back Tears'],
    '😈': [
        'ابتسامة الوجه مع القرون',
        'الشرير',
        'قرن شرير',
        'شيطان سعيد',
        'الشرير الأرجواني',
        'الشرير الأحمر'
    ],
    '👿': [
        'وجه غاضب مع القرون',
        'الشرير',
        'قرن شرير',
        'الشرير الأرجواني',
        'جبلن أرجواني',
        'الشرير الحزين',
        'Imp'
    ],
    '🤡': [
        'وجه المهرج',
        'المهرج الرهيب',
        'المهرج الشرير',
        'المهرج المخيف'
    ],
    '👽': [
        'غريب',
        'ET'
    ],
    '👾': [
        'وحش أجنبي',
        'غاز الفضاء',
        'وحش لعبة الفيديو'
    ],
    '🤖': [
        'Robot',
        'وجه الروبوت'
    ],
    '👹': [
        'Ogre',
        'قناع الوجه',
        'Oni',
        'وحش أحمر',
        'أوغري ياباني'
    ],
    '👻': [
        'الشبح',
        'Halloween'
    ],
    '🗣️': [
        'رأس ناطق',
        'الشاطئ',
        'رسالة',
        'التقاط',
        'رأس متحدث في سيلويت'
    ],
    '👤': [
        'لعنة في سيلويت',
        'ظل',
        'Silhouette',
        'المستخدم',
        'سيلويت للشخص'
    ],
    '🫂': ['الناس يقطعون'],
    '👥': [
        'باصات في سيلويت',
        'الظلال',
        'Silhouettes',
        'المستخدمون',
        'سيلويت لشخصين'
    ]
};
/*people*/
emojis_language[lang][3] = {
    '👶{{skin_tone}}': [
        'طفل',
        'طفل',
        'متدرب'
    ],
    '🧒{{skin_tone}}': [
        'طفل',
        'الطفل المحايد جنسانيا'
    ],
    '👧{{skin_tone}}': ['فتاة'],
    '🧑{{skin_tone}}': [
        'شخص',
        'البالغون المحايدون جنسانيا',
        'الكبار'
    ],
    '🧑{{skin_tone}}': [
        'Person: Beard',
        'Beard',
        'Bearded Person',
        'Bearded Person'
    ],
    '🧑{{skin_tone}}‍🦰': [
        'Person: Red Hair',
        'Ginger Person',
        'Person Redhead',
        'Person With Red Hair'
    ],
    '🧑{{skin_tone}}‍🦱': [
        'Person: Curly Hair',
        'Person With Curly Hair'
    ],
    '🧑{{skin_tone}}‍🦳': [
        'Person: White Hair',
        'Person With Gray Hair'
    ],
    '🧑{{skin_tone}}‍🦲': [
        'Person: Bald',
        'Person With No Hair'
    ],
    '👱{{skin_tone}}': [
        'الشخص: الشعر المليء',
        'Person With Blonde Hair'
    ],
    '👨{{skin_tone}}': [
        'رجل',
        'ذكر',
        'رجل الماستاشي'
    ],
    '🧔{{skin_tone}}‍♂️': [
        'Man: Beard',
        'Beard',
        'Bearded Man',
        'Bearded Person'
    ],
    '👨{{skin_tone}}‍🦰': [
        'الرجل: شعر أحمر',
        'رجل الجينجر',
        'Man Redhead',
        'رجل ذو شعر أحمر'
    ],
    '👨{{skin_tone}}‍🦱': [
        'الرجل: شعر عاطفي',
        'رجل مع شعر كوري'
    ],
    '👨{{skin_tone}}‍🦳': [
        'الرجل: شعر أبيض',
        'رجل مع شعر رمادي'
    ],
    '👨{{skin_tone}}‍🦲': [
        'الرجل: بالد',
        'رجل بدون شعر'
    ],
    '👱{{skin_tone}}‍♂️': [
        'الرجل: الشعر الوهمي',
        'رجل مع شعر بلوندي'
    ],
    '👩{{skin_tone}}': [
        'امرأة',
        'أنثى',
        'سيدة',
        'المرأة الصفراء'
    ],
    '🧔{{skin_tone}}‍♀️': [
        'Woman: Beard',
        'Beard',
        'Bearded Woman'
    ],
    '👩{{skin_tone}}‍🦰': [
        'المرأة: شعر أحمر',
        'امرأة الجينجر',
        'Woman Redhead',
        'امرأة مع شعر أحمر'
    ],
    '👩{{skin_tone}}‍🦱': [
        'المرأة: شعر كعادي',
        'امرأة مع شعر كوري'
    ],
    '👩{{skin_tone}}‍🦳': [
        'المرأة: شعر أبيض',
        'امرأة مع شعر رمادي'
    ],
    '👩{{skin_tone}}‍🦲': [
        'المرأة: بالد',
        'امرأة بدون شعر'
    ],
    '👱{{skin_tone}}‍♀️': [
        'المرأة: شعر بلوند',
        'المرأة مع شعر بلوندي'
    ],
    '🧓{{skin_tone}}': [
        'Older Person',
        'Gender Neutral Older Adult'
    ],
    '👴{{skin_tone}}': [
        'Old Man',
        'Elderly Man',
        'Grandpa',
        'Older Man'
    ],
    '👵{{skin_tone}}': [
        'Old Woman',
        'Elderly Woman',
        'Grandma',
        'Nanna',
        'Old Lady',
        'Older Woman'
    ],
    '👼{{skin_tone}}': [
        'Baby Angel',
        'Angel',
        'Cherub',
        'Cupid',
        'Putto'
    ],
    '👨{{skin_tone}}‍🎄': [
        'Santa Claus',
        'Saint Nicholas',
        'Sinterklaas',
        'Father Christmas'
    ],
    '👩{{skin_tone}}‍🎄': [
        'Mrs Claus',
        'Mother Christmas'
    ],
    '🧑{{skin_tone}}‍🎄': [
        'Mx Claus',
        'Person Christmas'
    ],
    '🤴{{skin_tone}}': ['Prince'],
    '👸{{skin_tone}}': [
        'Princess',
        'Blonde Girl',
        'Girl With Crown',
        'Girl With Tiara'
    ],
    '🫅{{skin_tone}}': ['Person with Crown'],
    '👳{{skin_tone}}‍♂️': [
        'بركة زهرة الرجل',
        'Arab',
        'Muslim',
        'Sikh',
        'Turban'
    ],
    '👳{{skin_tone}}‍♀️': [
        'بركة ارتداء المرأة',
        'Arab',
        'Muslim',
        'Sikh',
        'Turban'
    ],
    '👳{{skin_tone}}': [
        'Person Wearing Turban',
        'Arab',
        'Muslim',
        'Sikh',
        'Turban'
    ],
    '👲{{skin_tone}}': [
        'Person With Skullcap',
        'Asian Man',
        'Man With Chinese Cap',
        'Man with Gua Pi Mao'
    ],
    '🧕{{skin_tone}}': [
        'Woman with Headscarf',
        'Hijab',
        'Person with Headscarf'
    ],
    '🤵{{skin_tone}}‍♀️': [
        'Man in Tuxedo',
        'Groom',
        'Man In Suit',
        'Wedding'
    ],
    '🤵{{skin_tone}}‍♂️': [
        'Woman in Tuxedo',
        'Groom',
        'Woman In Suit',
        'Wedding'
    ],
    '🤵{{skin_tone}}': [
        'Person in Tuxedo',
        'Groom',
        'Person In Suit',
        'Wedding'
    ],
    '👰{{skin_tone}}‍♂️': [
        'رجل مع فييل',
        'Wedding',
        'Bridegroom',
        'Marriage'
    ],
    '👰{{skin_tone}}‍♀️': [
        'امرأة مع فييل',
        'Wedding',
        'Bride',
        'Bride with Veil',
        'Marriage'
    ],
    '👰{{skin_tone}}': [
        'Person With Veil',
        'Wedding',
        'Marriage'
    ],
    '👩{{skin_tone}}‍🍼': ['تغذية المرأة الطفلة'],
    '👨{{skin_tone}}‍🍼': ['تغذية الطفل الرضيع'],
    '🧑{{skin_tone}}‍🍼': ['Person Feeding Baby'],
    '🥷': ['النينجا'],
    '🤰{{skin_tone}}': [
        'Pregnant Woman',
        'Pregnancy',
        'Pregnant Lady'
    ],
    '🫃{{skin_tone}}': [
        'Pregnant Man',
        'Pregnancy'
    ],
    '🫄{{skin_tone}}': [
        'Pregnant Person',
        'Pregnancy'
    ],
    '🤱{{skin_tone}}‍': [
        'الرضاعة الطبيعية',
        'الرضاعة الطبيعية'
    ],
    '🦸{{skin_tone}}‍♂️': ['بطل خارق'],
    '🦸{{skin_tone}}‍♀️': ['Woman Superhero'],
    '🦸{{skin_tone}}': ['Person Superhero'],
    '🦹{{skin_tone}}‍♂️': ['Man Supervillain'],
    '🦹{{skin_tone}}‍♀️': ['Woman Supervillain'],
    '🦹{{skin_tone}}': ['Person Supervillain'],
    '🧙{{skin_tone}}‍♂️': [
        'Man Mage',
        'Sorcerer',
        'Wizard'
    ],
    '🧙{{skin_tone}}‍♀️': [
        'Woman Mage',
        'Witch',
        'Sorceress',
        'Wizard'
    ],
    '🧙{{skin_tone}}': [
        'Person Mage',
        'Wizard',
        ':mage:'
    ],
    '🧚{{skin_tone}}‍♂️': ['Man Fairy'],
    '🧚{{skin_tone}}‍♀️': ['جنية المرأة'],
    '🧚{{skin_tone}}': ['Person Fairy'],
    '🧛{{skin_tone}}‍♂️': [
        'مصاص دماء الرجل',
        'دراكولا'
    ],
    '🧛{{skin_tone}}‍♀️': ['Woman Vampire'],
    '🧛{{skin_tone}}': ['Person Vampire'],
    '🧜{{skin_tone}}‍♂️': [
        'ميرمان',
        'Merboy'
    ],
    '🧜{{skin_tone}}‍♀️': [
        'حمراء',
        'Mergirl'
    ],
    '🧜{{skin_tone}}': ['Merperson'],
    '🧝{{skin_tone}}‍♂️': ['قزم الرجل'],
    '🧝{{skin_tone}}‍♀️': ['قزم المرأة'],
    '🧝{{skin_tone}}': ['Person Elf'],
    '🧞‍♂️': ['Man Genie'],
    '🧞‍♀️': ['Woman Genie'],
    '🧞': ['Person Genie'],
    '🕵️{{skin_tone}}‍♂️': [
        'كاشف الإنسان',
        'عين خاص',
        'Sleuth',
        'التجسس',
        'Man Sleuth',
        'نزيف أو تجسس',
        '007',
        'مفتش'
    ],
    '🕵️{{skin_tone}}‍♀️': [
        'كتشف المرأة',
        'Private Eye',
        'Sleuth',
        'Spy',
        'Woman Sleuth',
        'Sleuth or Spy',
        '007',
        'Inspector'
    ],
    '🕵{{skin_tone}}': [
        'Person Detective',
        'Private Eye',
        'Sleuth',
        'Spy',
        'Person Sleuth',
        'Sleuth or Spy',
        '007',
        'Inspector'
    ],
    '💂{{skin_tone}}‍♂️': [
        'Man: Guard',
        'British Guardsman',
        'Foot Guard'
    ],
    '💂{{skin_tone}}‍♀️': [
        'Woman: Guard',
        'British Guardsman',
        'Foot Guard'
    ],
    '💂{{skin_tone}}': [
        'Person: Guard',
        'British Guardsman',
        'Foot Guard'
    ],
    '👮{{skin_tone}}‍♂️': [
        'Police Officer',
        'Cop',
        'Police',
        'Policeman'
    ],
    '👮{{skin_tone}}‍♀️': [
        'Woman Police Officer',
        'Cop',
        'Police',
        'Policewoman'
    ],
    '👮{{skin_tone}}': [
        'Police Officer',
        'Cop',
        'Police'
    ],
    '👨{{skin_tone}}‍🚒': ['رجل إطفاء'],
    '👩{{skin_tone}}‍🚒': ['Woman Firefighter'],
    '🧑{{skin_tone}}‍🚒': ['Person Firefighter'],
    '👨{{skin_tone}}‍✈️': ['Man Pilot'],
    '👩{{skin_tone}}‍✈️': ['Woman Pilot'],
    '🧑{{skin_tone}}‍✈️': ['Person Pilot'],
    '👨{{skin_tone}}‍💻': [
        'عالم التكنولوجيا',
        'عالم التكنولوجيا'
    ],
    '👩{{skin_tone}}‍💻': ['التكنولوجيا النسائية'],
    '🧑{{skin_tone}}‍💻': ['Person Technologist'],
    '👨{{skin_tone}}‍🎤': [
        'مغني الرجل',
        'Bowie',
        'Aladdin Sane'
    ],
    '👩{{skin_tone}}‍🎤': ['المرأة المغنية'],
    '🧑{{skin_tone}}‍🎤': ['Person Singer'],
    '👨{{skin_tone}}‍🎨': ['فنان الرجل'],
    '👩{{skin_tone}}‍🎨': ['فنان المرأة'],
    '🧑{{skin_tone}}‍🎨': ['Person Artist'],
    '👷{{skin_tone}}‍♂️': ['Man Construction Worker'],
    '👷{{skin_tone}}‍♀️': ['Woman Construction Worker'],
    '👷{{skin_tone}}': ['Person Construction Worker'],
    '👨{{skin_tone}}‍🚀': [
        'Man Astronaut',
        'Man Cosmonaut'
    ],
    '👩{{skin_tone}}‍🚀': [
        'Woman Astronaut',
        'Woman Cosmonaut'
    ],
    '🧑{{skin_tone}}‍🚀': [
        'Person Astronaut',
        'Person Cosmonaut'
    ],
    '👨{{skin_tone}}‍🔬': ['Man Scientist'],
    '👩{{skin_tone}}‍🔬': ['Woman Scientist'],
    '🧑{{skin_tone}}‍🔬': ['Person Scientist'],
    '👨{{skin_tone}}‍💼': [
        'عامل مكتب الرجل',
        'الرئيس التنفيذي',
        'رجل الأعمال'
    ],
    '👩{{skin_tone}}‍💼': [
        'المرأة العاملة في المكتب',
        'سيدة أعمال',
        'الرئيس التنفيذي'
    ],
    '🧑{{skin_tone}}‍💼': [
        'Person Office Worker',
        'Business',
        'CEO'
    ],
    '👨{{skin_tone}}‍🏭': ['عامل مصنع رجل'],
    '👩{{skin_tone}}‍🏭': ['Woman Factory Worker'],
    '🧑{{skin_tone}}‍🏭': ['Person Factory Worker'],
    '👨{{skin_tone}}‍🔧': ['Man Mechanic'],
    '👩{{skin_tone}}‍🔧': ['Woman Mechanic'],
    '🧑{{skin_tone}}‍🔧': ['Person Mechanic'],
    '👨{{skin_tone}}‍🍳': [
        'Man Cook',
        'Man Chef',
        'Male Chef'
    ],
    '👩{{skin_tone}}‍🍳': [
        'Woman Cook',
        'Woman Chef',
        'Female Chef'
    ],
    '🧑{{skin_tone}}‍🍳': [
        'Person Cook',
        'Person Chef'
    ],
    '👨{{skin_tone}}‍🌾': ['Man Farmer'],
    '👩{{skin_tone}}‍🌾': ['Woman Farmer'],
    '🧑{{skin_tone}}‍🌾': ['Person Farmer'],
    '👨{{skin_tone}}‍‍⚖️': ['قاضية مان'],
    '👩{{skin_tone}}‍‍⚖️': ['قاضية امرأة'],
    '🧑{{skin_tone}}‍‍⚖️': ['Person Judge'],
    '👨{{skin_tone}}‍‍🏫': ['المعلم'],
    '👩{{skin_tone}}‍‍🏫': ['المعلمات'],
    '🧑‍{{skin_tone}}‍‍🏫': ['Person Teacher'],
    '👨{{skin_tone}}‍🎓': ['طالب رجل'],
    '👩{{skin_tone}}‍🎓': ['الطالبة'],
    '🧑{{skin_tone}}‍🎓': ['Person Student'],
    '👨{{skin_tone}}‍⚕️': [
        'Man Health Worker',
        'Male Doctor',
        'Male Nurse'
    ],
    '👩{{skin_tone}}‍⚕️': [
        'العاملات الصحيات',
        'دكتوراه أنثى',
        'ممرضة'
    ],
    '🧑‍{{skin_tone}}‍⚕️': [
        'Person Health Worker',
        'Person Doctor',
        'Person Nurse'
    ],
    '🤷{{skin_tone}}‍♂️': [
        'رجل مشرق',
        'رجل خادع',
        'dunno'
    ],
    '🤷{{skin_tone}}‍♀️': [
        'انقطاع المرأة',
        'امرأة فارغة',
        'dunno'
    ],
    '🤷{{skin_tone}}': [
        'Person Shrugging',
        'idk person',
        'dunno'
    ],
    '🤦{{skin_tone}}‍♂️': ['وجه الرجل'],
    '🤦{{skin_tone}}‍♀️': ['مواجهة المرأة'],
    '🤦{{skin_tone}}': ['Person Facepalming'],
    '🙇{{skin_tone}}‍‍♂️': ['انحناء الرجل'],
    '🙇{{skin_tone}}‍‍♀️': ['ضرب المرأة'],
    '🙇{{skin_tone}}': ['Person Bowing'],
    '🧏{{skin_tone}}‍♂️': ['رجل الصم'],
    '🧏{{skin_tone}}‍‍♀️': ['صم المرأة'],
    '🧏{{skin_tone}}': ['Deaf Person'],
    '🙋{{skin_tone}}‍‍♂️': [
        'رعاة الإنسان يدوياً',
        'رجل سعيد يربي يد واحدة'
    ],
    '🙋{{skin_tone}}‍♀️': [
        'تربية المرأة يدوياً',
        'امرأة سعيدة تربي يد واحدة'
    ],
    '🙋{{skin_tone}}': [
        'Person Raising Hand',
        'Happy Person Raising One Hand'
    ],
    '💁{{skin_tone}}‍♂️': [
        'اليد الشاطئة',
        'رجل مكتب الاستعلامات'
    ],
    '💁{{skin_tone}}‍♀️': [
        'نصيحة المرأة',
        'المرأة في مكتب المعلومات'
    ],
    '💁{{skin_tone}}': [
        'Person Tipping Hand',
        'Information Desk Person'
    ],
    '🙆{{skin_tone}}‍♂️': ['Man Gesturing OK'],
    '🙆{{skin_tone}}‍♀️': ['المرأة غستندينغ حسنا'],
    '🙆{{skin_tone}}': ['Person Gesturing OK'],
    '🙅{{skin_tone}}‍♂️': ['الرجل غستنغ لا'],
    '🙅{{skin_tone}}‍♀️': ['رقم Gesturing'],
    '🙅{{skin_tone}}': ['Person Gesturing No'],
    '🙎{{skin_tone}}‍♂️': ['قذارة الرجل'],
    '🙎{{skin_tone}}‍‍♀️': ['قذف المرأة'],
    '🙎{{skin_tone}}': ['Person Pouting'],
    '🙍{{skin_tone}}‍♂️': ['Man Frowning'],
    '🙍{{skin_tone}}‍♀️': ['Woman Frowning'],
    '🙍{{skin_tone}}': ['Person Frowning'],
    '🧟‍‍♂️': ['زومبي الرجل'],
    '🧟‍‍♀️': ['زومبي المرأة'],
    '🧟': ['Person Zombie'],
    '🚶{{skin_tone}}‍♂️': ['مشي الرجل'],
    '🚶{{skin_tone}}‍♀️': ['المشي النسائي'],
    '🚶{{skin_tone}}': ['Person Walking'],
    '🧍{{skin_tone}}‍♂️': ['Man Standing'],
    '🧍{{skin_tone}}‍♀️': ['Woman Standing'],
    '🧍{{skin_tone}}': ['Person Standing'],
    '🧎{{skin_tone}}‍♂️': ['رجل الركبة'],
    '🧎{{skin_tone}}‍♀️': ['Woman Kneeling'],
    '🧎{{skin_tone}}': ['Person Kneelink'],
    '👨{{skin_tone}}‍🦯': ['رجل مع قصب أبيض'],
    '👩{{skin_tone}}‍🦯': ['امرأة مع قصب أبيض'],
    '🧑{{skin_tone}}‍🦯': ['Person with White Cane'],
    '👨{{skin_tone}}‍🦼': ['رجل في كرسي عجلة متحرك'],
    '👩{{skin_tone}}‍🦼': ['المرأة في الكرسي المتحرك'],
    '🧑{{skin_tone}}‍🦼': ['Person in Motorized Wheelchair'],
    '👨{{skin_tone}}‍🦽': ['رجل في كرسي عجلة يدوي'],
    '👩{{skin_tone}}‍🦽': ['المرأة في كرسي العجلة اليدوي'],
    '🧑{{skin_tone}}‍🦽': ['Person in Manual Wheelchair'],
    '👯‍♂️': ['الرجال الذين يعانون من النعرات الغنية'],
    '👯‍♀️': ['النساء اللاتي لديهن إيرز مريح'],
    '👯': ['People with Bunny Ears'],
    '🕴️{{skin_tone}}': [
        'Person in Suit Levitating',
        'Hovering Man',
        'Rude Boy',
        'Walt Jabsco',
        'Man in Business Suit Levitating'
    ],
    '🧖{{skin_tone}}‍♂️': [
        'رجل في غرفة سباني',
        'رجل في السونا'
    ],
    '🧖{{skin_tone}}‍♀️': [
        'امرأة في غرفة سباني',
        'المرأة في السونا'
    ],
    '🧖{{skin_tone}}': [
        'Person in Steamy Room',
        'Person in Sauna'
    ],
    '👫{{skin_tone}}': [
        'Woman and Man Holding Hands',
        'Heterosexual Couple',
        'Straight Couple',
        'Man and Woman Holding Hands'
    ],
    '👭{{skin_tone}}': [
        'Lesbian Couple',
        'Women Holding Hands',
        'Two Women Holding Hands'
    ],
    '👬{{skin_tone}}': [
        'Men Holding Hands',
        'Gay Couple',
        'Two Men Holding Hands'
    ],
    '🧑‍🤝‍🧑': [
        'People Holding Hands',
        'Two People Holding Hands',
        'Gender Inclusive Couple',
        'Gender Neutral Couple',
        'Gender Nonconforming Couple'
    ],
    '👨‍👩‍👦': [
        'العائلة مع الأم والأب والأبن',
        'العائلة: رجل، امرأة، فتى'
    ],
    '👨‍👩‍👧': [
        'الأسرة مع الأم والأب والبنت',
        'العائلة: رجل، امرأة، فتاة'
    ],
    '👨‍👩‍👧‍👦': [
        'الأسرة مع الأم والأب والبنت والبنت',
        'الأسرة: رجل وامرأة وفتاة وفتى'
    ],
    '👨‍👩‍👦‍👦': [
        'العائلة مع الأم والأب والأبنين',
        'العائلة: رجل، امرأة، فتى، فتى'
    ],
    '👨‍👩‍👧‍👧': [
        'الأسرة مع الأم والأب والبنتين',
        'الأسرة: رجل وامرأة وفتاة وفتاة'
    ],
    '👨‍👨‍👦': [
        'العائلة مع والدين و ابن',
        'العائلة: رجل، رجل، فتى'
    ],
    '👨‍👨‍👧': [
        'الأسرة مع والدين وابنتين',
        'العائلة: رجل، رجل، فتاة'
    ],
    '👨‍👨‍👧‍👦': [
        'عائلة مع والدين وابن وابنتين',
        'العائلة: رجل ، فتاة ، فتى'
    ],
    '👨‍👨‍👦‍👦': [
        'العائلة مع والدين وأبنائين',
        'العائلة: الرجال، الرجال، الفتيان، الفتيان'
    ],
    '👨‍👨‍👧‍👧': [
        'الأسرة ذات الأب والبنتين',
        'الأسرة: رجل، فتاة، فتاة'
    ],
    '👩‍👩‍👦': [
        'العائلة مع أمهات وأبناء',
        'العائلة: امرأة، امرأة، فتى'
    ],
    '👩‍👩‍👧': [
        'الأسرة مع أمتين وابنتين',
        'الأسرة: امرأة، امرأة، فتاة'
    ],
    '👩‍👩‍👧‍👦': [
        'العائلة مع أمتين، ابن وابنتين',
        'الأسرة: المرأة والمرأة والفتاة والفتيان'
    ],
    '👩‍👩‍👦‍👦': [
        'العائلة مع أمهات وأبنين',
        'العائلة: امرأة، امرأة، فتى، فتى'
    ],
    '👩‍👩‍👧‍👧': [
        'الأسرة مع أمتين وبناتين',
        'الأسرة: امرأة، امرأة، فتاة، فتاة'
    ],
    '👨‍👦': [
        'العائلة مع الأب و الابن',
        'العائلة: رجل، فتى'
    ],
    '👨‍👧': [
        'العائلة مع الأب والبنت',
        'الأسرة: رجل، فتاة'
    ],
    '👨‍👦‍👦': [
        'Family With Father and Two Sons',
        'Family: Man, Boy, Boy'
    ],
    '👨‍👧‍👦': [
        'الأسرة مع الأب والأبن والبنت',
        'العائلة: رجل، فتاة، فتى'
    ],
    '👨‍👧‍👧': [
        'العائلة مع الأب والبنتين',
        'الأسرة: رجل فتاة فتاة'
    ],
    '👩‍👦': [
        'العائلة مع الأم و الابن',
        'العائلة: امرأة، فتى'
    ],
    '👩‍👧': [
        'الأسرة مع الأم والبنت',
        'الأسرة: امرأة، فتاة'
    ],
    '👩‍👦‍👦': [
        'الأسرة مع الأم وولدين',
        'العائلة: امرأة، فتى، فتى'
    ],
    '👩‍👧‍👦': [
        'الأسرة مع الأم والبنت والبنت',
        'العائلة: امرأة، فتاة، فتى'
    ],
    '👩‍👧‍👧': [
        'الأسرة مع الأم والبنتين',
        'الأسرة: امرأة، فتاة، فتاة'
    ],
    '💑{{skin_tone}}': [
        'Couple with Heart',
        'Couple In Love',
        'Loving Couple',
        'Gender Neutral Couple'
    ],
    '👩‍❤️‍👨': [
        'Man and Woman With Heart',
        'Couple In Love',
        'Loving Couple',
        'Couple With Heart'
    ],
    '👨‍❤️‍👨': [
        'رجلان مع القلب',
        'زوجين مع القلب: رجل'
    ],
    '👩‍❤️‍👩': [
        'امرأتان لديهما قلب',
        'زوجين مع القلب: امرأة، امرأة'
    ],
    '💏{{skin_tone}}': [
        'Couple Kissing',
        'Kiss',
        'Gender Neutral Couple Kissing'
    ],
    '👩‍❤️‍💋‍👨': ['Man and Woman Kissing'],
    '👨‍❤️‍💋‍👨': [
        'Two Men Kissing',
        'Man and Man Kissing'
    ],
    '👩‍❤️‍💋‍👩': [
        'Two Women Kissing',
        'Woman and Woman Kissing'
    ],
    '💆{{skin_tone}}‍♂️': ['Man Getting Head Massage'],
    '💆{{skin_tone}}‍♀️': ['تعرض المرأة للهجوم'],
    '💆{{skin_tone}}': ['Person Getting Head Massage'],
    '💇{{skin_tone}}‍♂️': ['Man Getting Haircut'],
    '💇{{skin_tone}}‍♀️': ['Woman Getting Haircut'],
    '💇{{skin_tone}}': ['Person Getting Haircut'],
    '🛌{{skin_tone}}': [
        'Sleeping Accommodation',
        'Person in Bed',
        'Person Sleeping'
    ],
    '🧌': ['Troll'],
    '👺': [
        'Goblin',
        'Long Nose Face',
        'Red Mask',
        'Tengu',
        'Japanese Goblin'
    ]
};
/*animals*/
emojis_language[lang][4] = {
    '😺': [
        'قطط مطهر',
        ':)',
        'قطة سعيدة',
        'قطة ابتسامة',
        'وجه قطة سعيد',
        'وجه القطة المبتسمة مع القالب المفتوح'
    ],
    '😸': [
        'طحن القطط بالعين المبتسمة',
        ':D',
        'قطط مطهر',
        'قطة سعيدة',
        'واجهة قطط المطهر'
    ],
    '😹': [
        'قطة مع دموع من الجاه',
        ':\')',
        'قطة الدموع السعيدة',
        'القط الاصطناعي'
    ],
    '😻': [
        'قطه مبتسمة بالعين القلبية',
        '*.*',
        'قطة العيون القلبية',
        'القطط المحمولة',
        'وجه القطة المبتسمة بالعين على شكل القلب'
    ],
    '😼': [
        'قطة مع ابتسامة جافة',
        'قطط الاستكماش',
        'وجه القطة الممتعة',
        'وجه القطة مع الابتسامة الجافة'
    ],
    '😽': [
        'كيس القط',
        ':*',
        'كيس وجه القطة',
        'كيس وجه القطة بالعيون المغلقة'
    ],
    '🙀': [
        'قطة الوزن',
        ':O',
        'قطط مهجورة',
        'قطه صورية',
        'شاشة وجه القطة في الخوف',
        'وجه القطط الزاحفة'
    ],
    '😿': [
        'كرات القط',
        ':\'(',
        'قطة حزينة',
        'وجه البكاء للقطة'
    ],
    '😾': [
        'قطه اللمس',
        'Grumpy Cat',
        'وجه القطة المسطحة'
    ],
    '🙈': [
        'قرد',
        'انظر القرد الشرير',
        'ميزارو',
        'غطاء عيون القرد'
    ],
    '🙉': [
        'قرد',
        'القرد الشرير',
        'Kikazaru',
        'غطاء القرد'
    ],
    '🙊': [
        'قرد',
        'القرد الشرير',
        'إيوازارو',
        'القرد يغطي الفم',
        'لا يتحدث'
    ],
    '🐵': [
        'قرد',
        'وجه القرد',
        'رأس القرد'
    ],
    '🐒': [
        'قرد',
        'قرد شيكي'
    ],
    '🦍': ['Gorilla'],
    '🐶': [
        'وجه الكلب',
        'كلب',
        'دمية'
    ],
    '🐕': [
        'كلب',
        'Doggo',
        'Akita Inu'
    ],
    '🦮': [
        'رؤية كلب العين',
        'دليل الكلب'
    ],
    '🐕‍🦺': ['كلب الخدمة'],
    '🐩': [
        'البودل',
        'كلب',
        'قوالب مصغرة',
        'البودلة القياسية',
        'بودر اللعبة'
    ],
    '🐺': [
        'ذئب',
        'وجه الذئب'
    ],
    '🦊': [
        'ثعلب',
        'وجه الثعلب'
    ],
    '🦝': ['راسكون'],
    '🐱': [
        'وجه القطة',
        ':3',
        'كريتس',
        'كيتي'
    ],
    '🐈': [
        'قطط',
        'قطة منزلية',
        'السنور',
        'هيوسيات'
    ],
    '🐈‍⬛': ['قطة سوداء'],
    '🦁': [
        'الأسد',
        'وجه الأسد'
    ],
    '🐯': [
        'وجه النمر',
        'نمر لطيف'
    ],
    '🐅': [
        'النمر',
        'نمر البنغال'
    ],
    '🐆': [
        'Leopard',
        'البارد الأفريقي',
        'Jaguar'
    ],
    '🐴': [
        'وجه الحصان',
        'رأس الحصان'
    ],
    '🐎': [
        'حصان',
        'حصان غالوبينغ',
        'حصان السباق'
    ],
    '🦄': [
        'يونيكورن',
        'وجه يونيكورن'
    ],
    '🦓': [
        'Zebra',
        'وجه زيبرا'
    ],
    '🦌': [
        'الغزال',
        'بوك',
        'رنة',
        'Stag'
    ],
    '🐮': [
        'وجه البقرة',
        'بقرة',
        'بقرة سعيدة'
    ],
    '🐂': [
        'أوكس',
        'سبائك',
        'قنبلة',
        'أكسين',
        'أكثر'
    ],
    '🐃': [
        'مكافأة المياه',
        'بافالو',
        'مكافأة المياه المنزلية'
    ],
    '🐄': [
        'بقرة',
        'بقرة الألبان'
    ],
    '🐷': [
        'وجه الخنزير',
        'خنزير',
        'رأس الخنزير'
    ],
    '🐖': [
        'خنزير',
        'خندق',
        'Sow'
    ],
    '🐗': [
        'بوار',
        'وارثوغ',
        'درع بري',
        'خنزير بري'
    ],
    '🐽': ['خنزير الأنف'],
    '🐏': [
        'Ram',
        'خروف'
    ],
    '🐑': [
        'Ewe',
        'Lamb',
        'خروف'
    ],
    '🐐': ['عنزة'],
    '🐪': [
        'جمال',
        'الجمال العربي',
        'الجمل المسقط',
        'ضرب الجمل'
    ],
    '🐫': [
        'جمال قفز مزدوج',
        'الجمال الآسيوي',
        'الجمل البكتيري'
    ],
    '🦙': [
        'Llama',
        'Alpaca'
    ],
    '🦒': [
        'Giraffe',
        'Giraffe Face'
    ],
    '🐘': ['فيل'],
    '🦏': [
        'Rhinoceros',
        'Rhino'
    ],
    '🦛': [
        'Hippopotamus',
        'Hippo'
    ],
    '🐭': [
        'وجه الفأرة',
        'الفأرة'
    ],
    '🐁': [
        'الفأرة',
        'دوردوس',
        'القارئ',
        'الجمال'
    ],
    '🐀': [
        'الفئران',
        'القارئ'
    ],
    '🐹': [
        'هامستر',
        'وجه الحماس'
    ],
    '🐰': [
        'وجه الأرنب',
        'عيد الفصح'
    ],
    '🐇': [
        'أرنب',
        'Bunny',
        'رنب مجنون'
    ],
    '🐿️': [
        'شيبمونك',
        'النجوم'
    ],
    '🦔': ['هيدجيهوج'],
    '🦇': [
        'الخفاش',
        'باتمان'
    ],
    '🐻': [
        'الدب',
        'وجه الدب',
        'دب تيدي'
    ],
    '🐨': [
        'كوالا',
        'وجه كوالا'
    ],
    '🐼': [
        'باندا',
        'وجه الباندا'
    ],
    '🦘': [
        'كانغارو',
        'روي'
    ],
    '🦡': ['الشارق'],
    '🦃': [
        'تركيا',
        'تركيا عيد الشكر',
        'تركيا الجامحة'
    ],
    '🐔': [
        'دجاج',
        'Hen'
    ],
    '🐓': [
        'ساحة',
        'Rooster',
        'الجيب'
    ],
    '🐣': [
        'قفزة الرصاص',
        'دجاج طفل',
        'تشويش'
    ],
    '🐤': [
        'شيك الطفل',
        'الطائر الأصفر'
    ],
    '🐥': [
        'الصغار المواجهة الأمامية',
        'شيك الطفل',
        'الدرج الدائم'
    ],
    '🐦': ['الطيور'],
    '🐧': ['Penguin'],
    '🕊️': [
        'حمامة',
        'ضربة السلام'
    ],
    '🦅': [
        'نسر',
        'نسر بلد'
    ],
    '🦆': ['دك'],
    '🦢': ['سواني'],
    '🦉': ['أوول'],
    '🦚': ['الطاووك'],
    '🦜': ['الببغاء'],
    '🐸': [
        'فطيرة',
        'تود',
        'الوجه الحطمي'
    ],
    '🐊': [
        'التدوين',
        'النجوم',
        'كروك'
    ],
    '🐢': [
        'السلاحف',
        'Tortoise'
    ],
    '🦎': [
        'المعالج',
        'جيكو'
    ],
    '🐍': [
        'ثعبان',
        'سيرفر'
    ],
    '🐲': [
        'وجه التنين',
        'رأس التنين'
    ],
    '🐉': ['تنين'],
    '🦕': [
        'سوروبود',
        'Brachiosaurus',
        'Brontosaurus',
        'Dinosaur'
    ],
    '🦖': [
        'T-Rex',
        'Tyrannosaurus Rex'
    ],
    '🐳': [
        'تزوج الحوت',
        'حيتان لطيفة'
    ],
    '🐋': ['الحوت'],
    '🐬': ['دولفين'],
    '🐟': [
        'سمكة',
        'سمكة المياه العذبة'
    ],
    '🐠': [
        'السمك المداري',
        'سمكة',
        'سمك أزرق أصفر'
    ],
    '🐡': [
        'سمك الزهور',
        'Fugu',
        'سمك الفول'
    ],
    '🦈': [
        'القرش',
        'القرش الأبيض العظيم'
    ],
    '🐙': ['أوكتوبوس'],
    '🐚': [
        'قذيفة حلزونية',
        'موسيقى',
        'قذيفة'
    ],
    '🐌': [
        'حلزون',
        'سبيكة',
        'سيل الحديقة'
    ],
    '🦋': ['الفراشة'],
    '🐛': [
        'خلل',
        'كاتربلر',
        'حشرة'
    ],
    '🐜': [
        'Ant',
        'خلل',
        'حشرة'
    ],
    '🐝': [
        'العسل',
        'النحل',
        'Bumblebee'
    ],
    '🐞': [
        'بيتة سيدة',
        'Ladybird',
        'Ladybug',
        'خلل'
    ],
    '🦗': [
        'الكريكيت',
        'غريشوبر'
    ],
    '🕷️': ['العنكبوت'],
    '🦂': ['العقرب'],
    '🦟': ['البعوض'],
    '🦀': ['سرطان'],
    '🦞': ['اللوحات'],
    '🦐': [
        'كريم',
        'Prawn'
    ],
    '🦑': ['فتحة'],
    '🦧': ['Orangutan'],
    '🦥': ['خياش'],
    '🦦': ['Otter'],
    '🦨': ['سكونك'],
    '🦬': ['بيسون'],
    '🦣': ['ماموث'],
    '🦫': ['بيفر'],
    '🐻‍❄️': ['دب قطبي'],
    '🦤': ['Dodo'],
    '🦭': ['ختم'],
    '🪲': ['النحل'],
    '🪳': ['كوكروش'],
    '🪰': ['طيران'],
    '🪱': ['دودة'],
    '🦩': ['فلامينجو'],
    '🪹': [
        'Empty Nest',
        'Birds',
        'الرئيسية'
    ],
    '🪺': [
        'Nest with Eggs',
        'Birds',
        'الرئيسية'
    ]
};
/*symbols*/
emojis_language[lang][5] = {
    '💘': [
        'قلب مع السهم',
        'السهم الكبيدي',
        'Lovestruck'
    ],
    '💝': [
        'قلب مع الشريط',
        'صندوق الشوكولاتة',
        'صندوق الهدايا',
        'قلب الهدية'
    ],
    '💖': [
        'Sparkling Heart',
        'قلب البانكلي',
        'قلب صارخ',
        'قلب النجوم'
    ],
    '💗': [
        'القلب المتنامي',
        'قلب متعدد',
        'القلب الثلاثي'
    ],
    '💓': [
        'ضرب القلب',
        'منبه القلب',
        'Heartbeat',
        'قلب الواي فاي'
    ],
    '💞': [
        'القلب الدائر',
        'قلبان'
    ],
    '💕': [
        'قلبان',
        'قلوب صغيرة',
        'قلبان ورديان'
    ],
    '💟': ['زخرفة القلب'],
    '❣️': [
        'تعجب القلب',
        'القلب فوق الروبوت',
        'قلب أحمر كعلامة تعجب',
        'زينة علامات تعجب القلب الثقيلة'
    ],
    '💔': [
        'قلب محطم',
        'كسر القلب',
        'بركنه',
        'كسر القلب'
    ],
    '❤️': [
        'أنا أحبك',
        'قلب أحمر',
        'قلب',
        'قلب الحب',
        'قلب أحمر'
    ],
    '🧡': [
        'القلب البرتقالي',
        'أنا أحبك'
    ],
    '💛': [
        'قلب أصفر',
        '#1 BF Snapchat',
        'قلب الذهب',
        'أنا أحبك'
    ],
    '💚': [
        'قلب أخضر',
        'قلب الجيب',
        'أنا أحبك'
    ],
    '💙': [
        'القلب الأزرق',
        'أنا أحبك'
    ],
    '💜': [
        'القلب الأرجواني',
        'أنا أحبك'
    ],
    '🖤': [
        'قلب أسود',
        'قلب الظلام',
        'أنا أحبك'
    ],
    '🤍': [
        'قلب أبيض',
        'أنا أحبك'
    ],
    '🤎': [
        'قلب بني',
        'أنا أحبك'
    ],
    '💯': [
        '100 نقطة',
        '100',
        '%',
        'احتفظ بها 100',
        'نتيجة ممتازة',
        'رمز المائة من النقاط'
    ],
    '💬': [
        'بالون الكلام',
        'فقاعات الدردشة',
        'فقاعات الكلام'
    ],
    '💭': [
        'فكر بالون',
        'فقاعات التفكير',
        'فقاعات الفقاعات'
    ],
    '💤': [
        'زتز',
        'وقت النوم',
        'الصنبور',
        'النوم',
        'لافتة النوم',
        'رمز النوم'
    ],
    '♠': [
        'Spade Suit',
        'Spades',
        'Black Spade Suit'
    ],
    '♥': [
        'Heart Suit',
        'Card With Heart',
        'Hearts',
        'Black Heart Suit'
    ],
    '♦': [
        'Diamond Suit',
        'Diamonds',
        'Black Diamond Suit'
    ],
    '♣': [
        'Club Suit',
        'Clubs',
        'Black Club Suit'
    ],
    '🏧': [
        'علامة الصراف الآلي',
        'صراف',
        'آلة التلال الآلية'
    ],
    '🎧': [
        'Headphone',
        'Earphone',
        'iPod',
        'Headphones'
    ],
    '🎵': [
        'ملاحظة موسيقية',
        'ثامنا- اقتران الملاحظات الثامنة',
        'إقران الكوافر المشعور',
        'ملاحظة موسيقية'
    ],
    '🎶': [
        'ملاحظات موسيقية',
        'الموسيقى',
        'ملاحظات الموسيقى',
        'الغناء',
        'ملاحظات موسيقية متعددة'
    ],
    '🔔': [
        'جرس',
        'جرس الحرية',
        'Ringer',
        'جرس الزفاف'
    ],
    '🔕': [
        'جرس مع Slash',
        'الإشعارات',
        'الرنين معطل',
        'جرس مكتم',
        'جرس مع جرة الإلغاء'
    ],
    '🔈': [
        'مستوى صوت منخفض',
        'حجم',
        'مكبر'
    ],
    '🔉': [
        'صوت متوسط السماعة',
        'تقليل مستوى الصوت',
        'مكبر الصوت مع حجم متوسط',
        'مكبر الصوت مع موجة صوت واحدة'
    ],
    '🔊': [
        'مستوى صوت عال لمكبر الصوت',
        'زيادة مستوى الصوت',
        'مكبر الصوت مع ثلاث موجات صوتية'
    ],
    '🔇': [
        'مكبر الصوت',
        'كتم الصوت',
        'مكبر الصوت مع جرة الإلغاء'
    ],
    '📢': [
        'Loudspeaker',
        'Announcement',
        'PA System',
        'Public Address Loudspeaker',
        ''
    ],
    '⛔': ['لا يوجد مدخل'],
    '🚫': [
        'محظور',
        'محظور',
        'الدائرة الخلفية',
        'لا',
        'دائرة حمراء متقاطعة',
        'مقيد',
        'لا يوجد تسجيل دخول'
    ],
    '🚳': [
        'لا توجد دراجات',
        'لا يوجد لافتة رماحين'
    ],
    '🚭': [
        'لا يوجد تدخين',
        'لا يوجد رمز للتدخين'
    ],
    '🚯': [
        'لا يوجد انتحال',
        'لا توجد رموز'
    ],
    '🚱': [
        'مياه غير صالحة للشرب',
        'لا يوجد ماء',
        'لا يوجد ماء شرب',
        'رمز المياه غير الصالحة للشرب'
    ],
    '🚷': [
        'لا يوجد مشاة',
        'لا يوجد أشخاص',
        'لا مشي'
    ],
    '🔞': [
        'لا يوجد شخص دون الثامنة عشرة',
        'NSFW',
        'لا يوجد واحد تحت ثمانية عشر رمز',
        '18'
    ],
    '📵': [
        'لا توجد هواتف محمولة',
        'لا توجد هواتف خلوية',
        'لا توجد هواتف',
        'لا توجد هواتف ذكية'
    ],
    '☢️': [
        'Radioactive',
        'رمز الإشعاع الدولي',
        'نووي',
        'لافتة مشعة'
    ],
    '☣️': [
        'المخاطر الحيوية',
        'علامة المخاطر الحيوية'
    ],
    '⬆️': [
        'السهم للأعلى',
        'نقاط السهم للأعلى',
        'السهم الأسود لأعلى'
    ],
    '↗️': [
        'سهم أعلى اليمين',
        'سهم دماغوني لأعلى اليمين',
        'السهم الشمالي الشرقي'
    ],
    '➡️': [
        'السهم الأيمن',
        'نقطة السهم إلى اليمين',
        'السهم الأيمن الأسود'
    ],
    '↘️': [
        'سهم أسفل-يمين',
        'السهم أسفل اليمين',
        'سهم جنوب شرق'
    ],
    '⬇️': [
        'سهم لأسفل',
        'نقاط السهم للأسفل',
        'سهم أسفل أسفل'
    ],
    '↙️': [
        'سهم أسفل اليسار',
        'سهم أسفل أسفل اليسار',
        'السهم الجنوبي الغربي'
    ],
    '⬅️': [
        'السهم الأيسر',
        'نقاط السهم لليسار',
        'السهم الأسود لليسار'
    ],
    '↖️': [
        'سهم لأعلى اليسار',
        'السهم الرأسي لأعلى اليسار',
        'السهم الشمالي الغربي'
    ],
    '↕️': [
        'سهم لأسفل',
        'الأسهم العمودية',
        'سهم أعلى للأسفل'
    ],
    '↔️': [
        'سهم يسار-يمين',
        'الأسهم الأفقية',
        'الأسهم الجانبية',
        'سهم يسار اليمين'
    ],
    '↩️': [
        'السهم الأيمن ينحسر لليسار',
        'رد البريد الإلكتروني',
        'سهم منحنى اليسار',
        'سهم لليسار مع هوك'
    ],
    '↪️': [
        'السهم اليسرى ينحسر لليمين',
        'إعادة إرسال البريد',
        'سهم منحنى اليمين',
        'سهم يمين مع هوك'
    ],
    '⤴️': [
        'السهم الأيمن ينحنى',
        'السهم يشير إلى اليمين ثم ينحسر للأعلى'
    ],
    '⤵️': [
        'السهم الأيمن ينحسر للأسفل',
        'سهم منحنى لأسفل',
        'السهم يشير إلى اليمين ثم ينحسر إلى الأسفل'
    ],
    '🔃': [
        'الأسهم العمودية الحكيمة',
        'حكيمة الوقت لأسفل وأعلى فتح أسهم الدائرة'
    ],
    '🔄': [
        'زر الأسهم المعادية لعقارب الساعة',
        'تحديث',
        'تدوير',
        'تبديل',
        'الأسهم المضادة للساعة',
        'أسفل أسفل وأعلى فتح أسهم الدائرة'
    ],
    '🔙': [
        'سهم خلفي',
        'الرجوع',
        'العودة مع السهم لليسار فوق'
    ],
    '🔚': [
        'إنهاء السهم',
        'نهاية',
        'نهاية بالسهم لليسار فوق'
    ],
    '🔛': [
        'على السهم!',
        'تشغيل',
        'تشغيل مع علامة التعجب مع السهم اليساري الأيمن فوق'
    ],
    '🔜': [
        'سهم قريب',
        'قريباً',
        'قريباً مع السهم الأيمن فوق'
    ],
    '🔝': [
        'أعلى سهم',
        'أعلى',
        'أعلى مع السهم للأعلى'
    ],
    '🛐': [
        'مكان العبادة',
        'البناء الديني'
    ],
    '⚛️': ['رمز Atom'],
    '🕉️': [
        'رمز Om',
        'أوم',
        'Aumkara',
        'Omkara',
        'Pranava'
    ],
    '✡️': [
        'نجم ديفيد',
        'ماجين ديفيد'
    ],
    '☸️': [
        'عجلة الدرما',
        'مرحبا'
    ],
    '☯️': ['Yin Yang'],
    '✝️': [
        'الصليب اللاتيني',
        'الصليب المسيحي'
    ],
    '☦️': ['الصليب الأرثوذكسي'],
    '☪️': ['النجوم والهلال'],
    '☮️': [
        'رمز السلام',
        'لافتة السلام'
    ],
    '🕎': [
        'المنورة',
        'Candelabrum',
        'شموع',
        'شانوكيا',
        'المنورة',
        'مينورا مع تسعة فروع'
    ],
    '🔯': [
        'نجوم منقوطة من ست نقاط',
        'ستة نجوم ذات نقطة متوسطة'
    ],
    '♈': [
        'أريز',
        'زودياك'
    ],
    '♉': [
        'Taurus',
        'زودياك'
    ],
    '♊': [
        'Gemini',
        'زودياك'
    ],
    '♋': [
        'السرطان',
        'زودياك'
    ],
    '♌': [
        'ليو',
        'زودياك'
    ],
    '♍': [
        'الخيرجو',
        'زودياك'
    ],
    '♎': [
        'المكتبة',
        'زودياك'
    ],
    '♏': [
        'العقرب',
        'الكوربيوس',
        'زودياك'
    ],
    '♐': [
        'Sagittarius',
        'زودياك'
    ],
    '♑': [
        'الكابريكورن',
        'زودياك'
    ],
    '♒': [
        'أكاريوس',
        'زودياك'
    ],
    '♓': [
        'Pisces',
        'زودياك'
    ],
    '⛎': [
        'أوفيوشوس',
        'زودياك'
    ],
    '⏭️': [
        'المثلث المزدوج ذو النقاط السوداء مع الشريط العمودي',
        'تخطي الرمز الأمامي',
        'زر المسار التالي'
    ],
    '⏮️': [
        'مثلث مزدوج للنقاط اليسرى السوداء مع شريط عمودي',
        'تخطي الرمز الخلفي',
        'زر المسار الأخير',
        'المسار السابق'
    ],
    '⏯️': [
        'مثلث النقاط السوداء مع شريط عمودي مزدوج',
        'تشغيل أو إيقاف زر',
        'تشغيل الرمز',
        'إيقاف الرمز المؤقت'
    ],
    '🔀': [
        'تبديل زر المسارات',
        'الأسهم اليمينية الملطخة'
    ],
    '🔁': [
        'زر التكرار',
        'رمز الحلقة',
        'تغريدة',
        'حكيمة الساعة الأيمن و يسار الأسهم المفتوحة الدائرة'
    ],
    '🔂': [
        'تكرار الزر الفردي',
        'أسهم دائرة مع رقم 1',
        'التكرار مرة واحدة الرمز',
        'تكرار رمز المسار الفردي',
        'حكيمة الساعة اليمين و اليسار أسهم دائرة مفتوحة مع تراكب واحد دائري'
    ],
    '▶️': [
        'زر التشغيل',
        'المثلث الأيمن',
        'مثلث النقاط اليمنى',
        'مثلث النقاط الأيمن السوداء'
    ],
    '◀️': [
        'زر عكسي',
        'المثلث الأيسر',
        'مثلث النقاط اليسرى',
        'مثلث النقاط اليسرى السوداء'
    ],
    '🔼': [
        'زر الارتقاء',
        'مثلث أعلى',
        'مثلث آخر النقاط',
        'مثلث أحمر صغير مشار إليه أعلى'
    ],
    '🔽': [
        'زر الهبوط',
        'مثلث أسفل',
        'المثلث الذي يشير إلى الأسفل',
        'مثلث أحمر صغير يشير إلى الأسفل'
    ],
    '⏩': [
        'زر التقدم السريع',
        'التقدم السريع',
        'رمز ارسال سريع',
        'المثلث المزدوج ذو النقاط السوداء'
    ],
    '⏪': [
        'Fast Reverse Button',
        'Rewind',
        'رموز الإرجاع',
        'المثلث المزدوج النقاط اليسرى السوداء'
    ],
    '⏫': [
        'زر رفع سريع',
        'المثلث المزدوج الذي يشير إلى الأعلى',
        'المثلث المزدوج للنقاط السوداء'
    ],
    '⏬': [
        'زر اسفل سريع',
        'المثلث المزدوج الذي يشير إلى الأسفل',
        'المثلث المزدوج للنقاط السوداء'
    ],
    '⏹️': [
        'زر التوقف',
        'توقف',
        'إيقاف الرمز',
        'ساحة سوداء للإيقاف'
    ],
    '⏏️': [
        'إخراج الزر',
        'Eject Symbol'
    ],
    '🎦': [
        'سينما',
        'شاشة السينما',
        'أفلام',
        'فيلم',
        'رمز السينما',
        'التسجيل'
    ],
    '📶': [
        'شريط هوائي',
        'أشرطة الاستقبال',
        'قوة الإشارة',
        'Stairs',
        'رمز قوة الإشارة',
        'هوائي مع الحانات'
    ],
    '✖️': [
        'ضرب',
        'رمز الضرب',
        'الضرب الثقيل X'
    ],
    '➕': [
        'زائد',
        'رمز إضافي',
        'علامة ثقيل زائدا'
    ],
    '➖': [
        'Minus',
        'Minus Symbol',
        'توقيع ناقص الثقيل'
    ],
    '➗': [
        'القسمة',
        'رمز الشعبة',
        'علامة الشعبة الثقيلة'
    ],
    '🟰': [
        'Heavy Equals Sign',
        'Result'
    ],
    '♾️': [
        'اللانهائية',
        'علامة ورقية دائمة'
    ],
    '‼️': [
        'علامة التعجب المزدوج',
        'علامة الاستياء الحمراء'
    ],
    '⁉️': [
        'علامة سؤال التعجب',
        'علامة التعجب الأحمر و علامة الاستفسار'
    ],
    '❓': [
        'علامة السؤال',
        'علامة سؤال حمراء',
        'زينة علامة سؤال سوداء'
    ],
    '❔': [
        'علامة السؤال البيضاء',
        'علامة السؤال البيضاء',
        'زينة علامة السؤال البيضاء'
    ],
    '❗': [
        'علامة التعجب',
        'علامة التعجب الأحمر',
        'رمز علامة التعجب الثقيل'
    ],
    '❕': [
        'علامة التعجب الأبيض',
        'زينة الاستخلاص الأبيض'
    ],
    '⭕': [
        'دائرة حمراء قاتمة',
        'دائرة',
        'صحيح',
        'دائرة حمراء',
        'علامة الدائرة',
        'دائرة كبيرة ثقيلة'
    ],
    '☑️': [
        'تحقق من المربع مع التحقق',
        'ف',
        'خانة',
        'تحقق من العلامة في المربع',
        'صندوق الاقتراع مع التحقق'
    ],
    '✔️': [
        'التحقق من العلامة',
        'ف',
        'تحقق',
        'انتقل',
        'Checkmark',
        'علامة التحقق الثقيلة'
    ],
    '❌': [
        'عبر العلامة',
        'تقاطع',
        'س'
    ],
    '✅': [
        'تحقق من زر العلامة',
        'ف',
        'العلامة الخضراء',
        'قالب أخضر',
        'التحقق من العلامة',
        'علامة الفحص البيضاء الثقيل'
    ],
    '❎': [
        'زر تقاطع العلامات',
        'تقاطع',
        'س',
        'علامة X',
        'علامة مربعة سلبية'
    ],
    '#️⃣': [
        'سجل رقم بطاقة المفاتيح',
        '#',
        'مفتاح التجزئة',
        'وسم',
        'تشرين الأول/أكتوبر',
        'مفتاح الجنيه الآلي',
        'رقم التوقيع'
    ],
    '*️⃣': [
        'Keycap Asterisk',
        'قبعة مفاتيح النجمة'
    ],
    '0️⃣': [
        'الرقم 0',
        'Keycap Digit Zero'
    ],
    '1️⃣': [
        'رقم 1',
        'رقم المفتاح الأول'
    ],
    '2️⃣': [
        'رقم 2',
        'رقم المفتاح 2'
    ],
    '3️⃣': [
        'رقم 3',
        'رقم المفتاح 3'
    ],
    '4️⃣': [
        'الرقم 4',
        'رقم لوحة المفاتيح 4'
    ],
    '5️⃣': [
        'الرقم 5',
        'رقم المفتاح 5'
    ],
    '6️⃣': [
        'الرقم 6',
        'رقم المفتاح 6'
    ],
    '7️⃣': [
        'الرقم 7',
        'Keycap Digit Seven'
    ],
    '8️⃣': [
        'الرقم 8',
        'رقم لوحة المفاتيح 8'
    ],
    '9️⃣': [
        'الرقم 09',
        'رقم لوحة المفاتيح 9'
    ],
    '🔟': [
        'الرقم 10',
        'Keycap: 10',
        '10',
        'رقم لوحة المفاتيح 10'
    ],
    '🔠': [
        'Input Latin Uppercase',
        'ABCD',
        'الحروف',
        'رمز الإدخال للحروف العلوية',
        'رمز الإدخال لرسائل رأس المال اللاتينية'
    ],
    '🔡': [
        'Input Latin Lowercase',
        'حمض',
        'أقل حروف',
        'رمز الإدخال للحروف السفلية',
        'رمز الإدخال للحروف اللاتينية الصغيرة'
    ],
    '🔢': [
        'Input Numbers',
        '1234',
        'الأرقام',
        'Numeric Input',
        'رمز الإدخال للأرقام'
    ],
    '🔣': [
        'رمز الإدخال للرموز',
        'الرموز',
        'إدخال الرمز'
    ],
    '🔤': [
        'Input Latin Letters',
        'بكر',
        'الأبجدية',
        'الأحرف',
        'رمز الإدخال للحروف',
        'رمز الإدخال للحروف اللاتينية'
    ],
    '🅰️': [
        'زر (نوع الدم)',
        'نوع الدم A',
        'حرف A',
        'الحرف ألف لرأس المال اللاتيني المربع السلبي'
    ],
    '🆎': [
        'زر AB (نوع الدم)',
        'أحرف AB',
        'نوع الدم AB',
        'AB ساحة سالبة'
    ],
    '🅱️': [
        'زر B (نوع الدم)',
        'الحرف B',
        'نوع الدم B',
        'حرف رأس المال اللاتيني المربع السلبي B'
    ],
    '🆑': [
        'زر CL',
        'مسح',
        'زر المسح',
        'توقيع CL',
        'CL مربع',
        'حروف CL'
    ],
    '🆒': [
        'زر رائع',
        'ساحة رائعة',
        'لافتة رائعة',
        'رائع مربع'
    ],
    '🆓': [
        'زر مجاني',
        'مجاني',
        'توقيع مجاني',
        'مجانا مربع'
    ],
    'ℹ️': [
        'معلومات',
        'معلومات',
        'أحرف صغيرة I',
        'معلومات السياحة',
        'مصدر المعلومات'
    ],
    '🆔': [
        'زر المعرف',
        'ID',
        'تعريف',
        'علامة تحديد الهوية',
        'معرف مربع'
    ],
    '🆕': [
        'زر جديد',
        'جديد',
        'توقيع جديد',
        'جديد مربع'
    ],
    '🅾️': [
        'زر O (نوع الدم)',
        'نوع الدم O',
        '0',
        'رسالة رأسمالية لاتينية مربعة سلبية',
        'حرف O'
    ],
    '🆗': [
        'زر موافق',
        'حسناً',
        'حسنًا',
        'مربع',
        'موافق التوقيع',
        'حسنا مربع'
    ],
    '🅿️': [
        'زر P',
        'إشارة وقوف السيارات',
        'رسالة رأسمالية لاتينية مربعة سلبية',
        'حرف P'
    ],
    '🆘': [
        'زر الاستغاثة',
        'إشارة الاستغاثة',
        'الطوارئ',
        'SOS',
        'توقيع النجدة',
        'استغاثة مربعة',
        'مساعدة'
    ],
    '🆙': [
        'زر التحديث!',
        'رفع المستوى',
        'أعلى',
        'تسجيل الدخول',
        'أعلى مربع مع علامة التعجب'
    ],
    '🆚': [
        'زر Vs',
        'Vs مربع'
    ],
    '🆖': [
        'زر NG',
        'NG مربع',
        'لا يوجد لافتة جيدة',
        'لا يوجد خير',
        'NG',
        'بلوبر'
    ],
    '🔴': [
        'دائرة حمراء',
        'دائرة حمراء كبيرة'
    ],
    '🟠': [
        'دائرة برتقالية',
        'دائرة برتقالية كبيرة'
    ],
    '🟡': [
        'دائرة صفراء',
        'دائرة أصفر كبيرة'
    ],
    '🟢': [
        'دائرة خضراء',
        'دائرة خضراء كبيرة'
    ],
    '🔵': [
        'دائرة زرقاء',
        'دائرة زرقاء كبيرة'
    ],
    '🟣': [
        'دائرة أرجوانية',
        'دائرة بنفسجية كبيرة'
    ],
    '🟤': [
        'دائرة بنية',
        'دائرة بنية كبيرة'
    ],
    '⚫': [
        'دائرة سوداء',
        'دائرة سوداء متوسطة'
    ],
    '⚪': [
        'دائرة بيضاء',
        'دائرة بيضاء متوسطة'
    ],
    '🟥': [
        'مربع أحمر',
        'مربع أحمر كبير'
    ],
    '🟧': [
        'مربع برتقالي',
        'مربع برتقالي كبير'
    ],
    '🟨': [
        'مربع أصفر',
        'مربع أصفر كبير'
    ],
    '🟩': [
        'ساحة خضراء',
        'ساحة خضراء كبيرة'
    ],
    '🟦': [
        'مربع أزرق',
        'مربع أزرق كبير'
    ],
    '🟪': [
        'مربع أرجواني',
        'ساحة بنفسجية كبيرة'
    ],
    '🟫': [
        'ساحة بنية',
        'ساحة براون كبيرة'
    ],
    '⬛': ['ساحة سوداء كبيرة'],
    '⬜': ['ساحة بيضاء كبيرة'],
    '◼️': ['ساحة سوداء متوسطة'],
    '◻️': ['ساحة متوسطة بيضاء'],
    '◾': ['ساحة صغيرة متوسطة سوداء'],
    '◽': ['ساحة متوسطة بيضاء صغيرة'],
    '▪️': ['ساحة صغيرة سوداء'],
    '▫️': ['ساحة صغيرة بيضاء'],
    '💠': [
        'شكل ماسي مع دوت في الداخل',
        'إهدار',
        'زهور ماسية',
        'كاواي'
    ],
    '🔶': ['الماس البرتقالي الكبير'],
    '🔷': ['الماس الأزرق الكبير'],
    '🔸': ['الماس البرتقالي الصغير'],
    '🔹': ['الماس الأزرق الصغير'],
    '🔺': [
        'المثلث الأحمر في الأعلى',
        'المثلث الأحمر ذو النقاط العلوية'
    ],
    '🔻': [
        'مثلث أحمر منخفض',
        'المثلث الأحمر الذي يشير إلى الأسفل'
    ],
    '🔳': ['زر الساحة البيضاء'],
    '🔲': ['زر الساحة السوداء'],
    '©️': [
        'حقوق التأليف',
        'علامة حقوق الطبع والنشر'
    ],
    '®️': [
        'مسجل',
        'توقيع مسجل'
    ],
    '™️': [
        'علامة تجارية',
        'ذاكرة',
        'العلامة',
        'علامة علامة التجارة'
    ],
    '🛅': [
        'الأمتعة اليسرى',
        'حقيبة مع المفتاح',
        'حقيبة مقفلة'
    ],
    '🛄': ['المطالبة بالأمتعة'],
    '🛃': ['الجمارك'],
    '🛂': [
        'مراقبة جوازات السفر',
        'مراقبة الحدود'
    ],
    '🚰': [
        'رمز المياه الصالحة للشرب',
        'عطش',
        'عطش',
        'ضغطة المياه',
        'تجمع المياه'
    ],
    '🇦': [
        'حرف A',
        'حرف رمز المؤشر الإقليمي ألف'
    ],
    '🇧': [
        'الحرف B',
        'المؤشر الإقليمي رمز الحرف باء'
    ],
    '🇨': [
        'الحرف C',
        'رسالة رمز المؤشر الإقليمي جيم'
    ],
    '🇩': [
        'الحرف دال',
        'الحرف دال من رمز المؤشر الإقليمي'
    ],
    '🇪': [
        'الحرف هاء',
        'رسالة رمز المؤشر الإقليمي هاء'
    ],
    '🇫': [
        'الحرف F',
        'المؤشر الإقليمي رمز الحرف واو'
    ],
    '🇬': [
        'الحرف G',
        'رسالة رمز المؤشر الإقليمي زاي'
    ],
    '🇭': [
        'الحرف حاء',
        'رسالة رمز المؤشر الإقليمي حاء'
    ],
    '🇮': [
        'الحرف الأول',
        'رسالة رمز المؤشر الإقليمي الأولى'
    ],
    '🇯': [
        'رسالة ياء',
        'رسالة رمزية للمؤشر الإقليمي ياء'
    ],
    '🇰': [
        'الحرف K',
        'رسالة رمز المؤشر الإقليمي كاف'
    ],
    '🇱': [
        'حرف L',
        'رسالة رمز المؤشر الإقليمي لام'
    ],
    '🇲': [
        'حرف M',
        'رسالة رمزية للمؤشر الإقليمي M'
    ],
    '🇳': [
        'حرف N',
        'رمز المؤشر الإقليمي نون'
    ],
    '🇴': [
        'حرف O',
        'حرف رمز المؤشر الإقليمي سين'
    ],
    '🇵': [
        'حرف P',
        'رسالة رمز المؤشر الإقليمي عين'
    ],
    '🇶': [
        'الحرف Q',
        'رسالة رمز المؤشر الإقليمي فاء'
    ],
    '🇷': [
        'الحرف R',
        'رسالة الرمز R للمؤشر الإقليمي'
    ],
    '🇸': [
        'حرف S',
        'رسالة رمز المؤشر الإقليمي قاف'
    ],
    '🇹': [
        'حرف T',
        'رسالة الرمز T للمؤشر الإقليمي'
    ],
    '🇺': [
        'الحرف U',
        'رسالة رمزية للمؤشر الإقليمي شين'
    ],
    '🇻': [
        'الحرف الخامس',
        'حرف رمز المؤشر الإقليمي الخامس'
    ],
    '🇼': [
        'الحرف W',
        'رمز المؤشر الإقليمي الحرف W'
    ],
    '🇽': [
        'الحرف العاشر',
        'حرف رمز المؤشر الإقليمي العاشر'
    ],
    '🇾': [
        'حرف ص',
        'رسالة رمز المؤشر الإقليمي ذال'
    ],
    '🇿': [
        'حرف Z',
        'رسالة رمزية للمؤشر الإقليمي Z'
    ],
    '💌': [
        'حرف الحب',
        'ظرف القلب',
        'ملاحظة الحب'
    ],
    '🚮': [
        'ضع المطر في رمز المكان الخاص به',
        'لاعب في لافتة الشريط',
        'وضع الممر في سلة المهملات',
        'شخص مع سلة المهملات'
    ],
    '♿': [
        'رمز الكرسي العاجل',
        'حمام يمكن الوصول إليه'
    ],
    '🚹': [
        'رمز الرجال',
        'رمز الرجل',
        'مراحيض الرجال',
        'ريستروم الذكور',
        'ذكور WC'
    ],
    '🚺': [
        'رمز المرأة',
        'رمز المرأة',
        'مرحاض النساء',
        'مركز الأنثى',
        'الاتحاد العالمي الشهير'
    ],
    '🚻': [
        'ريستوم',
        'لافتة الحمام',
        'لافتة مرحاض',
        'علامة WC'
    ],
    '🚼': [
        'رمز الطفل',
        'مركز تغيير الطفل',
        'رمز تغيير الطفل',
        'حضانة'
    ],
    '🚾': [
        'إغلاق المياه',
        'WC',
        'المرحاض WC'
    ],
    '⚠️': [
        'علامة تحذير',
        'رمز التنبيه'
    ],
    '🚸': [
        'عبور الأطفال',
        'عبور الأطفال',
        'ممر المدرسة'
    ],
    '🔅': [
        'رمز السطوع المنخفض',
        'زر التعتيم',
        'تقليل السطوع'
    ],
    '🔆': [
        'رمز السطوع العالي',
        'زيادة السطوع',
        'زر مشرق'
    ],
    '📳': [
        'وضع الاهتزاز',
        'قلب الهاتف',
        'الوضع الصامت'
    ],
    '📴': ['إيقاف الهاتف المحمول'],
    '〰️': [
        'موجة',
        'هاش فاتح'
    ],
    '💱': ['صرف العملات'],
    '💲': [
        'لوحة الدولار الثقيلة',
        'دولار',
        'علامة الدولار'
    ],
    '♻️': [
        'رمز إعادة التدوير العام الأسود',
        'رمز إعادة التدوير',
        'شعار المحذوفات'
    ],
    '🔱': [
        'شعار ترايدنت',
        'بيتشفوك',
        'ترايدنت'
    ],
    '📛': [
        'اسم الشارة',
        'توفو على النار',
        'اسم العلامة',
        'علامة نارية'
    ],
    '🔰': [
        'الرمز الياباني للمبتدئ',
        'شوشنشا مارك',
        'درع أخضر أصفر'
    ],
    '➰': [
        'حلقة عاطفية',
        'حلقة تنازلية',
        'حلقة'
    ],
    '➿': [
        'تكرار التكرار المزدوج',
        'حلقة مزدوجة',
        'البريد الصوتي'
    ],
    '〽️': [
        'علامة التناوب',
        'م',
        'ماكدونالدز'
    ],
    '✳️': ['ثمانية نجمة منبوذة'],
    '✴️': [
        '8 نقاط نجمة سوداء',
        'نجم برتقالي',
        'ثمانية نجوم'
    ],
    '❇️': ['البانكلي'],
    'Ⓜ️': [
        'رسالة رأس المال اللاتينية الدائرية M',
        'دائرة M',
        'مترو',
        'دائرة M'
    ],
    '🈁': [
        'Squared Katakana Koko',
        'إشارة الكلمة اليابانية هنا',
        'هنا',
        'الوجهة'
    ],
    '🈂️': [
        'Squared Katakana Sa',
        'خدمة معنى الإشارة اليابانية أو رسوم الخدمة'
    ],
    '🈷️': [
        'إيديوغرافيا موحّدة CJK - 6708',
        'راديكالي 74',
        '月',
        'القيمة الشهرية للعلامة اليابانية'
    ],
    '🈶': [
        'إيديوغرافيا موحّدة CJK - 6709',
        'العلامة اليابانية غير مجانية',
        'مملوك',
        '有'
    ],
    '🈯': [
        'إيديوغرافيا موحّدة CJK - 6307',
        'معاني الإشارة اليابانية محجوزة',
        'نقطة الاصبع',
        '指'
    ],
    '🉐': [
        'ميزة الإيديوغراف الدائري',
        'صفقة معنى الإشارة اليابانية',
        'الحصول',
        '得'
    ],
    '🈹': [
        'إيديوغرافيا موحّدة CJK - 5272',
        'خصم معنى الإشارة اليابانية',
        'صفقة البيع',
        '割'
    ],
    '🈚': [
        '2 - إيديوغرافيا موحَّدة من طراز CJK 7121',
        'معاني الإشارة اليابانية مجانية',
        'مفقود',
        '無'
    ],
    '🈲': [
        'إيديوغرافيا موحَّدة تابعة لكلية جاك مربعة - 7981',
        'معاني الإشارة اليابانية محظورة',
        'Forbid',
        '禁'
    ],
    '🉑': [
        'قبول الإيديوغراف الدائري',
        'معاني العلامة اليابانية مقبولة',
        'قبول'
    ],
    '🈸': [
        'إيديوغرافيا موحّدة CJK - 7533',
        'تطبيق معنى الإشارة اليابانية',
        'نموذج الطلب',
        'قرد',
        'طلب',
        '申'
    ],
    '🈴': [
        'إيديوغرافيا موحّدة CJK - 5408',
        'تمرير معاني العلامة اليابانية (المستوى)',
        'إتفاقية',
        '合'
    ],
    '🈳': [
        'إيديوغرافيا موحّدة CJK - 7a7(أ)',
        'الشعار الياباني يعني',
        'فارغة ومتاحة',
        '空'
    ],
    '㊗️': [
        'تهانينا الإيديوغراف الدائري',
        'تهانينا على الإشارة اليابانية'
    ],
    '㊙️': [
        'سر الإيديوغراف الدائري',
        'سر معاني الإشارة اليابانية',
        'سرية'
    ],
    '🈺': [
        'إيديوغرافيا موحّدة CJK مربعة - 55b6',
        'العلامة اليابانية مفتوحة للأعمال التجارية',
        'العمل',
        '営'
    ],
    '🈵': [
        'إيديوغرافيا موحّدة CJK - 6e80',
        'إشارة يابانية ذات معنى كاملة؛ بدون شغور',
        'كامل',
        '満'
    ],
    '🔘': ['زر الراديو'],
    '🛑': [
        'إيقاف التوقيع',
        'لافتة اجنبية'
    ],
    '⚕️': [
        'الرمز الطبي',
        'الأنابيس',
        'Asklepios',
        'زخرفة اسكليبيوس',
        'موظفو الإسكوابيوس'
    ],
    '🛗': [
        'المصعد',
        'رفع'
    ],
    '⚧️': ['رمز نقل الجنس'],
    '♂️': [
        'لافتة الذكور',
        'رمز الرجل',
        'رمز المريخ'
    ],
    '♀️': [
        'لافتة الأنثى',
        'رمز المرأة',
        'Venus Symbol'
    ]
};
/*food and drinks*/
emojis_language[lang][6] = {
    '🍇': [
        'رسومات',
        'غضب'
    ],
    '🍈': [
        'حدين',
        'Cantaloupe',
        'العسل',
        'مسكميلون'
    ],
    '🍉': ['البطيخ'],
    '🍊': [
        'Tangerine',
        'Mandarin',
        'برتقالي'
    ],
    '🍋': [
        'الليمون',
        'ليمونادي'
    ],
    '🍌': [
        'الموز',
        'النبات'
    ],
    '🍍': ['أناناس'],
    '🥭': ['Mango'],
    '🍎': [
        'تفاح أحمر',
        'تفاحة حمراء لذيذة'
    ],
    '🍏': [
        'تفاحة خضراء',
        'تفاحة لذيذة ذهبية',
        'تفاحة جراني سميث'
    ],
    '🍐': ['ذبابة'],
    '🍑': [
        'خوخ',
        'أسفل',
        'بايت'
    ],
    '🍒': [
        'تشيرز',
        'الكرز',
        'الكرز البري'
    ],
    '🍓': ['الفراولة'],
    '🥝': [
        'فاكهة كيوي',
        'جوزيبيري صيني',
        'كيوي',
        'كيويفاكيت'
    ],
    '🍅': ['توماتو'],
    '🥥': [
        'جوز الهند',
        'Cocoanut'
    ],
    '🥑': ['أأدورادو'],
    '🍆': [
        'النبات',
        'Aubergine',
        'فاليس',
        'الخضار الأرجوانية'
    ],
    '🥔': [
        'بطاطس',
        'بطاطا منبوذة',
        'إيداهو بوتو'
    ],
    '🥕': ['الجزرة'],
    '🌽': [
        'ذرة الذرة',
        'الذرة',
        'الذرة في اللعبة',
        'الذرة',
        'ذرة الذرة'
    ],
    '🌶️': [
        'بيبر ساخن',
        'شيلي بيبر',
        'حار'
    ],
    '🥒': [
        'خيار',
        'جيركين',
        'اختيار'
    ],
    '🥬': [
        'خضراء ورقي',
        'اختيار الكتاب',
        'كابوت صيني',
        'Cos Lettuce',
        'الروم ليتوس',
        'خضراء ورقيون'
    ],
    '🥦': ['بروكولي'],
    '🍄': [
        'الفطر',
        'غرف',
        'Toadstool'
    ],
    '🥜': [
        'Peanuts',
        'فتحات'
    ],
    '🌰': [
        'شيستنوت',
        'أكورن',
        'توالد'
    ],
    '🍞': [
        'الخبز',
        'لوح الخبز'
    ],
    '🥐': ['Croissant'],
    '🥖': [
        'خبز باغيت',
        'الخبز الفرنسي',
        'باجيت'
    ],
    '🥨': ['Pretzel'],
    '🥯': ['باجل'],
    '🥞': [
        'بانكاك',
        'خلل',
        'الكعك'
    ],
    '🧀': [
        'زجاج الجبن',
        'جبن'
    ],
    '🍖': [
        'لحم على العظام',
        'BQ',
        'باربيكو',
        'لحم المانغا'
    ],
    '🍗': [
        'Poultry Leg',
        'عصا البراميل',
        'ساق تركيا'
    ],
    '🥩': [
        'قطع اللحم',
        'لحم',
        'ستاك'
    ],
    '🥓': [
        'البقع',
        'Rashers'
    ],
    '🍔': [
        'هامبورغر',
        'برغر',
        'شيشيبورجر'
    ],
    '🍟': [
        'الأصفر الفرنسيون',
        'رقائق',
        'الأبراج',
        'ماكدونالدز فريز'
    ],
    '🍕': [
        'بيتزا',
        'بيبيروني بيتزا',
        'شريحة بيتزا'
    ],
    '🌭': [
        'كلب ساخن',
        'هوتدوج',
        'حمام'
    ],
    '🥪': ['ساندويتش'],
    '🌮': ['تاكو'],
    '🌯': [
        'Burrito',
        'تغليف'
    ],
    '🥙': [
        'حشو فلاتفريد',
        'Doner Kebab',
        'Gyro',
        'شاوارما',
        'بيتا ساندويتش'
    ],
    '🍳': [
        'الطبخ',
        'الإفطار',
        'البيض المقلي',
        'حفر العصابة'
    ],
    '🥘': [
        'قبيلة غذاء شالو',
        'Paella',
        'رجل الطعام'
    ],
    '🍲': [
        'طقم الطعام',
        'زئبق الطعام',
        'حساء',
        'خندق'
    ],
    '🥣': [
        'بوديل مع سبون',
        'حبوب الحبوب'
    ],
    '🥗': [
        'صلاد أخضر',
        'صلاح'
    ],
    '🍿': [
        'البوكورن',
        'الذرة المنبضة'
    ],
    '🧂': [
        'ملح',
        'ملح شاكر'
    ],
    '🥫': [
        'طعام مسبق',
        'آلة الطعام',
        'علبة التدوين',
        'طعام مصنوع'
    ],
    '🍱': [
        'صندوق بينتو',
        'صندوق الغداء'
    ],
    '🍘': [
        'راكوب الأرز',
        'كراكر'
    ],
    '🍙': [
        'كرة الأرز',
        'Onigiri'
    ],
    '🍚': [
        'الأرز المطبوخ',
        'الأرز المدبغ',
        'الأرز',
        'براز الأرز',
        'الأرز البارد'
    ],
    '🍛': [
        'أرز كوري',
        'كوري',
        'طعام هندي',
        'كوري وأرز'
    ],
    '🍜': [
        'بوديل البورصة',
        'العقدة',
        'العقدة مع عصي Chopstics',
        'رامين'
    ],
    '🍝': [
        'Spaghetti',
        'باستا'
    ],
    '🍠': [
        'بطاطا حلوة متجولة',
        'بطاطا حلوة',
        'يام'
    ],
    '🍢': [
        'خشبي',
        'Kebab',
        'منحنى'
    ],
    '🍣': [
        'سوشي',
        'Sashimi',
        'الأطعمة البحرية'
    ],
    '🍤': [
        'كريم مقلي',
        'براون المقلي',
        'بريمب تيمبورا'
    ],
    '🍥': [
        'كعكة السمك مع البوارل',
        'كعكة الصيد',
        'Pink Swirl'
    ],
    '🥮': [
        'كعكة القمر',
        'كعكة القمر'
    ],
    '🍡': [
        'Dango',
        'عصا الحلوى',
        'الكرات الخضراء الوردية'
    ],
    '🥟': [
        'الزلازل',
        'Empanada',
        'Pierogi'
    ],
    '🥠': ['كعكة الثروة'],
    '🥡': [
        'الصندوق المأخوذ',
        'صندوق الغذاء الصيني',
        'Oyster Pail'
    ],
    '🍦': [
        'آيس كريم ناعم',
        'السيد ويبي',
        'خدمة ناعمة'
    ],
    '🍧': [
        'الجليد المسحوق',
        'مخروط الثلج'
    ],
    '🍨': [
        'الآيس كريم',
        'بئر الآيس كريم',
        'حلوى'
    ],
    '🍩': [
        'البندق',
        'Donut'
    ],
    '🍪': [
        'كوكي',
        'بيسكويت',
        'كعكة شريحة الشوكولاتة'
    ],
    '🎂': [
        'كعكة عيد الميلاد',
        'تاريخ الميلاد',
        'كعكة',
        'كعكة مع الشموع'
    ],
    '🍰': [
        'كعكة قصيرة',
        'كعكة',
        'قطعة من الكعكة',
        'كعكة الفراولة'
    ],
    '🧁': [
        'كب كيك',
        'كعكة جنية'
    ],
    '🥧': ['دائري'],
    '🍫': [
        'شريط الشوكولاتة',
        'شريط الحلوى',
        'شوكولاتة'
    ],
    '🍬': [
        'حلوى',
        'رديء',
        'لطيف'
    ],
    '🍭': [
        'لوليبوب',
        'ناشر'
    ],
    '🍮': [
        'كستار',
        'Creme Caramel',
        'حلوى',
        'فلان',
        'بودينغ'
    ],
    '🍯': [
        'عسل العسل',
        'العسل',
        'باقة'
    ],
    '🍼': [
        'زجاجة طفل',
        'تغذية الزجاج'
    ],
    '🥛': [
        'زجاج الحليب',
        'الحليب'
    ],
    '☕': [
        'مشروب ساخن',
        'قهوة',
        'Espresso',
        'شوكولاتة ساخنة',
        'شاي'
    ],
    '🍵': [
        'ترتيب بدون معالجة',
        'شاي أخضر',
        'Matcha',
        'شاي ماتشا الأخضر'
    ],
    '🍶': [
        'Sake',
        'زجاجة',
        'نبيذ الأرز',
        'كأس وزجاج الزجاجة'
    ],
    '🍾': [
        'زجاجة مع النوافذ المنبثقة',
        'الاحتفال',
        'Champagne',
        'نبيذ بارج'
    ],
    '🍷': [
        'زجاج نبيذ',
        'الكحول',
        'نبيذ أحمر',
        'نبيذ'
    ],
    '🍸': [
        'زجاج كوكتيل',
        'كوكتيل',
        'مارتيني'
    ],
    '🍹': [
        'شرب مداري',
        'بنطال الفاكهة',
        'شرب تيكي'
    ],
    '🍺': [
        'كوب البيرة',
        'بيرة',
        'بيرة ستاين'
    ],
    '🍻': [
        'ربط بيرة البيرة',
        'بيرة',
        'سخيف'
    ],
    '🥂': [
        'نظارات ربط',
        'الاحتفال',
        'نظارات شامباني',
        'سخيف'
    ],
    '🥃': [
        'زجاج التبلر',
        'بوربون',
        'المشروبات',
        'Rum',
        'ويسكي',
        'Whisky'
    ],
    '🥤': [
        'كأس مع الستار',
        'اللبن',
        'ثقب',
        'بوب سودا',
        'مشروب ناعم'
    ],
    '🥢': ['عصي'],
    '🍽️': [
        'فورك و سكين مع لوحة',
        'العشاء'
    ],
    '🍴': [
        'الفورك والسكين',
        'القطع',
        'سكين وفورك',
        'الفضة'
    ],
    '🥄': ['بقعة'],
    '🧄': ['الثورليك'],
    '🧅': ['أونيون'],
    '🧇': ['Waffle'],
    '🧆': ['Falafel'],
    '🧈': ['الزبائن'],
    '🦪': ['المحار'],
    '🧃': [
        'صندوق المشروبات',
        'صندوق العصير'
    ],
    '🧉': [
        'شرب الميت',
        'Chimarra<unk>',
        'Cimarrón',
        'اليربا ماتي'
    ],
    '🫒': ['زيتون'],
    '🫐': ['زرقاء'],
    '🫑': ['بيل بيبر'],
    '🫓': ['فلاتفريد'],
    '🫔': [
        'التامالي',
        'التامال'
    ],
    '🫕': ['Fondue'],
    '🧋': [
        'شاي الفقاعات',
        'Boba'
    ],
    '🧊': ['مكعب جليدي'],
    '🫘': [
        'Beans',
        'Flatulence',
        'Coffee beans',
        'Spill the beans'
    ],
    '🫗': [
        'Pouring Liquid',
        'Pouring Drink',
        'الماء'
    ]
};
/*flags*/
emojis_language[lang][7] = {
    '🏁': [
        'راية مخدرة',
        'العلم المختار',
        'فتيات الشبكة',
        'راية السباق'
    ],
    '🚩': [
        'العلم الثلاثي',
        'العلم على القطب',
        'العلم الأحمر',
        'العلم الثلاثي عند الرد'
    ],
    '🎌': [
        'الأعلام المتداخلة',
        'علامتان'
    ],
    '🏴': [
        'العلم الأسود',
        'حفظ العلم الأسود'
    ],
    '🏳️': [
        'العلم الأبيض',
        'إنقاذ العلم الأبيض'
    ],
    '🏳️‍🌈': [
        'راية قوس قزح',
        'Pride Flag',
        'LGBT',
        'LGBTQIA+',
        'Gay',
        'Transgender',
        'Lesbian',
        'Asexual',
        'Queer'
    ],
    '🏳️‍⚧️': [
        'نقل العلم',
        'أزرق، وردي، وعلم أبيض',
        'عبر العلم'
    ],
    '🏴‍☠️': [
        'علم القراصنة',
        'جولي روجر'
    ],
    '🇺🇳': [
        'علم الأمم المتحدة',
        'الأمم المتحدة',
        'العلامة: الأمم المتحدة'
    ],
    '🇪🇺': [
        'علم الاتحاد الأوروبي',
        'EU',
        'العلم: الاتحاد الأوروبي',
        'EU Flag'
    ],
    '🇦🇨': [
        'علم جزيرة أسنشن',
        'AC'
    ],
    '🇦🇩': [
        'علم أندورا',
        'AD',
        'Andorran Flag'
    ],
    '🇦🇪': [
        'علم الإمارات العربية المتحدة',
        'AE',
        'Emirati Flag',
        'علم الإمبراطور'
    ],
    '🇦🇫': [
        'علم أفغانستان',
        'AF',
        'Afghan Flag'
    ],
    '🇦🇬': [
        'علم أنتيغوا وبربودا',
        'AG'
    ],
    '🇦🇮': [
        'علم أنغيلا',
        'AI',
        'العلم الأنغيلي'
    ],
    '🇦🇱': [
        'علم ألبانيا',
        'AL',
        'العلم الألباني'
    ],
    '🇦🇲': [
        'علم أرمينيا',
        'صباحا',
        '🇦🇲'
    ],
    '🇦🇴': [
        'علم أنغولا',
        'صباحا',
        'العلم الأنغولي'
    ],
    '🇦🇶': [
        'علم القارة القطبية الجنوبية',
        'AQ',
        'علم أنتاركتيكا'
    ],
    '🇦🇷': [
        'علم الأرجنتين',
        'AR',
        'العلم الأرجنتيني'
    ],
    '🇦🇸': [
        'علم ساموا الأمريكية',
        'AS',
        'American Samoan Flag'
    ],
    '🇦🇹': [
        'علم النمسا',
        'في',
        'Austrian Flag'
    ],
    '🇦🇺': [
        'علم أستراليا',
        'الاتحاد الأفريقي',
        'العلم الأسيسي',
        'العلم الأسترالي'
    ],
    '🇦🇼': [
        'علم أروبا',
        'أوي',
        'علم أروبا'
    ],
    '🇦🇽': [
        'علم جزر آلاند',
        'إكس',
        'علم الارض'
    ],
    '🇦🇿': [
        'علم أذربيجان',
        'AZ',
        'علم أذربيجان'
    ],
    '🇧🇦': [
        'علم البوسنة والهرسك',
        'BA'
    ],
    '🇧🇧': [
        'علم بربادوس',
        'BB',
        'علم بربادوس',
        'علم البجان'
    ],
    '🇧🇩': [
        'علم بنغلاديش',
        'BD',
        'Bangladeshi Flag'
    ],
    '🇧🇪': [
        'علم بلجيكا',
        'باي',
        'العلم البلجيكي'
    ],
    '🇧🇫': [
        'علم بوركينا فاسو',
        'BF',
        'علم بوركينا فاسو'
    ],
    '🇧🇬': [
        'علم بلغاريا',
        'BG',
        'العلم البلغاري'
    ],
    '🇧🇭': [
        'علم البحرين',
        'BH',
        'علم البهراني',
        'العلم البحريني'
    ],
    '🇧🇮': [
        'علم بوروندي',
        'BI',
        'Burundian Flag'
    ],
    '🇧🇯': [
        'علم بنن',
        'BJ',
        'علم بنن'
    ],
    '🇧🇱': [
        'علم القديس بارثيو ليمي',
        'BL',
        'العلامة: سانت بارثيوليمي'
    ],
    '🇧🇲': [
        'علم برمودا',
        'BM',
        'Bermudan Flag'
    ],
    '🇧🇳': [
        'علم بروني',
        'BN',
        'علم برونيان'
    ],
    '🇧🇴': [
        'علم بوليفيا',
        'BO',
        'Bolivian Flag'
    ],
    '🇧🇶': [
        'علم هولندا الكاريبية',
        'عش',
        'Bonaire'
    ],
    '🇧🇷': [
        'علم البرازيل',
        'BR',
        'العلم البرازيلي'
    ],
    '🇧🇸': [
        'علم جزر البهاما',
        'علم البهاما',
        'BS'
    ],
    '🇧🇹': [
        'علم بوتان',
        'بيوتري',
        'العلم البوتاني'
    ],
    '🇧🇻': [
        'علم جزيرة بوفت',
        'BV',
        'العلامة: جزيرة بوفت'
    ],
    '🇧🇼': [
        'علم بوتسوانا',
        'BW',
        'Batswana Flag'
    ],
    '🇧🇾': [
        'علم بيلاروس',
        'باري',
        'العلم البيلاروسي'
    ],
    '🇧🇿': [
        'علم بليز',
        'BZ',
        'علم بليز'
    ],
    '🇨🇦': [
        'علم كندا',
        'العلم الكندي',
        'CA'
    ],
    '🇨🇨': [
        'علم جزر كوكوس (كيلينغ)',
        'CC'
    ],
    '🇨🇩': [
        'Flag of Congo - Kinshasa',
        'قرص'
    ],
    '🇨🇫': [
        'علم جمهورية أفريقيا الوسطى',
        'CF',
        'علم أفريقيا الوسطى'
    ],
    '🇨🇬': [
        'علم الكونغو - برازافيل',
        'CG'
    ],
    '🇨🇭': [
        'علم سويسرا',
        'CH',
        'الصليب الأحمر',
        'العلم السويسري'
    ],
    '🇨🇮': [
        'علم ساحل العاج',
        'CI',
        'Flag: Côte d’Ivoire'
    ],
    '🇨🇰': [
        'علم جزر كوك',
        'CK',
        'علم جزر كوك'
    ],
    '🇨🇱': [
        'علم شيلي',
        'CL',
        'العلم الشيلي'
    ],
    '🇨🇲': [
        'علم الكاميرون',
        'CM',
        'العلم الكاميروني'
    ],
    '🇨🇳': [
        'علم الصين',
        'سي',
        'العلم الصيني'
    ],
    '🇨🇴': [
        'علم كولومبيا',
        'كهربائي',
        'العلم الكولومبي'
    ],
    '🇨🇵': [
        'علم جزيرة كليبرتون',
        'CP)',
        'العلامة: جزيرة كليبرتون'
    ],
    '🇨🇷': [
        'علم كوستاريكا',
        'CR',
        'العلم الكوستاريكي'
    ],
    '🇨🇺': [
        'علم كوبا',
        'CU',
        'العلم الكوبي'
    ],
    '🇨🇻': [
        'علم الرأس الأخضر',
        'السيرة الذاتية',
        'علم الرأس الأخضر'
    ],
    '🇨🇼': [
        'علم كوراتشو',
        'CW',
        'Curaçaoan Flag'
    ],
    '🇨🇽': [
        'علم جزيرة عيد الميلاد',
        'CX',
        'علم جزيرة عيد الميلاد'
    ],
    '🇨🇾': [
        'علم قبرص',
        'CY',
        'العلم القبرصي'
    ],
    '🇨🇿': [
        'علم تشيكيا',
        'CZ',
        'العلم التشيكي'
    ],
    '🇩🇪': [
        'علم ألمانيا',
        'دي',
        'علم الدوتش',
        'العلم الألماني'
    ],
    '🇩🇬': [
        'علم دييغو غارسيا',
        'DG',
        'العلامة: دييغو غارسيا'
    ],
    '🇩🇯': [
        'علم جيبوتي',
        'DJ',
        'Djibouti Flag',
        'Djiboutian Flag'
    ],
    '🇩🇰': [
        'علم الدانمرك',
        'DK',
        'العلم الدانماركي'
    ],
    '🇩🇲': [
        'علم دومينيكا',
        'DM'
    ],
    '🇩🇴': [
        'علم الجمهورية الدومينيكية',
        'داو',
        'علم Dom Rep',
        'علم دومينيكي'
    ],
    '🇩🇿': [
        'علم الجزائر',
        'DZ',
        'Algerian Flag'
    ],
    '🇪🇦': [
        'علم سيوتا وميليلا',
        'علم مليلية',
        'علم السيوتا',
        'EA',
        'Flag: Ceuta & Melilla'
    ],
    '🇪🇨': [
        'علم إكوادور',
        'EC',
        'Ecuadorian Flag'
    ],
    '🇪🇪': [
        'علم إستونيا',
        'EE',
        'العلم الإستوني'
    ],
    '🇪🇬': [
        'علم مصر',
        'EG',
        'العلم المصري'
    ],
    '🇪🇭': [
        'علم الصحراء الغربية',
        'إتش',
        'علم الصحراء الغربية'
    ],
    '🇪🇷': [
        'علم إريتريا',
        'ER',
        'Eritrean Flag'
    ],
    '🇪🇹': [
        'علم إثيوبيا',
        'ET',
        'Ethiopian Flag'
    ],
    '🇪🇸': [
        'علم اسبانيا',
        'إس',
        'العلم الإسباني'
    ],
    '🇫🇮': [
        'علم فنلندا',
        'FI',
        'العلم الفنلندي'
    ],
    '🇫🇯': [
        'علم فيجي',
        'FJ',
        'Fijian Flag'
    ],
    '🇫🇰': [
        'علم جزر فوكلاند',
        'FK',
        'علم الفولاندر'
    ],
    '🇫🇲': [
        'علم ميكرونيزيا',
        'FM',
        'العلم الميكرونيزي'
    ],
    '🇫🇴': [
        'علم جزر فارو',
        'فوتور',
        'Faroe Islander Flag'
    ],
    '🇫🇷': [
        'علم فرنسا',
        'FR',
        'العلم الفرنسي'
    ],
    '🇬🇦': [
        'علم غابون',
        'الجمعية',
        'العلم الغابوني'
    ],
    '🇬🇧': [
        'علم بريطانيا العظمى',
        'جيجابايت',
        'العلم البريطاني',
        'المملكة المتحدة',
        'اتحاد جاك',
        'المملكة المتحدة'
    ],
    '🏴󠁧󠁢󠁥󠁮󠁧󠁿󠁧󠁢󠁥󠁮󠁧󠁿': [
        'Flag of England',
        'St George\'s Cross',
        'English Flag'
    ],
    '🏴󠁧󠁢󠁷󠁬󠁳󠁿󠁧󠁢󠁷󠁬󠁳󠁿': [
        'Flag of Wales',
        'Welsh Flag',
        'Red Dragon',
        'Baner Cymru',
        'Y Ddraig Goch'
    ],
    '🏴󠁧󠁢󠁳󠁣󠁴󠁿󠁧󠁢󠁳󠁣󠁴󠁿': [
        'Flag of Scotland',
        'Scottish Flag',
        'St Andrew\'s Cross',
        'Saltire'
    ],
    '🇬🇩': [
        'علم غرينادا',
        'GD',
        'علم غرينادا'
    ],
    '🇬🇪': [
        'علم جورجيا',
        'GE',
        'العلم الجورجي'
    ],
    '🇬🇫': [
        'علم غيانا الفرنسية',
        'GF',
        'العلم الغيني الفرنسي'
    ],
    '🇬🇬': [
        'علم غيرنسي',
        'GG',
        'Guernsey Flag'
    ],
    '🇬🇭': [
        'علم غانا',
        'ج.ث',
        'العلم الغاني'
    ],
    '🇬🇮': [
        'علم جبل طارق',
        'GI',
        'علم جبل طارق'
    ],
    '🇬🇱': [
        'علم غرينلاند',
        'GL',
        'Greenlandic Flag'
    ],
    '🇬🇲': [
        'علم غامبيا',
        'م',
        'Gambian Flag'
    ],
    '🇬🇳': [
        'علم غينيا',
        'GN',
        'Guinean Flag'
    ],
    '🇬🇵': [
        'علم غوادلوب',
        'GP',
        'علم غواديلوب'
    ],
    '🇬🇶': [
        'علم غينيا الاستوائية',
        'غي',
        'Equatorial Guinean Flag',
        'العلم الكواتوغيني'
    ],
    '🇬🇷': [
        'علم اليونان',
        'غرين',
        'العلم اليوناني'
    ],
    '🇬🇸': [
        'علم جورجيا الجنوبية وجزر ساندويتش الجنوبية',
        'خ'
    ],
    '🇬🇹': [
        'علم غواتيمالا',
        'ج.تي',
        'Guatemalan Flag'
    ],
    '🇬🇺': [
        'علم غوام',
        'GU',
        'العلم الغواماني',
        'علم الشامورو'
    ],
    '🇬🇼': [
        'علم غينيا - بيساو',
        'GW',
        'Guinea-Bissau Flag'
    ],
    '🇬🇾': [
        'علم غيانا',
        'GY',
        'علم غيانا'
    ],
    '🇭🇰': [
        'علم منطقة هونغ كونغ الإدارية الخاصة الصينية',
        'HK',
        'علم هونغ كونغ'
    ],
    '🇭🇲': [
        'علم جزر سمع وماكدونالد',
        'HM',
        'العلم: سمع آند ماكدونالد جزر'
    ],
    '🇭🇳': [
        'علم هندوراس',
        'HN',
        'علم هندوراس'
    ],
    '🇭🇷': [
        'علم كرواتيا',
        'أخصائي',
        'العلم الكرواتي'
    ],
    '🇭🇹': [
        'علم هايتي',
        'HT',
        'Haitian Flag'
    ],
    '🇭🇺': [
        'علم هنغاريا',
        'هيو',
        'العلم الهنغاري'
    ],
    '🇮🇨': [
        'علم جزر الكناري',
        'كهرباء'
    ],
    '🇮🇩': [
        'علم إندونيسيا',
        'ID',
        'العلم الإندونيسي'
    ],
    '🇮🇪': [
        'علم أيرلندا',
        'آي',
        'العلم الأيرلندي'
    ],
    '🇮🇱': [
        'علم إسرائيل',
        'IL',
        'العلم الإسرائيلي'
    ],
    '🇮🇲': [
        'علم جزيرة مان',
        'IM',
        'Manx Flag'
    ],
    '🇮🇳': [
        'علم الهند',
        'في',
        'العلم الهندي'
    ],
    '🇮🇴': [
        'علم إقليم المحيط الهندي البريطاني',
        'IO',
        'علم إقليم المحيط الهندي البريطاني'
    ],
    '🇮🇶': [
        'علم العراق',
        'IQ',
        'Iraqi Flag'
    ],
    '🇮🇷': [
        'علم إيران',
        'IR',
        'العلم الإيراني'
    ],
    '🇮🇸': [
        'علم أيسلندا',
        'إس',
        'العلم الآيسلندي'
    ],
    '🇮🇹': [
        'علم إيطاليا',
        'تكنولوجيا',
        'العلم الإيطالي'
    ],
    '🇯🇪': [
        'علم جيرسي',
        'جي',
        'علم جيرسي'
    ],
    '🇯🇲': [
        'علم جامايكا',
        'JM',
        'العلم الجامايكي'
    ],
    '🇯🇴': [
        'علم الأردن',
        'جيو',
        'العلم الأردني'
    ],
    '🇯🇵': [
        'علم اليابان',
        'JP',
        'العلم الياباني'
    ],
    '🇰🇪': [
        'علم كينيا',
        'KE',
        'العلم الكيني'
    ],
    '🇰🇬': [
        'علم قيرغيزستان',
        'KG',
        'Kyrgyzstani Flag'
    ],
    '🇰🇭': [
        'علم كمبوديا',
        'كيه',
        'العلم الكمبودي'
    ],
    '🇰🇮': [
        'علم كيريباس',
        'KI',
        'علم كيريباتي'
    ],
    '🇰🇲': [
        'علم جزر القمر',
        'كيلوبايت',
        'علم جزر القمر'
    ],
    '🇰🇳': [
        'علم سانت كيتس ونيفيس',
        'KN'
    ],
    '🇰🇵': [
        'علم كوريا الشمالية',
        'KP',
        'علم كوريا الشمالية'
    ],
    '🇰🇷': [
        'علم كوريا الجنوبية',
        'KR',
        'علم كوريا الجنوبية'
    ],
    '🇰🇼': [
        'علم الكويت',
        'KW',
        'Kuwaiti Flag'
    ],
    '🇰🇾': [
        'علم جزر كايمان',
        'كيه',
        'العلم الكايماني'
    ],
    '🇰🇿': [
        'علم كازاخستان',
        'كيس',
        'Kazakhstani Flag',
        'Kazakh Flag'
    ],
    '🇱🇦': [
        'علم لاوس',
        'لاي',
        'العلم اللاوي',
        'علم لاو'
    ],
    '🇱🇧': [
        'علم لبنان',
        'لوبايت',
        'العلم اللبناني'
    ],
    '🇱🇨': [
        'علم سانت لوسيا',
        'LC'
    ],
    '🇱🇮': [
        'علم ليختنشتاين',
        'ليو',
        'علم ليختنشتاين'
    ],
    '🇱🇰': [
        'علم سري لانكا',
        'LK',
        'العلم السريلانكي'
    ],
    '🇱🇷': [
        'علم ليبريا',
        'لر',
        'العلم الليبري'
    ],
    '🇱🇸': [
        'Flag of Lesotho',
        'LS',
        'Basotho Flag'
    ],
    '🇱🇹': [
        'علم ليتوانيا',
        'LT',
        'العلم الليتواني'
    ],
    '🇱🇺': [
        'علم لكسمبرغ',
        'ليو',
        'علم لكسمبرغ'
    ],
    '🇱🇻': [
        'علم لاتفيا',
        'LV',
        'العلم اللاتفي'
    ],
    '🇱🇾': [
        'علم ليبيا',
        'لاي',
        'العلم الليبي'
    ],
    '🇲🇦': [
        'علم المغرب',
        'ميغا',
        'العلم المغربي'
    ],
    '🇲🇨': [
        'علم موناكو',
        'ميغابايت',
        'علم موناكو'
    ],
    '🇲🇩': [
        'علم مولدوفا',
        'ميغابايت',
        'علم مولدوفا'
    ],
    '🇲🇪': [
        'علم الجبل الأسود',
        'أنا',
        'علم الجبل الأسود'
    ],
    '🇲🇫': [
        'علم القديس مارتن',
        'MF',
        'Flag: St. Martin'
    ],
    '🇲🇬': [
        'علم مدغشقر',
        'ميغابايت',
        'Madagascan Flag'
    ],
    '🇲🇭': [
        'علم جزر مارشال',
        'MH',
        'علم المارشال'
    ],
    '🇲🇰': [
        'علم مقدونيا',
        'MK',
        'العلم المقدوني'
    ],
    '🇲🇱': [
        'علم مالي',
        'ML',
        'العلم المالي'
    ],
    '🇲🇲': [
        'علم ميانمار (بورما)',
        'م.ث',
        'أو علم ماوريس',
        'العلم لبورما',
        'العلم البورمي'
    ],
    '🇲🇳': [
        'علم منغوليا',
        'ميغابايت',
        'العلم المنغولي'
    ],
    '🇲🇴': [
        'علم ماكاو سار الصين',
        'صباحا',
        'علم ماكاني'
    ],
    '🇲🇵': [
        'علم جزر ماريانا الشمالية',
        'ماكينة',
        'العلم الميكرونيزي'
    ],
    '🇲🇶': [
        'علم المارتينيك',
        'MQ',
        'علم الثعبان للمارتينيك',
        'علم المارتينيكايس'
    ],
    '🇲🇷': [
        'علم موريتانيا',
        'ر.ث',
        'العلم الموريتاني'
    ],
    '🇲🇸': [
        'Flag of Montserrat',
        'ميغابايت',
        'Montserratian Flag'
    ],
    '🇲🇹': [
        'علم مالطة',
        'ميغاتور',
        'Maltese Flag'
    ],
    '🇲🇺': [
        'Flag of Mauritius',
        'ميمو',
        'علم موريشيوس'
    ],
    '🇲🇻': [
        'علم ملديف',
        'ميغابايت',
        'علم ملديف'
    ],
    '🇲🇼': [
        'علم ملاوي',
        'MW',
        'Malawian Flag'
    ],
    '🇲🇽': [
        'علم المكسيك',
        'ميكس',
        'العلم المكسيكي'
    ],
    '🇲🇾': [
        'علم ماليزيا',
        'أنا',
        'Malaysian Flag'
    ],
    '🇲🇿': [
        'علم موزامبيق',
        'ميجاي',
        'العلم الموزامبيقي'
    ],
    '🇳🇦': [
        'علم ناميبيا',
        'م.ن',
        'Namibian Flag'
    ],
    '🇳🇨': [
        'علم كاليدونيا الجديدة',
        'NC',
        'علم كاليدونيا الجديدة'
    ],
    '🇳🇪': [
        'علم النيجر',
        'نيو',
        'العلم النيجيري'
    ],
    '🇳🇫': [
        'علم جزيرة نورفولك',
        'NF',
        'علم جزيرة نورفولك'
    ],
    '🇳🇬': [
        'علم نيجيريا',
        'NG',
        'العلم النيجيري'
    ],
    '🇳🇮': [
        'Flag of Nicaragua',
        'NI',
        'Nicaraguan Flag'
    ],
    '🇳🇱': [
        'علم هولندا',
        'NL',
        'العلم الهولندي',
        'هولندا'
    ],
    '🇳🇴': [
        'علم النرويج',
        'لا',
        'العلم النرويجي'
    ],
    '🇳🇵': [
        'علم نيبال',
        'NP',
        'العلم النيبالي'
    ],
    '🇳🇷': [
        'علم ناورو',
        'نيو',
        'Nauruan Flag'
    ],
    '🇳🇺': [
        'علم نيوي',
        'NU',
        'Niuean Flag'
    ],
    '🇳🇿': [
        'علم نيوزيلندا',
        'نيوزي',
        'علم كيوي'
    ],
    '🇴🇲': [
        'علم عمان',
        'ذ',
        'العلم العماني'
    ],
    '🇵🇦': [
        'علم بنما',
        'السلطة الفلسطينية',
        'العلم البنمي'
    ],
    '🇵🇪': [
        'علم بيرو',
        'PE',
        'علم بيرو'
    ],
    '🇵🇫': [
        'علم بولينيزيا الفرنسية',
        'PF',
        'العلم البولينيزي الفرنسي'
    ],
    '🇵🇬': [
        'علم بابوا غينيا الجديدة',
        'PG',
        'علم PNG',
        'Papua New Guinean Flag'
    ],
    '🇵🇭': [
        'علم الفلبين',
        'PH'
    ],
    '🇵🇰': [
        'علم باكستان',
        'PK',
        'العلم الباكستاني'
    ],
    '🇵🇱': [
        'علم بولندا',
        'PL',
        'العلم البولندي'
    ],
    '🇵🇲': [
        'علم القديس بيير وميكلون',
        'رسالة'
    ],
    '🇵🇳': [
        'علم بيتكيرن',
        'PN'
    ],
    '🇵🇷': [
        'علم بورتوريكو',
        'PR',
        'العلم البورتوريكي'
    ],
    '🇵🇸': [
        'علم الأراضي الفلسطينية',
        'ق',
        'Palestine'
    ],
    '🇵🇹': [
        'علم البرتغال',
        'PT',
        'العلم البرتغالي'
    ],
    '🇵🇼': [
        'علم بالاو',
        'بايت',
        'علم بالاو'
    ],
    '🇵🇾': [
        'علم باراغواي',
        'PY',
        'Paraguayan Flag'
    ],
    '🇶🇦': [
        'علم قطر',
        'QA',
        'العلم القطري'
    ],
    '🇷🇪': [
        'علم اتحاد Re<unk> Union',
        'إعادة',
        'راية النقابات'
    ],
    '🇷🇴': [
        'علم رومانيا',
        'روي',
        'العلم الروماني'
    ],
    '🇷🇸': [
        'علم صربيا',
        'RS',
        'العلم الصربي'
    ],
    '🇷🇺': [
        'علم روسيا',
        'RU',
        'العلم الروسي'
    ],
    '🇷🇼': [
        'Flag of Rwanda',
        'RW',
        'Rwandan Flag'
    ],
    '🇸🇦': [
        'علم المملكة العربية السعودية',
        'SA',
        'العلم السعودي'
    ],
    '🇸🇧': [
        'علم جزر سليمان',
        'SB',
        'علم جزر سليمان'
    ],
    '🇸🇨': [
        'علم سيشيل',
        'سميث',
        'Seychellois Flag'
    ],
    '🇸🇩': [
        'علم السودان',
        'الذاكرة',
        'Sudanese Flag'
    ],
    '🇸🇪': [
        'علم السويد',
        'SE',
        'العلم السويدي'
    ],
    '🇸🇬': [
        'علم سنغافورة',
        'SG',
        'العلم السنغافوري'
    ],
    '🇸🇭': [
        'علم سانت هيلانة',
        'SH'
    ],
    '🇸🇮': [
        'علم سلوفينيا',
        'SI',
        'العلم السلوفيني'
    ],
    '🇸🇯': [
        'علم سفالبارد و يان ماين',
        'SJ'
    ],
    '🇸🇰': [
        'علم سلوفاكيا',
        'SK',
        'العلم السلوفاكي',
        'Slovakian Flag'
    ],
    '🇸🇱': [
        'علم سيراليون',
        'SL',
        'Sierra Leonean Flag'
    ],
    '🇸🇲': [
        'علم سان مارينو',
        'SM',
        'علم ساماريني'
    ],
    '🇸🇳': [
        'علم السنغال',
        'SN',
        'العلم الثغالي'
    ],
    '🇸🇴': [
        'علم الصومال',
        'ثواني',
        'Somalian Flag'
    ],
    '🇸🇷': [
        'علم سورينام',
        'ارسال',
        'علم سورينام'
    ],
    '🇸🇸': [
        'علم جنوب السودان',
        'SS',
        'علم جنوب السودان'
    ],
    '🇸🇹': [
        'علم ساو تومي و بريه',
        'الذاكرة'
    ],
    '🇸🇻': [
        'علم السلفادور',
        'SV',
        'العلم السلفادوري'
    ],
    '🇸🇽': [
        'علم سانت مارتن',
        'SX'
    ],
    '🇸🇾': [
        'علم سوريا',
        'SY',
        'العلم السوري'
    ],
    '🇸🇿': [
        'علم سوازيلند',
        'SZ',
        'علم السباحة'
    ],
    '🇹🇦': [
        'Flag of Tristan Da Cunha',
        'تاي'
    ],
    '🇹🇨': [
        'علم جزر تركس وكايكوس',
        'تي'
    ],
    '🇹🇩': [
        'علم تشاد',
        'TD',
        'العلم التشادي'
    ],
    '🇹🇫': [
        'علم الأقاليم الجنوبية الفرنسية',
        'ثامناً',
        'العلم الفرنسي للأراضي الجنوبية'
    ],
    '🇹🇬': [
        'علم توغو',
        'TG',
        'Togolese Flag'
    ],
    '🇹🇭': [
        'علم تايلند',
        'تي',
        'العلم التايلندي'
    ],
    '🇹🇯': [
        'علم طاجيكستان',
        'TJ',
        'العلم الطاجيكي'
    ],
    '🇹🇰': [
        'علم توكيلاو',
        'TK',
        'علم توكيلاو'
    ],
    '🇹🇱': [
        'علم تيمور - ليشتي',
        'TL',
        'علم تيمور - ليشتي',
        'علم تيمور الشرقية'
    ],
    '🇹🇲': [
        'علم تركمانستان',
        'ذاكرة',
        'Turkmen Flag'
    ],
    '🇹🇳': [
        'العلم التونسي',
        'TN',
        'العلم التونسي'
    ],
    '🇹🇴': [
        'علم تونغا',
        'إلى',
        'Tongan Flag'
    ],
    '🇹🇷': [
        'علم تركيا',
        'TR',
        'العلم التركي'
    ],
    '🇹🇹': [
        'علم ترينيداد وتوباغو',
        'تي'
    ],
    '🇹🇻': [
        'علم توفالو',
        'التلفاز',
        'علم توفالو'
    ],
    '🇹🇼': [
        'علم تايوان',
        'TW',
        'العلم التايواني'
    ],
    '🇹🇿': [
        'علم تنزانيا',
        'TZ',
        'Tanzanian Flag'
    ],
    '🇺🇦': [
        'علم أوكرانيا',
        'UA',
        'العلم الأوكراني'
    ],
    '🇺🇬': [
        'علم أوغندا',
        'UG',
        'العلم الأوغندي'
    ],
    '🇺🇲': [
        'العلامة: الولايات المتحدة الجزر البعيدة',
        'UM'
    ],
    '🇺🇸': [
        'علم الولايات المتحدة',
        'الولايات المتحدة',
        'العلم الأمريكي',
        'علم الولايات المتحدة'
    ],
    '🇺🇾': [
        'Flag of Uruguay',
        'UY',
        'Uruguayan Flag'
    ],
    '🇺🇿': [
        'Flag of Uzbekistan',
        'UZ',
        'Uzbekistani Flag',
        'Uzbek Flag'
    ],
    '🇻🇦': [
        'علم الكرسي الرسولي',
        'VA',
        'علم الفانتيكين'
    ],
    '🇻🇨': [
        'علم سانت فنسنت وجزر غرينادين',
        'VC'
    ],
    '🇻🇪': [
        'علم فنزويلا',
        'VE',
        'العلم الفنزويلي'
    ],
    '🇻🇬': [
        'علم جزر فرجن البريطانية',
        'VG',
        'علم سكان جزر فرجن البريطانية'
    ],
    '🇻🇮': [
        'علم جزر فرجن التابعة للولايات المتحدة',
        'سادسا',
        'علم جزر فرجن الأمريكية'
    ],
    '🇻🇳': [
        'علم فيتنام',
        'VN',
        'العلم الفيتنامي'
    ],
    '🇻🇺': [
        'Flag of Vanuatu',
        'VU',
        'Ni-Vanuatu Flag'
    ],
    '🇼🇫': [
        'علم الويس و فوتونا',
        'WF'
    ],
    '🇼🇸': [
        'علم ساموا',
        'الويس',
        'Samoan Flag'
    ],
    '🇽🇰': [
        'علم كوسوفو',
        'XK',
        'Kosovar Flag'
    ],
    '🇾🇪': [
        'علم اليمن',
        'YE',
        'العلم اليمني'
    ],
    '🇾🇹': [
        'علم مايوت',
        'YT',
        'علم مايوت'
    ],
    '🇿🇦': [
        'علم جنوب أفريقيا',
        'زاي',
        'علم جنوب أفريقيا'
    ],
    '🇿🇲': [
        'علم زامبيا',
        'زميك',
        'Zambian Flag'
    ],
    '🇿🇼': [
        'علم زمبابوي',
        'زيو',
        'علم زمبابوي',
        'علم زيم'
    ]
};
/*sports*/
emojis_language[lang][8] = {
    '🧗{{skin_tone}}‍♂️': [
        'Man Climbing',
        'Male Rock Climber',
        'Man Climber'
    ],
    '🧗{{skin_tone}}‍♀️': [
        'Woman Climbing',
        'Female Rock Climber',
        'Woman Climber'
    ],
    '🧗{{skin_tone}}': [
        'Person Climbing',
        'Person Rock Climber',
        'Person Climber'
    ],
    '🏇{{skin_tone}}': [
        'Horse Racing',
        'Horse Race',
        'Jockey'
    ],
    '⛷{{skin_tone}}‍️': ['تزلج'],
    '🏂{{skin_tone}}‍': ['Snowboarder'],
    '🏌️{{skin_tone}}‍♂️': ['Man Golfer'],
    '🏌️{{skin_tone}}‍♀️': ['جولف المرأة'],
    '🏌️{{skin_tone}}': ['Person Golfer'],
    '🏄{{skin_tone}}‍♂️': ['رجل سورفر'],
    '🏄{{skin_tone}}‍♀️': ['أنثى الرافرين'],
    '🏄{{skin_tone}}': ['Person Surfer'],
    '🚣{{skin_tone}}‍♂️': ['Man Rowing Boat'],
    '🚣{{skin_tone}}‍♀️': ['Woman Rowing Boat'],
    '🚣{{skin_tone}}': ['Person Rowing Boat'],
    '🏊{{skin_tone}}‍♂️': [
        'Man Swimming',
        'Man Swimmer'
    ],
    '🏊{{skin_tone}}‍♀️': [
        'Woman Swimming',
        'Woman Swimmer'
    ],
    '🏊{{skin_tone}}': [
        'Woman Swimming',
        'Person Swimmer'
    ],
    '⛹{{skin_tone}}‍️‍♂️': [
        'كرة الرجل الارتداد',
        'لاعب كرة سلة الرجل'
    ],
    '⛹️{{skin_tone}}‍♀️': [
        'كرة الارتداد للمرأة',
        'لاعب كرة السلة النسائية'
    ],
    '⛹️{{skin_tone}}': [
        'Person Bouncing Ball',
        'Person Basketball Player'
    ],
    '🏋️{{skin_tone}}‍♂️': [
        'وزن الرجل الرافع',
        'رافع وزن الرجل'
    ],
    '🏋️{{skin_tone}}‍♀️': [
        'وزن رفع مستوى المرأة',
        'وزن المرأة'
    ],
    '🏋️{{skin_tone}}': [
        'Person Lifting Weights',
        'Person Weightlifter'
    ],
    '🚴{{skin_tone}}‍♂️': [
        'دراجة الرجل',
        'رجل سيكلي',
        'ساكنة الذكور'
    ],
    '🚴{{skin_tone}}‍♀️': [
        'دراجات النساء',
        'أنثى ساكنة',
        'سيارة أنثى'
    ],
    '🚴{{skin_tone}}': [
        'Person Biking',
        'Person Cyclist',
        'Person Cyclist'
    ],
    '🚵{{skin_tone}}‍♂️': [
        'دراجة جبال مان',
        'دراج جبل الرجل'
    ],
    '🚵{{skin_tone}}‍♀️': [
        'دراجة جبال المرأة',
        'دراج الجبال الأنثوي'
    ],
    '🚵{{skin_tone}}': [
        'Person Mountain Biking',
        'Person Mountain Biker'
    ],
    '🤸{{skin_tone}}‍♂️': [
        'عجلة كارتيلي الرجل',
        'رجل يدوي عجلة كارتينية'
    ],
    '🤸{{skin_tone}}‍♀️': [
        'كارتليلي المرأة',
        'المرأة تقوم بعجلة كارتينية'
    ],
    '🤸{{skin_tone}}': [
        'Person Cartwheeling',
        'Person Doing Cartwheel'
    ],
    '🤼‍♂️': [
        'Men Wrestling',
        'Wrestling',
        'Wrestlers'
    ],
    '🤼‍♀️': [
        'Women Wrestling',
        'Wrestling',
        'Wrestlers'
    ],
    '🤼': [
        'تصنيع الناس',
        'تصنيع',
        'المصارعين'
    ],
    '🤽{{skin_tone}}‍♂️': ['رجل يلعب بولو الماء'],
    '🤽{{skin_tone}}‍♀️': ['اللعب النسائي للماء'],
    '🤽{{skin_tone}}': ['Person Playing Water Polo'],
    '🤾{{skin_tone}}‍♂️': ['رجل لعب كرة اليد'],
    '🤾{{skin_tone}}‍♀️': ['لعب كرة اليد النسائية'],
    '🤾{{skin_tone}}': ['Person Playing Handball'],
    '🤹{{skin_tone}}‍♂️': [
        'رجل جاينغ',
        'رجل جولر'
    ],
    '🤹{{skin_tone}}‍♀️': [
        'جينغ المرأة',
        'مؤجرة أنثوية'
    ],
    '🤹{{skin_tone}}': [
        'Person Juggling',
        'Person Juggler'
    ],
    '🧘{{skin_tone}}‍♂️': [
        'رجل في موقع لوتس',
        'التأمل',
        'Zen',
        'تقاطع الأرجل',
        'يوغا'
    ],
    '🧘{{skin_tone}}‍♀️': [
        'المرأة في موقع لوتس',
        'التأمل',
        'Zen',
        'تقاطع الأرجل',
        'يوغا'
    ],
    '🧘{{skin_tone}}': [
        'Person in Lotus Position',
        'Meditation',
        'Zen',
        'Cross legged',
        'Yoga'
    ],
    '🏃{{skin_tone}}‍♂️': ['تشغيل الرجل'],
    '🏃{{skin_tone}}‍♀️': ['تشغيل المرأة'],
    '🏃{{skin_tone}}': ['Person Running'],
    '🕺{{skin_tone}}': ['Man Dancing'],
    '💃{{skin_tone}}': ['Woman Dancing'],
    '🤺': [
        'سياج شخصي',
        'الفانق'
    ],
    '🏆': [
        'كأس',
        'بطولة',
        'الفائز'
    ],
    '🏅': ['الميدالية الرياضية'],
    '🥇': [
        'ميدالية المركز الأول',
        'ميدالية المركز الأول',
        'ميدالية ذهبية'
    ],
    '🥈': [
        'ميدالية المركز الثاني',
        'ميدالية المركز الثاني',
        'ميدالية فضية'
    ],
    '🥉': [
        'ميدالية المركز الثالث',
        'ميدالية المركز الثالث',
        'الميدالية البرونزية'
    ],
    '⚽': [
        'كرة القدم',
        'كرة القدم'
    ],
    '⚾': [
        'البيسبول',
        'كرة برمجية',
        'أبيض'
    ],
    '🥎': [
        'كرة برمجية',
        'أصفر'
    ],
    '🏀': [
        'كرة السلة',
        'برتقالي',
        'كرة السلة و هوب'
    ],
    '🏐': ['الكرة الطائرة'],
    '🏈': [
        'كرة القدم الأمريكية',
        'كرة القدم',
        'Gridiron',
        'سوبربوول'
    ],
    '🏉': [
        'كرة القدم الرغبي',
        'كرة القدم',
        'البطولة',
        'الرغبي',
        'الاتحاد'
    ],
    '🎾': [
        'تنس',
        'الكرة',
        'تجميل',
        'راكيت'
    ],
    '🥏': [
        'قرص متحرك',
        'فريسيبي'
    ],
    '🎳': [
        'البولينج',
        'دبابيس',
        'سكاكين',
        'عشرة Pin Bowling'
    ],
    '🏏': [
        'الكريكيت',
        'الخفاش',
        'الكرة'
    ],
    '🏑': [
        'هوكي حقل',
        'الكرة',
        'عصا'
    ],
    '🏒': [
        'هوكي الجليد',
        'الكرة',
        'عصا'
    ],
    '🥍': [
        'كسر',
        'الكرة',
        'عصا'
    ],
    '🏓': [
        'بينغ بونغ',
        'تنس الطاولة',
        'الكرة',
        'Paddle'
    ],
    '🏸': [
        'Badminton',
        'مكوك',
        'راكيت'
    ],
    '🥊': ['قفاص الملاكمة'],
    '🥋': [
        'الفنون العسكرية الموحدة',
        'جودو',
        'كارتا',
        'كينغ فو'
    ],
    '⛳': [
        'العلم في الفول',
        'علم الغولف'
    ],
    '⛸️': [
        'تزلج الجليد',
        'التزلج'
    ],
    '🎣': [
        'صيد',
        'القطب',
        'سمكة',
        'صيد السمك'
    ],
    '🎽': [
        'قميص قيد التشغيل',
        'واحد',
        'النحاس'
    ],
    '🎿': [
        'سماء',
        'التزلج',
        'حذاء'
    ],
    '🛷': ['مبتذلة'],
    '🥌': ['حجر الانحناء'],
    '🎯': [
        'ضربة مباشرة',
        'رماة',
        'Bullseye',
        'درع'
    ],
    '🎱': [
        'الكرة 8',
        'كرة مزروعة',
        'مجند',
        'المليارات'
    ],
    '🎮': [
        'وحدة تحكم لعبة الفيديو',
        'مشغل',
        'Xbox',
        'لوحة اللعبة',
        'Wii U'
    ],
    '♟️': ['بئر الشطرنج الأسود'],
    '🏹': [
        'قوس وسهم',
        'القوس'
    ],
    '🥅': ['صافي الهدف'],
    '🀄': [
        'تنين ماهجونغ الأحمر',
        'ماهجونغ',
        'Mahjong Tile',
        '中',
        'تنين ماهجونغ الاحمر'
    ],
    '🎴': [
        'بطاقات لعب الزهور',
        'مجموعة البطاقات',
        'Hanafuda',
        'Hwatu',
        'بطاقات التشغيل'
    ]
};
/*travel and places*/
emojis_language[lang][9] = {
    '🚂': [
        'قطار ستيم',
        'قطار ستيم',
        'قطار السكك الحديدية'
    ],
    '🚃': [
        'سيارة السكك الحديدية',
        'السكك الحديدية',
        'سيارة السكك الحديدية',
        'النقل بالسكك الحديدية',
        'عربة السكك الحديدية'
    ],
    '🚄': ['قطار سريع'],
    '🚅': [
        'قطار رصاص',
        'Shinkansen',
        'قطار عالي السرعة بالأنف'
    ],
    '🚆': ['القطار'],
    '🚇': [
        'تحت الارض',
        'أنبوب',
        'مترو',
        'قطار'
    ],
    '🚈': [
        'السكك الحديدية الخفيفة',
        'القطار'
    ],
    '🚊': ['صدمة'],
    '🚝': [
        'المفرد',
        'القطار'
    ],
    '🚞': [
        'سكك حديد الجبال',
        'Funicular',
        'القطار والجبال'
    ],
    '🚋': ['سيارة هوائية'],
    '🚌': [
        'الحافلة',
        'مدرب'
    ],
    '🚍': [
        'الحافلة القادمة',
        'واجهة الحافلة'
    ],
    '🚎': [
        'البوابات الدرقية',
        'الحافلة الكهربائية'
    ],
    '🚐': [
        'Minibus',
        'مينيفان',
        'الناس-ناقوس'
    ],
    '🚑': ['سيارة إسعاف'],
    '🚒': [
        'محرك النار',
        'إدارة الإطفاء',
        'شاحنة نارية'
    ],
    '🚓': [
        'سيارة الشرطة',
        'سيارة الشرطة',
        'سيارة الشرطة الجانبية'
    ],
    '🚔': [
        'سيارة الشرطة القادمة',
        'قيادة سيارة الشرطة',
        'سيارة الشرطة'
    ],
    '🚕': [
        'سيارة',
        'نيويورك سيارات الأجرة',
        'جانب سيارة الأجرة'
    ],
    '🚖': [
        'سيارة',
        'سيارة أجرة قادمة',
        'واجهة التاكسي'
    ],
    '🚗': [
        'السيارة',
        'سيارة حمراء',
        'جانب السيارة'
    ],
    '🚘': [
        'السيارات القادمة',
        'سيارة حمراء',
        'مقدمة السيارة'
    ],
    '🚚': [
        'شاحنة التوصيل',
        'غضب'
    ],
    '🚛': [
        'لوري مصمم',
        'شاحنة خضراء'
    ],
    '🚜': [
        'الجرافة',
        'المزرعة'
    ],
    '🛻': ['شاحنة التقاط'],
    '🏎️': [
        'سيارة سباق',
        'ف1',
        'الصيغة الأولى',
        'سيارة سباق'
    ],
    '🏍️': [
        'دراجة نارية',
        'دراجة نارية'
    ],
    '🛵': [
        'موتور سكوتر',
        'Vespa',
        'دراجة المحرك',
        'دراجة المحرك'
    ],
    '🛺': [
        'ريكشو تلقائي',
        'Tuk Tuk'
    ],
    '🚲': [
        'دراجة',
        'دراجة'
    ],
    '🛴': ['طرد سكوتر'],
    '⛵': [
        'زورق بحري',
        'دينغهاي',
        'اليخوت'
    ],
    '🚤': [
        'زورق السرعة',
        'زورق السيارات',
        'Powerboat'
    ],
    '🛳️': ['سفينة المسافر'],
    '⛴️': ['عبّارة'],
    '🛥️': ['زورق السيارات'],
    '🚢': ['سفينة رحلات'],
    '✈️': [
        'طائرة',
        'Aeroplane'
    ],
    '🛩️': [
        'طائرة صغيرة',
        'طيران صغير'
    ],
    '🚁': ['مروحية'],
    '🚟': ['سكك حديد معلقة'],
    '🚠': ['كابلواي جبل'],
    '🚡': [
        'الممر الهوائي',
        'سيارة كابل',
        'Gondola',
        'روبي'
    ],
    '🛰️': ['الأقمار الصناعية'],
    '🚀': [
        'صاروخ',
        'مكوك الفضاء'
    ],
    '🛸': [
        'السوكر الطائر',
        'الفتحة'
    ],
    '🚉': [
        'محطة القطار',
        'منصة التدريب'
    ],
    '🚏': ['إيقاف الحافلة'],
    '🛣️': [
        'طريق السيارات',
        'الطريق',
        'الطريق السريع',
        'الولايات'
    ],
    '🛤️': ['مسار السكك الحديدية'],
    '🛫': [
        'مغادرة الطائرة',
        'إيقاف التشغيل'
    ],
    '🛬': [
        'وصول الطائرة',
        'وصول الطائرة',
        'الهبوط'
    ],
    '🗾': ['خريطة اليابان'],
    '⛰️': ['الجبال'],
    '🏔️': ['جبل كابوت الثلج'],
    '🌋': ['بركاني'],
    '🗻': [
        'جبل فوجي',
        'فوجي سان'
    ],
    '🏕️': [
        'معسكر',
        'المخيم'
    ],
    '🏖️': ['شاطئ مع مظلة'],
    '🏜️': ['Desert'],
    '🏝️': ['جزيرة الصحراء'],
    '🏞️': ['المتنزه الوطني'],
    '🏟️': [
        'ملعب',
        'منصة',
        'ملعب الرياضة'
    ],
    '🏛️': [
        'بناء كلاسيكي',
        'اليونانية',
        'روما'
    ],
    '🏗️': [
        'بناء المباني',
        'رافعة'
    ],
    '🏘️': [
        'المباني السكنية',
        'مجموعة البيوت'
    ],
    '🏚️': [
        'مبنى البيت المهجور',
        'المنزل المهجور',
        'البيت القديم',
        'بيت الصيد'
    ],
    '🏠': [
        'الرئيسية',
        'مبنى المنزل'
    ],
    '🏡': [
        'منزل مع الحديقة',
        'البيت والشجرة'
    ],
    '🏢': [
        'مبنى المكاتب',
        'بناء المدينة',
        'بناء عالي الارتفاع'
    ],
    '🏣': [
        'مكتب البريد الياباني',
        'علامة بريدية يابانية'
    ],
    '🏤': [
        'مكتب البريد',
        'مكتب البريد الأوروبي'
    ],
    '🏥': [
        'المستشفى',
        'ER',
        'A&E',
        'غرفة الطوارئ',
        'الحوادث والطوارئ',
        'الصليب الأحمر',
        'طبي'
    ],
    '🏦': [
        'البنك',
        'BK',
        'Bakkureru',
        'فرع البنك',
        'Bakkureru'
    ],
    '🏨': [
        'فندق',
        'السكن',
        'مبنى H'
    ],
    '🏩': [
        'فندق الحب',
        'فندق القلب الحب'
    ],
    '🏪': [
        'متجر الراحة',
        'متجر 24 ساعة',
        '7-11',
        'متجر الزاوية',
        'Kwik-E-Mart'
    ],
    '🏫': [
        'المدرسة',
        'برج الساعة',
        'المستوى الأعلى الأولي'
    ],
    '🏬': [
        'متجر القسم',
        'مركز التسوق',
        'متجر'
    ],
    '🏭': [
        'مصنع',
        'صناعي',
        'الصناعة',
        'التلوث',
        'دخان'
    ],
    '🏯': [
        'القلعة اليابانية',
        'حصن'
    ],
    '🏰': [
        'القلعة الأوروبية',
        'Turrets'
    ],
    '💒': [
        'قلب الكنيسة',
        'زفاف الكنيسة',
        'الزواج'
    ],
    '🗼': [
        'برج طوكيو',
        'برج ايفل',
        'برج أحمر'
    ],
    '🗽': [
        'تمثال الحرية',
        'نيويورك'
    ],
    '⛪': [
        'مبنى الكنيسة',
        'تقاطع'
    ],
    '🕌': [
        'مسجد',
        'سقف مسكن',
        'Minaret'
    ],
    '🛕': ['معبد الهندوس'],
    '🕍': [
        'كنيس',
        'يهودي',
        'Synagog',
        'معبد'
    ],
    '⛩️': [
        'ضريح شينتو',
        'كامي-نو ميتشي'
    ],
    '🕋': [
        'Kaaba',
        'Mecca'
    ],
    '🏙️': ['Cityscape'],
    '⛱️': [
        'مظلة على الأرض',
        'مظلة الشاطئ'
    ],
    '🌄': [
        'الشروق فوق الجبال',
        'صباحا',
        'الشروق'
    ],
    '🌅': [
        'الشروق',
        'غروب'
    ],
    '🌆': [
        'Cityscape في دوسك',
        'مدينة السماء البرتقالية',
        'مدينة دوسك'
    ],
    '🌇': [
        'غروب الغد فوق المباني',
        'غداء المدينة'
    ],
    '🌃': [
        'ليلة مع النجوم',
        'المدينة في الليل',
        'ليلة النجوم'
    ],
    '🗿': [
        'Moai',
        'تمثال جزيرة عيد الفصح',
        'مناجرة الروك البشري',
        'تمثال مولاي'
    ],
    '🌠': [
        'نجم إطلاق النار',
        'عندما تتمنى على النجمة',
        'نيزويد'
    ],
    '🌌': [
        'طريق التبانة',
        'مجرة',
        'سماء الليل',
        'المساحة',
        'النجوم',
        'الكون'
    ],
    '🎑': [
        'حفل عرض القمر',
        'العشب والأوردة والقمر',
        'حصاد القمر',
        'مهرجان منتصف الخريف',
        'Tsukimi'
    ],
    '🛖': ['كوخ'],
    '🎢': [
        'خام رديء',
        'روليركاستر',
        'منتزه الثيم'
    ],
    '🛝': [
        'Playground Slide',
        'طفل',
        'Children'
    ]
};
/*technologies (smartphones, laptops, etc.) and office*/
emojis_language[lang][10] = {
    '⌚': [
        'مشاهدة',
        'توقيت',
        'ساعة التفاح'
    ],
    '⏰': ['ساعة المنبه'],
    '⏱️': ['ساعة توقف'],
    '⏲️': ['ساعة المؤقت'],
    '🕰️': ['ساعة مانتلبوت'],
    '🧭': ['البوصلة'],
    '🕹️': ['عصا التحكم'],
    '🎙️': ['مايكروفون ستوديو'],
    '🎚️': ['شريط تمرير المستوى'],
    '🎛️': ['التحكم في العقدة'],
    '📻': [
        'الراديو',
        'راديو رقمي',
        'لاسلكي'
    ],
    '📱': [
        'الهاتف المحمول',
        'الهاتف الذكي',
        'أيفون',
        'الهاتف الخلوي'
    ],
    '📲': [
        'الهاتف المحمول مع السهم الأيمن على اليسار',
        'مكالمة هاتفية',
        'الإشارة إلى الهاتف'
    ],
    '☎️': [
        'الهاتف الأسود',
        'هاتف الروتاري',
        'أحمر'
    ],
    '📞': [
        'مستقبل الهاتف',
        'Handset',
        'الهاتف',
        'أسود'
    ],
    '📟': [
        'صمغ',
        'بيب',
        'النوم'
    ],
    '📠': [
        'ماكينة الفاكس',
        'Facsimile',
        'فاكس'
    ],
    '🔋': [
        'البطارية',
        'بطارية AA',
        'بطارية الهاتف'
    ],
    '🔌': [
        'توصيل كهربائي',
        'AC Adaptor',
        'كابل الطاقة',
        'توصيل الطاقة'
    ],
    '💻': [
        'كمبيوتر',
        'الحواشي',
        'كمبيوتر شخصي',
        'الحواسيب',
        'ماك بوك',
        'السطح'
    ],
    '🖥️': [
        'كمبيوتر سطح المكتب',
        'آي ماك',
        'الحواسيب'
    ],
    '🖨️': ['طابعة'],
    '⌨️': ['Keyboard'],
    '🖱️': [
        'فأرة الكمبيوتر',
        'فأرة ثلاثة أزرار'
    ],
    '🖲️': ['كرة المسار'],
    '💽': [
        'قرص الكمبيوتر',
        'Minidisc',
        'قرص',
        'DVD',
        'أشعة بلو',
        'BD'
    ],
    '💾': [
        'قرص مرتفع',
        '3.5<unk> - قرص',
        'قرص'
    ],
    '💿': [
        'قرص بصري',
        'قرص',
        'قرص مدمج',
        'قرص مدمج'
    ],
    '📀': [
        'DVD',
        'قرص DVD-ROM',
        'فيديو DVD'
    ],
    '🎥': [
        'كاميرا الفيلم',
        'كاميرا الأفلام',
        'هوليوود',
        'فيلم'
    ],
    '🎞️': ['إطارات الأفلام'],
    '📽️': ['عرض الأفلام'],
    '📺': [
        'التلفزيون',
        'التلفاز'
    ],
    '📷': ['الكاميرا الرقمية'],
    '📸': ['الكاميرا بالفلاش'],
    '📹': [
        'كاميرا الفيديو',
        'كاميرا'
    ],
    '📼': [
        'فيديوكسيت',
        'فيس',
        'VCR',
        'شريط الفيديو',
        'فيديوكسيت'
    ],
    '💳': [
        'بطاقة الائتمان',
        'بطاقة الخصم',
        'أميكس',
        'Diners Club',
        'أمريكان إكسبريس',
        'إتقان',
        'بطاقة فيزا'
    ],
    '📧': [
        'البريد الإلكتروني',
        'الايميل'
    ],
    '📨': [
        'الظرف الوارد',
        'ظرف مع الخطوط',
        'ظرف سريع'
    ],
    '📩': [
        'ظرف مع السهم لأسفل فوق',
        'ظرف السهم لأسفل',
        'إدراج في الظرف'
    ],
    '📤': ['قالب خارجي'],
    '📥': ['صندوق الوارد'],
    '📮': ['علبة'],
    '📁': [
        'مجلد الملف',
        'مجلد',
        'دليل',
        'مجلد الملف المغلق'
    ],
    '📂': [
        'فتح مجلد الملف',
        'دليل'
    ],
    '🗂️': ['فهرس البطاقة'],
    '📅': [
        'التقويم',
        '17 تموز/يوليه',
        'يوم الرموز التعبيرية العالمي'
    ],
    '🗓️': ['رزنامة التقويم الدائري'],
    '📆': [
        'التقويم المعطّل',
        'تقويم يوم',
        'تقويم المكتب'
    ],
    '📈': [
        'زيادة الرسم البياني',
        'مخطط إيجابي',
        'الرسم البياني للأعلى',
        'رسم بياني مع الاتجاه الأعلى'
    ],
    '📉': [
        'انخفاض الرسم البياني',
        'مخطط سلبي',
        'رسم بياني لأسفل',
        'الرسم البياني مع الاتجاه التنازلي'
    ],
    '📊': [
        'البار الرسم البياني',
        'شريط الرسم البياني'
    ],
    '📌': [
        'بوشن',
        'Thumb Tack'
    ],
    '📋': ['الحافظة'],
    '📍': [
        'دفعة مستديرة',
        'تثبيت مسقط',
        'تثبيت الخريطة',
        'تثبيت',
        'تثبيت أحمر'
    ],
    '📎': [
        'ورقة',
        'كسح'
    ],
    '📏': ['حاكم مستقيم'],
    '📐': [
        'حاكم ثلاثي',
        'مثلث حاكم'
    ],
    '✂️': [
        'مقص',
        'القطع'
    ],
    '✏️': [
        'قلم رصاص',
        'رصاص القائد'
    ],
    '✒️': [
        'النب الأسود',
        'بن نب',
        'نافورة بن'
    ],
    '🖋️': [
        'نافورة بن',
        'نافورة أسفل اليسار القلم'
    ],
    '🖊️': [
        'القلم',
        'القلم السفلي للنقطة اليسرى',
        'قلم نقطة الزاوية'
    ],
    '🖌️': [
        'فرشاة الألم',
        'فرشاة',
        'أسفل البانتفرش اليسرى'
    ],
    '🖍️': [
        'Crayon',
        'الكريون اليساري السفلي'
    ],
    '📝': [
        'مذكرة',
        'Memorandum',
        'ملاحظة',
        'قلم الرصاص والورقة'
    ],
    '🗑️': [
        'سلة ورق النفايات',
        'القمامة يمكن',
        'سلة الروبيش',
        'القمامة يمكن'
    ],
    '📡': ['هوائي ساتلي'],
    '🔭': [
        'التلسكوب',
        'التعتيم'
    ],
    '🔬': [
        'مجهر',
        'Magnify',
        'العلوم'
    ],
    '📭': ['فتح صندوق البريد مع العلم المخفض'],
    '📬': [
        'فتح صندوق البريد مع العلم المرتفع',
        'فتح صندوق البريد'
    ],
    '📪': ['صندوق البريد المغلق مع العلم المرتفع'],
    '📫': ['صندوق البريد المغلق مع العلم المرتفع'],
    '📰': ['جريدة'],
    '🗞️': [
        'الصحف المتقطعة',
        'إيصال الصحف'
    ],
    '📄': [
        'صفحة مواجهة للأعلى',
        'صفحة مطبوعة'
    ],
    '📜': [
        'تمرير',
        'شهادة',
        'Parchment'
    ],
    '📃': [
        'صفحة مع Curl',
        'Curled Page',
        'Curly Page'
    ],
    '📓': [
        'الحواشي',
        'الكتاب الأسود والأبيض'
    ],
    '📔': ['دفتر الملاحظات مع الغلاف الزخرفي'],
    '📕': [
        'كتاب مغلق',
        'كتاب أحمر',
        'كتاب نصي أحمر'
    ],
    '📖': [
        'فتح كتاب',
        'كتاب',
        'رواية'
    ],
    '📗': [
        'كتاب أخضر',
        'كتاب نصي أخضر'
    ],
    '📘': [
        'الكتاب الأزرق',
        'كتاب نصي أزرق'
    ],
    '📙': [
        'كتاب برتقالي',
        'الكتاب المدرسي البرتقالي'
    ],
    '📚': [
        'الكتب',
        'ملف الكتب',
        'تكدس الكتب'
    ],
    '🗳️': [
        'صندوق الاقتراع مع الاقتراع',
        'صندوق التصويت',
        'التصويت'
    ],
    '🗄️': [
        'ملف مجلس الوزراء',
        'مجلس الوزراء'
    ],
    '🗃️': ['صندوق ملف البطاقة'],
    '🖇️': ['مقتطفات ورقية مرتبطة']
};
/*clothes and accessories*/
emojis_language[lang][11] = {
    '👣': [
        'بصمات',
        'قدم',
        'خطوات'
    ],
    '👓': [
        'نظارات',
        'نظارات'
    ],
    '🕶️': ['نظارات شمسية'],
    '🥽': ['جوجل'],
    '🥼': ['معطف المختبر'],
    '👔': [
        'Necktie',
        'قميص عمل',
        'قميص و تاي'
    ],
    '👕': [
        'قميص',
        'قميص الفريق',
        'قميص بولو'
    ],
    '👖': [
        'جينز',
        'دنيم',
        'بنطلون',
        'سروال'
    ],
    '🧣': ['Scarf'],
    '🧤': ['قفازات'],
    '🧥': ['معطف'],
    '🧦': ['Socks'],
    '👗': [
        'فستان',
        'تنبيه',
        'أسفل'
    ],
    '👘': [
        'Kimono',
        'ارتداء الملابس',
        'الفستان الياباني'
    ],
    '👙': [
        'بيكيني',
        'باثرز',
        'بدلة السباحة'
    ],
    '🩱': ['بدلة سباحة من قطعة واحدة'],
    '👚': [
        'ملابس النساء',
        'Blouse',
        'قميص وردي',
        'Blouse'
    ],
    '👛': [
        'حنق',
        'المحفظة'
    ],
    '👜': ['حقيبة اليد'],
    '👝': [
        'حقيبة التلاعب',
        'الهولندي',
        'حقيبة صغيرة',
        'Pouch'
    ],
    '🎒': [
        'حزمة الظهر',
        'حقيبة',
        'حقيبة مدرسة',
        'ساتل المدرسة',
        'Rucksack'
    ],
    '👞': [
        'Mans Shoe',
        'حذاء',
        'عرض بني',
        'عرض الفستان'
    ],
    '👟': [
        'حذاء رياضي',
        'تشغيل الحذاء',
        'Sneaker',
        'مشغل',
        'المدرّب',
        'حذاء تنس'
    ],
    '🥾': ['حذاء الفتحة'],
    '🥿': ['حذاء مسطح'],
    '👠': [
        'حذاء عالي الكثافة',
        'ستيتو',
        'عالية الكعب'
    ],
    '👡': [
        'النساء الصندل',
        'صنادل منقوش',
        'Saldals'
    ],
    '👢': [
        'حذاء المرأة',
        'حذاء الفتاة',
        'أحذية الركبة العالية',
        'حذاء مصاب'
    ],
    '👑': [
        'التاج',
        'الملك',
        'الملكة',
        'الأمير',
        'ملكي',
        'الأميرة'
    ],
    '👒': [
        'قبعة',
        'قبعة النساء',
        'قبعة مع القوس',
        'قبعة سيداتي'
    ],
    '🎩': [
        'القبعة العليا',
        'ملابس رسمية',
        'Groom'
    ],
    '🎓': [
        'الحد الاقصى للتخرج',
        'الكلية',
        'الخريج',
        'لوحة الهاون',
        'الجامعة',
        'الحد الأكاديمي المربع'
    ],
    '🧢': [
        'الحد الاقصى للفواتير',
        'قبعة البيسبول'
    ],
    '⛑️': [
        'خوذة مع الصليب الأبيض',
        'خوذة عامل الإنقاذ'
    ],
    '💼': [
        'حفل',
        'حقيبة'
    ],
    '🎖️': [
        'الميدالية العسكرية',
        'ميدالية',
        'ميداليون',
        'الديكور العسكري'
    ],
    '📿': [
        'صلاة بيدز',
        'ديكر بيدز',
        'روزري بيدز'
    ],
    '🎗️': ['تذكير ريبو'],
    '🤿': ['قناع الغوص'],
    '🦺': ['سترة الأمان'],
    '🥻': [
        'ساري',
        'ساري',
        'شاري'
    ],
    '🩲': ['موجز'],
    '🩳': ['الاختصارات'],
    '🛼': [
        'تزلج متزلج',
        'تزلج مضمن',
        'الدربي المليء'
    ],
    '🩴': [
        'انقلب الفلاش',
        'ثونغ ساندال'
    ],
    '🪖': ['خوذة عسكرية'],
    '🩰': [
        'أحذية المحفظة',
        'حذاء نقطة'
    ],
    '🩼': ['Crutch']
};
/*hands and parts of body*/
emojis_language[lang][12] = {
    '👋{{skin_tone}}': [
        'تحميل علامة اليد',
        'وداعا',
        'موجة اليد',
        'مرحبا',
        'Hi'
    ],
    '🖐️{{skin_tone}}': [
        'اليد مع الأصابع التي لوحظت',
        'خمسة يهود',
        'اليد الملعوبة',
        'رفعت اليد بالأصابع التي لوحظت'
    ],
    '🤚{{skin_tone}}': [
        'رجوع اليدين',
        'الخلفية'
    ],
    '✋{{skin_tone}}': [
        'يرفع اليد',
        'عالي 5',
        'توقف'
    ],
    '🖖{{skin_tone}}': [
        'Vulcan Salute',
        'Spock',
        'شجرة النجوم',
        'رفعت اليد مع جزء بين أصابع الوسط والخاتم'
    ],
    '👌{{skin_tone}}': [
        'حسن توقيع اليد',
        'حسنًا',
        'ممتاز',
        'نعم'
    ],
    '✌️{{skin_tone}}': [
        'يدوي النصر',
        'أسعار الهواء',
        'لافتة السلام',
        'علامة V'
    ],
    '🤞{{skin_tone}}': [
        'أصابع متقاطعة',
        'أصابع متقاطعة',
        'حظاً سعيداً',
        'اليد مع الفهرس و الأصابع الوسطى'
    ],
    '🤟{{skin_tone}}': [
        'إيماءة الحب',
        'أنا أحبك توقيع اليد'
    ],
    '🤘{{skin_tone}}': [
        'علامة القرن',
        'أصابع الشرير',
        'معدن ثقيل',
        'تشغيل الروك'
    ],
    '🤙{{skin_tone}}': [
        'اتصل بي توقيع اليد',
        'اليد الهاتفية',
        'شاكا'
    ],
    '🤏{{skin_tone}}': ['تمزيق اليد'],
    '👈{{skin_tone}}': [
        'مؤشر الدليل الخلفي لليسار',
        'مؤشر النقاط اليسرى البيضاء'
    ],
    '👉{{skin_tone}}': [
        'مؤشر الدليل الخلفي يمين',
        'مؤشر نقطة اليمين البيضاء الخلفية'
    ],
    '👆{{skin_tone}}': [
        'مؤشر الخلفية إلى الأعلى',
        'الفهرس اليدوي الأبيض الذي يشير إلى الخلفية',
        'الاصبع الأوسط'
    ],
    '👇{{skin_tone}}': [
        'مؤشر الدليل الخلفي للأسفل',
        'مؤشر نقطة أسفل بيضاء',
        'الإشارة إلى الأسفل'
    ],
    '☝{{skin_tone}}': [
        'فهرس نقطة الاصبع للأعلى',
        'مؤشر النقاط الأبيض',
        'سرية'
    ],
    '🖕{{skin_tone}}': [
        'الاصبع الأوسط',
        'قلب الطائر',
        'اصبع مصنوع',
        'عكس اليد مع توسعة الاصبع الأوسط'
    ],
    '👍{{skin_tone}}': [
        'تسجيل الإتصال',
        'إعجاب',
        'نعم'
    ],
    '👎{{skin_tone}}': [
        'لافتة تبويب للأسفل',
        'سيء',
        'Dislike',
        'لا'
    ],
    '✊{{skin_tone}}': [
        'رفعت قبضة',
        'مضخة فضائية'
    ],
    '👊{{skin_tone}}': [
        'قبضة قادمة',
        'Bro Fist',
        'Brofist',
        'ضربة قاضية',
        'حبس',
        'قبضة مغلقة',
        'لوحة اليد المكوّنة'
    ],
    '🤛{{skin_tone}}': ['ضربة من اليسار'],
    '🤜{{skin_tone}}': ['ضربة من الوجهة اليمنى'],
    '🤌{{skin_tone}}': [
        'أصابع مبطنة',
        'Ma Che Vuoi',
        'تنقية الأصابع'
    ],
    '👏{{skin_tone}}': [
        'علامة تصفيق الأيدي',
        'إيقاف',
        'Clap',
        'التصفيق',
        'جلف الغولف',
        'جولة من التوقف'
    ],
    '🙌{{skin_tone}}': [
        'شخص يربي كلا اليد في الاحتفال',
        'تربية الأيدي',
        'الأسلحة في الجو',
        'Banzai',
        'معجزة المهرجان',
        'Hallelujah',
        'امتدح اليدين',
        'يدان'
    ],
    '👐{{skin_tone}}': [
        'فتح تسجيل اليد',
        'ضغطة',
        'يد الجاز'
    ],
    '🤲{{skin_tone}}': [
        'نخيل معا',
        'Dua'
    ],
    '🤝{{skin_tone}}': [
        'Handshake',
        'الأيدي المهزجة'
    ],
    '🙏{{skin_tone}}': [
        'الأيدي المطولة',
        'Namaste',
        'من فضلك',
        'الصلاة',
        'شكرا لك',
        'شخص ذو يدي مفضلة'
    ],
    '✍{{skin_tone}}': ['كتابة اليد'],
    '🫱{{skin_tone}}': ['Rightwards Hand'],
    '🫲{{skin_tone}}': ['Leftwards Hand'],
    '🫳{{skin_tone}}': ['Palm Down Hand'],
    '🫴{{skin_tone}}': ['Palm Up Hand'],
    '🫰{{skin_tone}}': ['Hand with Index Finger and Thumb Crossed'],
    '🫵{{skin_tone}}': ['Index Pointing at the Viewer'],
    '🫶{{skin_tone}}': [
        'Heart Hands',
        'Love'
    ],
    '💪{{skin_tone}}': [
        'مبيدات مربوطة',
        'عضلات الذراع الملتهبة',
        'Musle',
        'قوي'
    ],
    '🦵{{skin_tone}}': ['ساق'],
    '🦶{{skin_tone}}': ['القدم'],
    '👂{{skin_tone}}': [
        'إينو',
        'اليارز',
        'سماع',
        'الاستماع'
    ],
    '👃{{skin_tone}}': [
        'الأنف',
        'التهميم',
        'التشتت',
        'Stinky'
    ],
    '🦻{{skin_tone}}': ['مع معونة السمع'],
    '🧠': ['الدماغ'],
    '🦷': ['أسنان'],
    '👀': [
        'العيون',
        'كرات العين',
        'عيون متقطعة',
        'عيون حكيمة'
    ],
    '👁️': [
        'العين',
        'عين واحد'
    ],
    '👅': ['النغمة'],
    '👄': [
        'الفم',
        'كيس الشفاه',
        'الشفاه'
    ],
    '🫦': [
        'Biting Lip',
        'الشفاه'
    ],
    '🫀': ['القلب التشريحي'],
    '🫁': ['الرهانات'],
    '🦾': ['الذراع الميكانيكية'],
    '🦿': ['ساق ميكانيكي'],
    '💅{{skin_tone}}': [
        'البولندية المسالمة',
        'أصابع',
        'Manicure',
        'Nonchalant'
    ],
    '🤳{{skin_tone}}': [
        'سيلفي',
        'كاميرا الهاتف',
        'سيلفي يد'
    ]
};
/*other*/
emojis_language[lang][13] = {
    '💩': [
        'ملف من Poo',
        'قرون الكلب',
        'نقطة الابتسامة'
    ],
    '💋': [
        'علامة القلاب',
        'كيس الشفاه'
    ],
    '🦴': ['عظام'],
    '🧳': [
        'حقائب',
        'حقيبة'
    ],
    '🌂': [
        'مظلة مغلقة',
        'مظلة معطلة',
        'مظلة وردية'
    ],
    '☂️': ['مظلة'],
    '☔': [
        'مظلة مع قطرات المطر',
        'المطر',
        'Rainy'
    ],
    '🧵': ['مجموعة من المواضيع'],
    '🧶': ['كرة يارن'],
    '💄': [
        'Lipstick',
        'خسر الشفاه',
        'كياج'
    ],
    '💍': [
        'خاتم',
        'خاتم الماس',
        'خاتم المشاركة'
    ],
    '💎': [
        'حجر جوهري',
        'الماس',
        'جوهرة',
        'غيمستون',
        'جويل'
    ],
    '💥': [
        'رمز التصادم',
        'انفجار',
        'شفرة',
        'التأثير',
        'زحف أحمر',
        'انفجار'
    ],
    '💫': [
        'رمز ديتزي',
        'دائرة ونجمة'
    ],
    '💦': [
        'شفرة الرموز الحلاقة',
        'زحف',
        'تفريغ الماء',
        'قطرات المياه'
    ],
    '💨': [
        'التقطيع بعيدا',
        'سريع',
        'ستيم',
        'التلاعب',
        'الريح',
        'رمز داش',
        'زخم الرياح'
    ],
    '🌬️': [
        'وجه الريح',
        'الرياح المشتعلة',
        'الطبيعة الأم',
        'وجه الريح الدافئة'
    ],
    '🐾': [
        'الطباعة الباطنية',
        'طباعة وعاء القطط',
        'الطباعة الباطنية للكلب',
        'طباعة البقعة',
        'طباعة باك الدب'
    ],
    '🕸️': [
        'شبكة العنكبوت',
        'كوبويب',
        'ويب',
        'شبكة العنكبوت'
    ],
    '🦠': [
        'مايكروبي',
        'خلية',
        'فيروس كورونا',
        'COVID-19',
        'جرس',
        'الكائنات المجهرية',
        'فيروس'
    ],
    '💐': ['باقة الزهور'],
    '🌍': [
        'الظهور العالمي لأوروبا - أفريقيا',
        'الأرض',
        'غلوب',
        'كوكب',
        'العالم',
        'الظهور العالمي لأوروبا وأفريقيا'
    ],
    '🌎': [
        'الكرة الأرضية تظهر الأمريكيتين',
        'الأرض',
        'غلوب',
        'كوكب',
        'العالم'
    ],
    '🌏': [
        'غلوب عرض آسيوي - أستراليا',
        'الأرض',
        'غلوب',
        'كوكب',
        'العالم',
        'عرض عالمي لآسيا وأستراليا'
    ],
    '🌐': [
        'أرضية مع مريديان',
        'الإنترنت',
        'الشبكة العالمية',
        'WWW'
    ],
    '🌑': [
        'رمز القمر الجديد',
        'القمر المظلم',
        'قمر الظل',
        'كتلة شمسية'
    ],
    '🌒': ['رموز هلال الهلال الجاهز'],
    '🌓': ['رمز الربع الأول من القمر'],
    '🌔': ['رموز القمر المتحرك'],
    '🌕': ['رمز القمر الكامل'],
    '🌖': ['رمز قمري مرتجل'],
    '🌗': ['رمز الربع الأخير من القمر'],
    '🌘': ['رمز هلال الهلال المرغوب'],
    '🌙': ['قمر الهلال'],
    '🌚': [
        'قمر جديد مع وجه',
        'القمر المخيف',
        'وجه القمر المظلم',
        'مولستر مون'
    ],
    '🌝': [
        'القمر الكامل بالوجه',
        'Moonface',
        'القمر المبتسم',
        'القمر المبتسم'
    ],
    '🌛': ['الربع الأول من القمر بالوجه'],
    '🌜': ['الربع الأخير من القمر بالوجه'],
    '🌞': [
        'الشمس بالوجه',
        'الشمس المبتسمة',
        'Sunface',
        'الشمس المبتسمة'
    ],
    '☀️': [
        'الشمس',
        'الشمس'
    ],
    '⭐': [
        'نجوم',
        'النجم الأبيض المتوسط'
    ],
    '🌟': [
        'نجم متهرج',
        'نجمة مشرقة'
    ],
    '☁️': [
        'السحابة',
        'غيوم',
        'الإغلاق'
    ],
    '⛅': ['الشمس خلف السحابة'],
    '⛈️': [
        'السحابة مع البرق والمطر',
        'سحابة الرعد والأمطار'
    ],
    '🌤️': ['الشمس البيضاء مع سحابة صغيرة'],
    '🌥️': [
        'الشمس خلف السحابة الكبيرة',
        'الشمس البيضاء خلف السحابة'
    ],
    '🌦️': ['الشمس البيضاء خلف السحابة مع المطر'],
    '🌧️': ['السحابة مع المطر'],
    '🌨️': ['سحابة مع الثلج'],
    '🌩️': ['السحابة مع البرق'],
    '🌪️': [
        'تورنادو',
        'السحابة مع تورنادو'
    ],
    '🌫️': ['Fog'],
    '🌈': [
        'قوس قزح',
        'فخر المثليين',
        'قوس قزح أساسي',
        'LGBTQIA+',
        'LGBT+'
    ],
    '❄️': [
        'ندفة الثلج',
        'الثلج',
        'ثلج'
    ],
    '🌀': [
        'إعصار',
        'الإعصار',
        'حلزوني',
        'سورل',
        'تورنادو'
    ],
    '⚡': [
        'علامة فولطية عالية',
        'برج البرق',
        'ثيندربولت',
        'فولتية عالية'
    ],
    '☃️': [
        'رجل الثلج',
        'رجل الثلج برقائق الثلج'
    ],
    '⛄': [
        'رجل ثلج بدون ثلج',
        'رجل الثلج الفروستي',
        'Olaf',
        'رجل الثلج'
    ],
    '☄️': ['مذنب'],
    '🔥': [
        'النار',
        'شعلة',
        'ساخن',
        'Lit',
        'سنابستاك'
    ],
    '💧': [
        'Droplet',
        'الماء',
        'قطرة المياه'
    ],
    '✨': [
        'البانكلس',
        'براقة',
        'Shiny',
        'جديد'
    ],
    '🌊': [
        'موجة المياه',
        'شاطئ',
        'موجة المحيط',
        'البحر'
    ],
    '🎄': [
        'شجرة عيد الميلاد',
        'عيد الميلاد',
        'شجرة عيد الميلاد'
    ],
    '🎃': [
        'فانوس جاك-O-',
        'Halloween',
        'اليقطين'
    ],
    '🌻': [
        'زهرة الشمس',
        'زهرة أصفر'
    ],
    '🌼': [
        'Blossom',
        'زهرة مهزولة',
        'Daisy',
        'زهرة أصفر'
    ],
    '🌷': ['Tulip'],
    '🌹': [
        'وردة الزهور',
        'وردة حمراء'
    ],
    '☘️': [
        'شامروك',
        'البرسيم',
        'تريفويل'
    ],
    '🍀': [
        'برسيم أربعة أوراق',
        'البرسيم',
        'آيرلندا',
        'محظوظ',
        'ثروة'
    ],
    '🌸': [
        'Cherry Blossom',
        'زهرة وردية',
        'Sakura'
    ],
    '💮': [
        'زهرة بيضاء',
        'Cherry Blossom',
        'ورق بشكل دوري',
        'وسام حسنًا'
    ],
    '🌺': ['Hibiscus'],
    '🏵️': ['روزيت'],
    '🌱': [
        'البذور',
        'الربيع',
        'Sprout',
        'النبض'
    ],
    '🌲': [
        'شجرة Evergreen',
        'شجرة فاير',
        'شجرة اسطر'
    ],
    '🌳': [
        'شجرة خادعة',
        'شجرة مدورة'
    ],
    '🌴': [
        'شجرة النخيل',
        'شجرة جوز الهند'
    ],
    '🎋': [
        'شجرة تانباتا',
        'Tanabata',
        'نتمنى الشجرة'
    ],
    '🎍': [
        'زخرفة الأنسجة',
        'خيزران',
        'كادوماتسو',
        'زخرفة السنة الجديدة'
    ],
    '🌵': [
        'Cactus',
        'Desert'
    ],
    '🌾': [
        'شيف الأرز',
        'محاصيل',
        'المزرعة',
        'قمح',
        'نوع الأرز'
    ],
    '🌿': [
        'عشب',
        'محاصيل',
        'النبات'
    ],
    '🍁': [
        'أوراق المقطوعة',
        'كندا',
        'كندي',
        'عربة'
    ],
    '🍂': [
        'أوراق التسرب',
        'ورقة الخريف',
        'أوراق الخريف',
        'أوراق البناء',
        'أوراق الخريف',
        'اوراق سقوط'
    ],
    '🍃': [
        'ورق الملوثة في الرياح',
        'أوراق خضراء',
        'الربيع'
    ],
    '🪴': ['النباتات المحطة'],
    '🪸': [
        'Coral',
        'Climate change'
    ],
    '🪷': [
        'Lotus',
        'Purity',
        'Beauty',
        'Calmness',
        'Serenity'
    ],
    '🔑': [
        'المفتاح',
        'مفتاح الذهب'
    ],
    '🗝️': ['المفتاح القديم'],
    '🔨': [
        'مطرقة',
        'مطرقة الشرف',
        'Handyman',
        'أداة'
    ],
    '⛏️': [
        'اختر',
        'فأس'
    ],
    '🪓': ['فأس'],
    '🪚': ['صهر النجارة'],
    '🪛': ['مفكك الشاشة'],
    '🪝': ['ربط'],
    '🪠': ['Plunger'],
    '🪣': ['دلو'],
    '🔩': [
        'بوت و بولت',
        'بولت',
        'طاقم'
    ],
    '🗜️': [
        'مصباح',
        'الجدول نائب الرئيس',
        'WinZip',
        'ضغط'
    ],
    '🔒': [
        'مقفل',
        'قفل مغلق',
        'قفل'
    ],
    '🔓': [
        'فتح',
        'فتح Padlock',
        'فتح القفل'
    ],
    '🔏': [
        'مقفل مع القلم',
        'قفل وقلم',
        'قفل مع قلم النافذة',
        'قفل بواسطة قلم الحبر'
    ],
    '🔐': [
        'مقفل مع المفتاح',
        'إغلاق القفل باستخدام المفتاح'
    ],
    '🗡️': [
        'Dagger',
        'سلاح سكين'
    ],
    '⚔️': ['سيف متقاطع'],
    '🔫': [
        'Pistol',
        'بندقية',
        'مسدس',
        'بندقية قنبلة',
        'بندقية المياه',
        'مسدس الماء'
    ],
    '🧰': ['صندوق الأدوات'],
    '🧲': ['المغناطيس'],
    '⛓️': ['السلاسل'],
    '💉': [
        'Syringe',
        'التبرع بالدم',
        'اختبار الدم',
        'إحتياطي',
        'التطعيم'
    ],
    '🧬': [
        'حمض',
        'هيلكس الحمض النووي المزدوج'
    ],
    '🧪': ['أنبوب اختبار'],
    '🛏️': [
        'سرير',
        'غرفة نوم'
    ],
    '🛋️': [
        'أريكة و مصباح',
        'صالة',
        'مستوي',
        'سوفا'
    ],
    '🪑': ['الرئيس'],
    '🚪': [
        'باب',
        'البوابة',
        'الباب الأمامي'
    ],
    '🪟': ['النافذة'],
    '🪜': ['سلّم'],
    '🪞': ['مرآة'],
    '🚽': [
        'مرحاض',
        'حمام',
        'الشعار',
        'ريستوم',
        'WC'
    ],
    '🚿': [
        'مشاهدة',
        'رأس الشاشة'
    ],
    '🛁': [
        'حوض الاستحمام',
        'حمام الفقاعات'
    ],
    '🧴': ['زجاجة الحب'],
    '🧷': ['دبوس الأمان'],
    '🧺': ['سلة'],
    '🧻': [
        'قائمة الورق',
        'ورق المراحيض'
    ],
    '🧼': ['شريط الصابون'],
    '🧽': ['سبونج'],
    '🧯': ['إطفاء النار'],
    '🚬': [
        'السجائر',
        'رمز الدخان'
    ],
    '⚰️': [
        'الكعكة',
        'Casket',
        'دفن'
    ],
    '⚱️': [
        'قرن الدفن',
        'فتحة'
    ],
    '🛡️': ['درع'],
    '⚙️': [
        'عتاد',
        'الإعدادات',
        'خيارات'
    ],
    '⚖️': [
        'مقياس الرصيد',
        'مقاييس العدالة'
    ],
    '🔗': [
        'رابط',
        'سلسلة',
        'رابط هائل',
        'سلسلة مرتبطة'
    ],
    '💀': [
        'جمجمة',
        'الموت',
        'جمجمة رمادية',
        'الهيكل'
    ],
    '☠️': ['الجمجمة و العظام'],
    '🎡': [
        'عجلة فيري',
        'عجلة كبيرة',
        'Fairgroundl',
        'عجلة الملاحظة'
    ],
    '⛽': [
        'مضخة الوقود',
        'نفط',
        'البترول',
        'الغاز'
    ],
    '🚨': [
        'الضوء الدائر لسيارات الشرطة',
        'ضوء الطوارئ',
        'الضوء الوامض',
        'Siren'
    ],
    '🚥': ['ضوء مرور أفقي'],
    '🚦': ['ضوء حركة المرور الرأسية'],
    '⚓': [
        'مرساة نمط المدير',
        'صياد الأسماك'
    ],
    '🚧': [
        'علامة البناء',
        'لافتة مخططة سوداء وأصفر'
    ],
    '🪂': ['Parachute'],
    '💺': [
        'مقعد',
        'طائرة قطار حافلة الطيران'
    ],
    '🪐': ['زحل'],
    '🎆': [
        'ألعاب نارية',
        'انفجار'
    ],
    '🎇': [
        'Senko Hanabi',
        'معمل الألعاب النارية'
    ],
    '💷': [
        'عقدة جنيه بنكي',
        'ملاحظة 20 جنيه استرليني',
        'ملاحظة عشرون حالة',
        'بانقود مع تسجيل الجنيه الأسترليني'
    ],
    '💶': [
        'Euro Banknote',
        '100 يورو ملاحظة',
        'بنك عقدة مع علامة اليورو'
    ],
    '💵': [
        'عملة بالدولار',
        '$1 ملاحظة',
        'بانكوك مع علامة الدولار',
        'فاتورة الدولار',
        'دولار أمريكي'
    ],
    '💴': [
        'ين بانبورت',
        'Y 1000 ملاحظة',
        'ين نوتس',
        'بنك عقدة مع عين توقيع'
    ],
    '⛺': ['خيمة المخيم'],
    '⛲': [
        'نافورة',
        'خاصية المياه',
        'نافورة المياه',
        'حديقة'
    ],
    '💰': [
        'حقيبة المال',
        'أكياس النقود',
        'غني',
        '$'
    ],
    '💸': [
        'المال مع أجنحة',
        'أموال طيران',
        ' فقدان المال'
    ],
    '🏷️': ['علامة التسمية'],
    '🔖': [
        'إشارة',
        'علامة السعر',
        'وسم'
    ],
    '📑': ['علامات التبويب المرجعية'],
    '📯': [
        'قرن بريدي',
        'Bugle',
        'قرن فرنسي'
    ],
    '🪁': ['كيت'],
    '🪀': ['يو'],
    '🎊': [
        'Confetti Ball',
        'Confetti'
    ],
    '🎉': [
        'حفلة منحازة',
        'الاحتفال',
        'قبعة الحفلة'
    ],
    '🎈': [
        'بالون',
        'الحفل',
        'بالون أحمر'
    ],
    '🌡️': [
        'مقياس الحرارة',
        'الطقس الساخن',
        'درجة'
    ],
    '🛢️': ['برميل نفطي'],
    '💣': ['قنبلة'],
    '🔪': [
        'سكين المطبخ',
        'سكين',
        'سكين البوتشرز',
        'Hocho'
    ],
    '🏺': [
        'Amphora',
        'جار',
        'فتحة'
    ],
    '🗺️': ['خريطة العالم'],
    '🎼': [
        'النتيجة الموسيقية',
        'ورقة الموسيقى',
        'Treble Clef'
    ],
    '🎬': [
        'مجلس المصغّر',
        'قطع',
        'اجراء',
        'مدير',
        'قائمة الأفلام'
    ],
    '🎻': [
        'العود',
        'مجموعة المجموعة الرباعية',
        'أصغر أشكال العنف في العالم'
    ],
    '🎺': [
        'ترامبيت',
        'قرن',
        'الجاز'
    ],
    '🎸': [
        'غيتار',
        'غيتار صوتي',
        'غويتار الكلاسيكي',
        'غيتار كهربائي'
    ],
    '🎷': [
        'ساكسوفون',
        'الجاز',
        'ساكس'
    ],
    '🥁': [
        'درام',
        'درام مع عصي البراميل'
    ],
    '🎹': [
        'بيانو',
        'لوحة المفاتيح الموسيقية'
    ],
    '🪕': ['بانجو'],
    '🪗': ['أكورديون'],
    '🪘': ['درام طويل'],
    '🎨': [
        'لوحة الرسام',
        'الفن',
        'الرسم'
    ],
    '🧩': [
        'قطع الألغاز',
        'قطعة لغز جيغسو'
    ],
    '🎲': [
        'موت اللعبة',
        'النجدة'
    ],
    '🎭': [
        'فنون الأداء',
        'المسرح',
        'المسرح',
        'أقنعة الدراما',
        'أقنعة المسرح اليوناني',
        'أقنعة مفجعة وكوميديا',
        'البندقية'
    ],
    '🔍': [
        'تكبير الزجاج المميت لليسار',
        'Magnifier',
        'أيقونة البحث',
        'زجاج مكبر النقاط اليسرى',
        'البحث'
    ],
    '🔎': [
        'تميل زجاج مكبر لليمين',
        'Magnifier',
        'أيقونة البحث',
        'زجاج مكبر النقاط اليمنى',
        'البحث'
    ],
    '⌛': [
        'تمهيد الزجاج',
        'زجاج'
    ],
    '⏳': [
        'الزجاج غير منجز',
        'زجاج بالزجاج مع الرمال المتدفقة'
    ],
    '🕐': [
        'ساعة واحدة',
        'الساعة الواحدة للساعة'
    ],
    '🕜': ['الساعة ثلاثون'],
    '🕑': [
        'ساعتان O\'Clock',
        'ساعة وجها 2 ساعة'
    ],
    '🕝': ['الساعة الثانية والثلاثون'],
    '🕒': [
        'ثلاث ساعات',
        'الساعة الثالثة من الساعة'
    ],
    '🕞': ['الساعة الثالثة والثلاثون'],
    '🕓': [
        'أربع ساعات',
        'ساعة الوجه الرابع'
    ],
    '🕟': ['الساعة أربع-30'],
    '🕔': [
        'خمس ساعات',
        'ساعة الوجه 5 ساعة'
    ],
    '🕠': ['ساعة الوجه الخمس-30'],
    '🕕': [
        'ست ساعات',
        'الساعة السادسة من الساعة'
    ],
    '🕡': ['الساعة السادس-30'],
    '🕖': [
        'سبع ساعات',
        'الساعة 7 اوكساعةformat@@0'
    ],
    '🕢': ['الساعة السابعة والثلاثون'],
    '🕗': [
        'ثماني ساعات',
        'ساعة الوجه 8 ساعة'
    ],
    '🕣': ['الساعة 8 - 30'],
    '🕘': [
        'تسعة ساعة',
        'ساعة الوجه 9 ساعة'
    ],
    '🕤': ['واجهة 9 - 30 ساعة'],
    '🕙': [
        'عشرة ساعة',
        'ساعة الوجه 10 ساعة'
    ],
    '🕥': ['الساعة 10 - 30'],
    '🕚': [
        'أحد عشر ساعة',
        'الساعة الواحدة عشر أوكيس'
    ],
    '🕦': ['الوجه 11-30'],
    '🕛': [
        '12 ساعة',
        'الساعة 12 ساعة'
    ],
    '🕧': ['واجهة اثنتين-30'],
    '♨️': [
        'الربيع الساخن',
        'Onsen',
        'ستيم'
    ],
    '💈': [
        'بولي البانر',
        'متجر الشريط',
        'شرائط باربر',
        'تصفيف الشعر'
    ],
    '🎪': [
        'خيمة سيركس',
        'أعلى كبير',
        'سيرك'
    ],
    '💢': [
        'رمز الغضب',
        'علامة الغضب',
        'بوبن فيين'
    ],
    '🗯️': [
        'فقاعات الغضب الأيمن',
        'Zig Zag Bubble',
        'فقاعات الكلام الغاضبة'
    ],
    '💊': [
        'Pill',
        'كابسول',
        'لوحي',
        'المخدرات'
    ],
    '🎎': [
        'الدفعات',
        'Hinamatsuri',
        'الدفعات الإمبراطورية',
        'الدولارات اليابانية'
    ],
    '🎏': [
        'تدفق السيارات',
        'علم السمك',
        'Koinobori',
        'جوارب الريح'
    ],
    '🎐': [
        'الريح Chime',
        'Furin',
        'جلود',
        'رياح الجرس'
    ],
    '🎀': [
        'قوس الشريط',
        'قوس وردي',
        'قوس'
    ],
    '🎁': [
        'هدية مغلفة',
        'تاريخ الميلاد الحالي',
        'هدية عيد الميلاد',
        'هدية',
        'صندوق الهدايا',
        'حاضر',
        'هدية مغلفة'
    ],
    '🎫': [
        'التذكرة',
        'ستايل التذكرة',
        'تذكرة الجولات العالمية'
    ],
    '🃏': [
        'فوك',
        'بطاقة المنصهر',
        'لعب البطاقة السوداء'
    ],
    '💡': [
        'مصباح فاتح',
        'فكرة',
        'مصباح ضوء كهربائي'
    ],
    '🔦': [
        'ضوء الفلاش',
        'الشعلة',
        'شعلة كهربائية'
    ],
    '🏮': [
        'فانوس الورق الأحمر',
        'فانوس آسيوي',
        'فانوس ياباني',
        'فانوس أحمر',
        'فانوس إيزاكايا'
    ],
    '📦': [
        'حزمة',
        'صندوق',
        'طرد'
    ],
    '📇': [
        'بطاقة الفهرسة',
        'رولوديكس',
        'بطاقة النظام',
        'مؤشر البطاقة'
    ],
    '🕳️': ['فتحة'],
    '👁️‍🗨️': [
        'أنا شاهد',
        'فقاعات العين في الكلام'
    ],
    '⚜️': [
        'Fleur-de-lis',
        'الكشافة',
        'قديسي نيو أورليانز'
    ],
    '⚗️': ['Alembic'],
    '🕯️': ['شمعة'],
    '🖼️': [
        'صورة مجزأة',
        'الرسم',
        'إطار الصورة',
        'إطار مع صورة'
    ],
    '🛍️': ['أكياس التسوق'],
    '🎟️': ['تذاكر القبول'],
    '🛎️': ['Bellhop Bell'],
    '🧾': ['الإيصال'],
    '🧮': ['Abacus'],
    '🧫': ['بيتري ديش'],
    '🧹': [
        'غرفة',
        'فرشاة',
        'تفكيك'
    ],
    '🎰': [
        'خانة آلة',
        'الكازينو',
        'آلة الفاكهة',
        'المقامرة',
        'آلة البوكر'
    ],
    '🦽': ['كرسي عجلة يدوي'],
    '🦼': ['كرسي عجلة محرك'],
    '🪔': ['مصباح دييا'],
    '🦯': ['White Cane'],
    '🩸': ['إسقاط الدم'],
    '🩹': ['الضمادات الاضافية'],
    '🩺': ['ستيثيسكوب'],
    '🪶': ['الريشة'],
    '🪤': ['فخ الفأر'],
    '🫖': ['Teapot'],
    '🪨': ['الصخور'],
    '🪵': ['خشب'],
    '🪄': ['عصا سحرية'],
    '🔮': [
        'كرة كريستال',
        'Clairvoyant',
        'مصباح الثروة',
        'سيكولوجية',
        'كريستال أرجواني'
    ],
    '🪅': ['بيناتا'],
    '🪆': [
        'ضياع متحركة',
        'ماتريوشكا'
    ],
    '🪡': ['ابن الخياطة'],
    '🪢': ['عقدة'],
    '🪙': ['عملة'],
    '🪃': ['Boomerang'],
    '🪥': ['فرشاة الأسنان'],
    '🪦': ['رأس'],
    '🪧': ['Placard'],
    '🪒': ['رائع'],
    '🫙': ['جار'],
    '🛞': [
        'Wheel',
        'Vehicles',
        'Cars'
    ],
    '🛟': [
        'Ring Buoy',
        'Life Preserver',
        'Life Ring',
        'Boats',
        'Safety',
        'الماء',
        'Lifesaving'
    ],
    '🪬': [
        'Hamsa',
        'Islam',
        'Judaism',
        'Buddhism',
        'Christianity',
        'Religions',
        'Luck',
        'Protection',
        'Guidance',
        'Feminine Power',
        'Faith'
    ],
    '🪩': [
        'Mirror Ball',
        'Disco Ball'
    ],
    '🪫': [
        'Low Battery',
        'أحمر',
        'Energy'
    ],
    '🩻': ['X-Ray'],
    '🫧': [
        'Bubbles',
        'Soap Suds',
        'Carbonation',
        'Effervescent Personality'
    ],
    '🪪': [
        'Identification Card',
        'Identity',
        'Passport',
        'ID'
    ],
    '🧿': [
        'Nazar Amulet',
        'Evil Eye'
    ]
};