// descriptions took from Emojipedia.org
lang = 'ar';
//use i18n language code of the browser, more details: https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/API/i18n/LanguageCode
titles_language[lang] = {
    '🔍': 'النتائج',
    '🕒': 'الرموز التعبيرية الأكثر استخداما',
    '😀': 'ابتسامات',
    '🙋': 'الناس',
    '🦊': 'الحيوانات',
    '🅰️': 'الرموز',
    '🍎': 'الغذاء والمشروبات',
    '🏳️‍🌈': 'الأعلام',
    '🏊': 'الرياضة',
    '✈️': 'السفر والأماكن',
    '🖱️': 'التكنولوجيات والمكتب',
    '👗': 'الملابس والملحقات',
    '🖐️': 'الأيدي وأجزاء من الجسم',
    '🛎️': 'فئة أحرى'
};
emojis_language[lang] = [];
/*search*/
emojis_language[lang][0] = {};
/*smileys*/
emojis_language[lang][2] = {
    '😀': [
        'واجهة الغضب',
        ':grinning:',
        ':grinning_face:',
        '::):',
        'وجه سعيد',
        'الوجه المبتسم'
    ],
    '😃': [
        'غمر الوجه بالعين الكبيرة',
        ':smiley:',
        ':grinning_face_with_big_eyes:',
        '::D:',
        'وجه سعيد',
        'الوجه المبتسم',
        'ابتسامة بالوجه مع فتحة القالب'
    ],
    '😄': [
        'غمر الوجه بالعين المبتسمة',
        ':smile:',
        ':grinning_face_with_smiling_eyes:',
        'وجه سعيد',
        'الوجه المبتسم',
        'غضب الوجه مع العيون المبتهجة',
        'ابتسامة بالوجه مع عيون مفتوحة وبتسامة'
    ],
    '😁': [
        'وجه مع عيون الابتسامة',
        ':grin:',
        ':beaming_face_with_smiling_eyes:',
        'غمر الوجه بالعين المبتسمة'
    ],
    '😆': [
        'واجهة المطهر',
        ':grinning_squinting_face:',
        ':xD:',
        ':><:',
        'جرين كبير',
        'ابتسامة العيون المغلقة',
        'غضب',
        'غمر الوجه مع عيون مغلقة بشدة',
        'ابتسامة بالوجه مع العيون المفتوحة و العيون المغلقة بصوت قصير'
    ],
    '😅': [
        'غمر الوجه بالحلوة',
        ':happy_sweat:',
        'تمرين',
        'حلاقة سعيدة',
        'غمر الوجه مع العيون المتقطعة والسقوط الحلوي',
        'ابتسامة بالوجه مع الفتح والحلاقة الباردة'
    ],
    '🤣': [
        'ROFL',
        ':rofl:',
        'الدوران على أرضية الابنة'
    ],
    '😂': [
        'وجه مع دموع الجاه',
        ':lol:',
        'غضب',
        'بكاء الاصطناعي',
        'دموع متنقلة',
        'قهرية'
    ],
    '🙂': [
        'وجه مبتسم طفيف',
        ':smile:',
        '::):',
        'سعيد قليلاً',
        'هذا جيد'
    ],
    '🙃': [
        'الوجه الأعلى-للأسفل',
        ':upside-down_face:',
        ':upside_down_face:',
        'Sarcasm',
        'Silly',
        'الوجه إلى الأسفل'
    ],
    '😉': [
        'الوجه الفوز',
        ':winking:',
        ':;):',
        'ورق',
        'وجه ورقي',
        'الوجه الوهمي'
    ],
    '😊': [
        'ابتسامة الوجه بالعين المبتسمة',
        ':smiling_face:',
        ':^^:',
        'وجه سعيد',
        'ابتسامة',
        'الوجه المبتسم'
    ],
    '😇': [
        'ابتسامة الوجه مع الهالو',
        ':smiling_angel:',
        'الملاك',
        'هالو'
    ],
    '🥰': [
        'ابتسامة الوجه مع القلب',
        ':smiling_hearts:',
        'في وجه الحب',
        'يبتسم الوجه بالعين المبتسمة وثلاثة قلوب'
    ],
    '😍': [
        'ابتسامة الوجه بالعين القلبية',
        'love',
        ':smiling_heart-eyes:',
        ':smiling_heart_eyes:',
        ':*.*:',
        'Heart Eyes',
        'Heart Face',
        'Smiling Face with Heart-Shaped Eyes'
    ],
    '🤩': [
        'هيكل النجوم',
        ':star_eyes:',
        'متحمس',
        'عيون النجوم',
        'غائم النجم',
        'وجه Wow',
        'وجه مع عيون النجوم',
        'غمر الوجه بالعين النجمية'
    ],
    '😘': [
        'زرع قبيلة بالوجه',
        'love',
        ':kissing_face:',
        '::*:',
        '::-*:',
        'Blow A Kiss',
        'Blowing Kiss',
        'Kissing',
        'Face Throwing a Kiss'
    ],
    '😗': [
        'كيس الوجه',
        'kiss',
        ':kissing_face:',
        '::*:',
        '::-*:',
        'Duck Face',
        'Kissy Face',
        'Whistling'
    ],
    '☺️': [
        'وجه الابتسامة',
        ':smiling_face:',
        'وجه سعيد',
        'الوجه المبتسم',
        'ابتسم',
        'وجه ابتسامة بيضاء'
    ],
    '😚': [
        'كيس الوجه بالعيون المغلقة',
        ':kissing_face:',
        'وجه القِبَلة',
        'Kissy Face'
    ],
    '😙': [
        'كيس الوجه مع عيون الابتسامة',
        ':kissing_face:',
        'وجه القِبَلة',
        'Kissy',
        'تصفير',
        'تصفير'
    ],
    '😋': [
        'طعام حفظ الوجه',
        ':savoring_face:',
        'غضب',
        'جائع',
        'ابتسامة كلمات القص بالوجه',
        'حفظ الوجه للطعام الرائع',
        'يوم يوم'
    ],
    '😛': [
        'وجه مع التونغي',
        ':tongue_face:',
        '::P:',
        'شيكي',
        'وجه التونج',
        'النغمة',
        'وجه مع اللونج المخرج'
    ],
    '😜': [
        'الفوز بالوجه مع التونغي',
        ':winking:',
        ':;P:',
        'مجنون',
        'الوجه المجنون',
        'الفوز بالوجه مع اللونج المخرج',
        'وجه مع اللونج المخرج و العين الفوز'
    ],
    '🤪': [
        'Zany Face',
        ':crazy_face:',
        'عيون جنونية',
        'متحمس',
        'برية',
        'Goofy Face',
        'غمر الوجه بعين واحد كبير وعين واحد صغير'
    ],
    '😝': [
        'واجهة مع التونغي',
        ':tongue_face:',
        ':xP:',
        'النغمة',
        'الوجه مع عصا التونغو و و عيون مغلقة قفزة',
        'وجه مع قنبلة العين المغلقة بالقوة'
    ],
    '🤑': [
        'وجه المال',
        ':money-mouth_face:',
        ':money_mouth_face:',
        '::$:',
        'عيون علامة الدولار',
        'وجه المال',
        'غني'
    ],
    '🤗': [
        'وجه القفز',
        ':hugging_face:',
        'ضغطة',
        'قنبلة',
        'سماعات',
        'وجه سعيد مع اليد الغارقة'
    ],
    '🤭': [
        'عفوا',
        ':oops:',
        'وجه مع اليد فوق الفم',
        'ابتسامة الوجه مع عيون ابتسامة و غطاء البحر اليدوي'
    ],
    '🤫': [
        'شه',
        ':shushing_face:',
        'إشاعة',
        'وجه مزعج',
        'شحذ',
        'هادئ',
        'صمت',
        'صامت',
        'وجه مع غطاء الأصابع المغلقة'
    ],
    '🤔': [
        'ماذا',
        ':thinking_face:',
        '?',
        'همم',
        'وجه للتفكير',
        'دردشة تومب',
        'المفكر',
        'رمي الظل'
    ],
    '🤐': [
        'مضغوطة',
        'silent',
        'silence',
        ':zip_face:',
        'Zipper-Mouth Face',
        'Lips Sealed',
        'Sealed Lips',
        'Zip It',
        'Face With a Zipper Mouth'
    ],
    '🤨': [
        'وجه مع العيب المرتفع',
        ':face_with_raised_eyebrow:',
        'كولبرت',
        'الصخرة',
        'وجه مع العيب المرتفع',
        'وجه مع عيان واحد مرتفع'
    ],
    '😐': [
        'الوجه المحايد',
        ':neutral_face:',
        ':|',
        'وجه مع الفم المستقيم',
        'مواجهة مستقيمة'
    ],
    '😑': [
        'وجه غير معبر',
        ':expressionless_face:',
        '-_-',
        'وجه مع الفم المستقيم',
        'وجه مستقيم'
    ],
    '😶': [
        'وجه بدون مصباح',
        ':face_without_mouth:',
        'وجه فارغ',
        'عديم',
        'صمت',
        'صامت'
    ],
    '😏': [
        'وجه الاستهزاء',
        ':smirking_face:',
        'تطير',
        'الوجه الجنسي',
        'وجه الحبوب',
        'ابتسامة مقترحة'
    ],
    '😒': [
        'وجه غير مسمى',
        ':unamused_face:',
        'غير راضٍ',
        'ميه',
        'العين الجانبي',
        'غير مثير للإعجاب'
    ],
    '🙄': [
        'وجه مع العيون المتدحرجة',
        ':face_with_rolling_eye:',
        ':eye_roll:',
        'عين رملي'
    ],
    '😬': [
        'وجه غضب',
        ':awkward:',
        'أووكوارد',
        'Eek',
        'القدم في جبل',
        'نيفوسي',
        'أفضل صديق مشترك لـ Snapchat #1'
    ],
    '🤥': [
        'وجه مغاير',
        ':lying_face:',
        'كاذب',
        'أنف طويل',
        'Pinocchio'
    ],
    '😌': [
        'الوجه المعوق',
        ':relieved_face:',
        'محتوى',
        'مستأجرة'
    ],
    '😔': [
        'آسف',
        ':sad_face:',
        'وجه جنائي',
        'عقابي',
        'حزين',
        'الصادق',
        'حزن',
        'وجه جنبي حزين'
    ],
    '😪': [
        'وجه عازف',
        ':sleepy_face:',
        'الدموع الجانبي',
        'فقاعات الشبيهة'
    ],
    '🤤': [
        'ساليفا',
        ':saliva_face:',
        'Drooling Face',
        'Drool'
    ],
    '😴': [
        'وجه النوم',
        ':sleeping_face:',
        ':zzz:',
        'زتز',
        'الوجه السكون',
        'نَحْن',
        'وجه Zzz'
    ],
    '🥱': [
        'وجه الفتح',
        'tired',
        ':yawning_face:'
    ],
    '😷': [
        'وجه مع قناع طبي',
        'sick',
        'doc',
        ':face_with_medical_mask:',
        'Coronavirus',
        'COVID-19',
        'Mask Face',
        'Surgical Mask',
        'ill'
    ],
    '🤒': [
        'وجه مع مقياس الحرارة',
        ':face_with_thermometer:',
        ':sick:',
        ':ill:',
        'Ill',
        'مريض'
    ],
    '🤕': [
        'وجه مع الضمادات الرئيسية',
        'hospital',
        'sick',
        ':face_with_head-bandage:',
        ':face_with_head_bandage:',
        'Bandaged Head',
        'Clumsy',
        'Injured',
        'ill'
    ],
    '🤢': [
        'الوجه الموقوف',
        'sick',
        ':nauseated_face:',
        'Disgust',
        'Green Face',
        'Vomit',
        ':green:',
        'ill'
    ],
    '🤮': [
        'كسر الوجه',
        'sick',
        ':face_vomiting:',
        'Spew',
        'Bleah',
        'Bleurgh',
        'Yuk',
        'Yuck',
        'Ew',
        'Spew',
        'Throwing Up',
        'Vomit',
        'Face with Open Mouth Vomiting',
        'ill'
    ],
    '🤧': [
        'عطس الوجه',
        'sick',
        ':sneezing_face:',
        'Gesundheit',
        'ill'
    ],
    '🥵': [
        'وجه ساخن',
        ':hot_face:',
        'الوجه الزائد السخونة',
        ':red:'
    ],
    '🥶': [
        'وجه بارد',
        ':cold_face:',
        'رائع',
        'منزل',
        'وجه التجميد',
        ':blue:'
    ],
    '🥴': [
        'وجه ووزي',
        ':woozy_face:',
        'وجه الإسطوانة',
        'وجه مع العيون المتباينة وقماش الفاتح'
    ],
    '😵': [
        'Dizzy Face',
        ':dizzy_face:',
        'وجه عبر العيون',
        'وجه العيون الدائرية'
    ],
    '🤯': [
        'تفجير الرأس',
        'boom',
        ':exploding_head:',
        'Mind Blown',
        'Shocked Face with Exploding Head'
    ],
    '🤠': [
        'وجه القبعة',
        ':cowboy_hat_face:',
        'الكبوت',
        'وجه المذنب',
        'وجه مع قبعة القبعة'
    ],
    '🥳': [
        'الوجه المتزوج',
        ':partying_face:',
        'وجه الحفل',
        'وجه مع قرن الحفل وقبعة الحفل'
    ],
    '😎': [
        'ابتسامة الوجه بنظارات شمسية',
        ':smiling_face_with_sunglasses:',
        'رائع',
        'أفضل أصدقاء متبادلين (السنادشة)',
        'نظارات شمسية'
    ],
    '🤓': [
        'وجه مشرق',
        ':nerd_face:',
        'Nerdy'
    ],
    '🧐': [
        'وجه مع Monocle',
        ':face_with_monocle:'
    ],
    '😕': [
        'وجه مشتت',
        ':confused_face:',
        '::/:',
        '::S:',
        'غير مضافة',
        'محير'
    ],
    '😟': [
        'وجه مقلق',
        ':worried_face:',
        '::(:',
        'حزين',
        'الصادق'
    ],
    '🙁': [
        'وجه القذف البسيط',
        ':slightly_frowning_face:',
        '::(:',
        'حزين بقليل'
    ],
    '☹️': [
        'وجه الإغراق',
        ':frowning_face:',
        '::(:',
        'ميغافون',
        'وجه القذف الأبيض'
    ],
    '😮': [
        'واجهة',
        ':wow:',
        '::O:',
        'يا إلهي!',
        'وجه مع فتح الفم',
        'فتح الفم',
        'واجهة مفاجئة مع فتح القالب'
    ],
    '😯': [
        'وجه مشحون',
        ':husked_face:',
        '::O:',
        'مفاجأة',
        'وجه مفاجئ'
    ],
    '😲': [
        'وجه صدم',
        ':shocked_face:',
        '::O:',
        'واجهة',
        'الوجه المصيد',
        'وجه الإسطوانة',
        'واجهة الغاز'
    ],
    '😳': [
        'وجه مضغوط',
        ':flushed_face:',
        '::$:',
        'الوجه المدمر',
        'مجنون',
        'العار',
        'وجه مع العيون المفتوحة'
    ],
    '🥺': [
        'الوجه الرائد',
        ':pleading_face:',
        '::(:',
        'النزول',
        'عيون المسقط',
        'Simp',
        'وجه مع قيادة العيون'
    ],
    '😦': [
        'عرض الوجه مع فتح البحر',
        ':frowning_face_with_open_mouth:',
        ':D::',
        'النزول'
    ],
    '😨': [
        'عجبت',
        ':scared:',
        ':D::',
        'وجه مخيف',
        'مدهش'
    ],
    '😰': [
        'وجه متعب مع الحلو',
        ':anxious_face_with_sweat:',
        'الوجه الأزرق',
        'الوجه المثير للقلق',
        'وجه عنيف',
        'وجه مع الفتح والحلاقة الباردة'
    ],
    '😥': [
        'واجهة حزينة ولكن تم إعاقتها',
        ':sad_but_relieved_face:',
        '::(:',
        'حلاقة عيسى',
        'وجه مخيب للآمال ولكنه معوق'
    ],
    '😢': [
        'بكاء الوجه',
        ':crying_face:',
        '::(:',
        'البكاء',
        'دموع'
    ],
    '😭': [
        'وجه لودلي',
        ':loudly_crying_face:',
        'Bawling',
        'البكاء',
        'دموع حزينة',
        'Sobbing'
    ],
    '😱': [
        'شاشة الوجه في الخوف',
        ':face_screaming_in_fear:',
        'المنزل وحده',
        'سكرام',
        'الوجه الظاهر'
    ],
    '😖': [
        'وجه معتمد',
        ':confounded_face:',
        'تفكيك الفم',
        'وجه متقطع'
    ],
    '😣': [
        'المثابرة على الوجه',
        ':persevering_face:',
        'وجه لا حول له',
        'عيون سكر'
    ],
    '😞': [
        'الوجه المخيب للآمال',
        ':disappointed_face:',
        '::(:',
        'حزين',
        'الصادق'
    ],
    '😓': [
        'تنزيل الوجه مع الحلوى',
        ':downcast_face_with_sweat:',
        'العمل الشاق',
        'وجه حزين',
        'وجه مع الحلاقة الباردة'
    ],
    '😩': [
        'وجه الوزن',
        ':weary_face:',
        'الوجه المعطل',
        'الإبحار'
    ],
    '😫': [
        'الوجه الملك',
        ':tired_face:',
        'مستنفد',
        'رفع الاحتياطي الفيدرالي',
        'الوجه المعطل'
    ],
    '😤': [
        'وجه مع ستيم من الأنف',
        ':face_with_steam_from_nose:',
        'انتداب المظالم',
        'محبطة',
        'الوجه المجنون',
        'الخردة',
        'الضغائن مع وجه الغضب'
    ],
    '😡': [
        'وجه اللمس',
        'fuck',
        ':pouting_face:',
        'Angry Face',
        'Grumpy Face',
        'Mad Face',
        'Red Face',
        ':red:'
    ],
    '😠': [
        'الوجه الغاضب',
        ':angry_face:',
        'غاضب',
        'الوجه الكبير'
    ],
    '🤬': [
        'تجميل',
        'fuck',
        ':swearing:',
        '@#$%&!',
        'Face with Symbols on Mouth',
        'Cursing',
        'Cussing',
        'Grawlix',
        'Face With Symbols Over Mouth',
        'Serious Face with Symbols Covering Mouth',
        ':red:'
    ],
    '🥲': [
        'ابتسامة بالوجه مع الدموع',
        ':smiling_face_with_tear:'
    ],
    '😮‍💨': [
        'كشف الوجه',
        ':face_exhaling:',
        'فطيرة'
    ],
    '😵‍💫': [
        'وجه مع عيون حلزونية',
        ':face_with_spiral_eyes:',
        'Dizzy Face'
    ],
    '😶‍🌫️': [
        'Face in Clouds',
        'smoke',
        ':face_in_clouds:',
        'Brain Fog',
        'Forgetful',
        'Haze'
    ],
    '🥸': [
        'الوجه المخفي',
        ':disguised_face:'
    ],
    '🫠': [
        'وجه الذوبان',
        ':melting_face:'
    ],
    '🫢': [
        'وجه مع العيون المفتوحة و اليد فوق الفم',
        ':face_with_open_eyes_and_hand_over_mouth:'
    ],
    '🫣': [
        'وجه مع العين الخبيثة',
        ':face_with_peeking_eye:'
    ],
    '🫡': [
        'تحية الوجه',
        ':saluting_face:',
        'عسكرية',
        'الجيش',
        'اسطنبول',
        'البحرية'
    ],
    '🫥': [
        'وجه الخط المقطوع',
        ':dotted_line_face:',
        ':transparent:'
    ],
    '🫤': [
        'وجه مع قماش الدياغونال',
        ':face_with_diagonal_mouth:'
    ],
    '🥹': [
        'حمل الوجه الدموع الخلفية',
        ':face_holding_back_tears:'
    ],
    //"🫨": ["Shaking Face", ":shaking_face:"],
    '😈': [
        'ابتسامة الوجه مع القرون',
        ':smiling_face_with_horns:',
        'الشرير',
        'قرن شرير',
        'شيطان سعيد',
        'الشرير الأرجواني',
        'الشرير الأحمر',
        ':purple:'
    ],
    '👿': [
        'وجه غاضب مع القرون',
        ':angry_face_with_horns:',
        'الشرير',
        'قرن شرير',
        'الشرير الأرجواني',
        'جبلن أرجواني',
        'الشرير الحزين',
        'Imp',
        ':purple:'
    ],
    '🤡': [
        'وجه المهرج',
        ':clown_face:',
        'المهرج الرهيب',
        'المهرج الشرير',
        'المهرج المخيف'
    ],
    '👽': [
        'غريب',
        ':alien:',
        'ET'
    ],
    '👾': [
        'وحش أجنبي',
        ':alien_monster:',
        'غاز الفضاء',
        'وحش لعبة الفيديو'
    ],
    '🤖': [
        'Robot',
        ':robot:',
        'وجه الروبوت'
    ],
    '👹': [
        'Ogre',
        ':ogre:',
        'قناع الوجه',
        'Oni',
        'وحش أحمر',
        'أوغري ياباني',
        ':red:'
    ],
    '👻': [
        'الشبح',
        ':ghost:',
        'Halloween'
    ],
    '🗣️': [
        'رأس ناطق',
        ':speaking_head:',
        'الشاطئ',
        'رسالة',
        'التقاط',
        'رأس متحدث في سيلويت',
        ':blue:'
    ],
    '👤': [
        'لعنة في سيلويت',
        ':bust_in_silhouette:',
        'ظل',
        'Silhouette',
        'المستخدم',
        'سيلويت للشخص',
        ':blue:'
    ],
    '🫂': [
        'الناس يقطعون',
        ':people_hugging:',
        ':blue:'
    ],
    '👥': [
        'باصات في سيلويت',
        ':busts_in_silhouette:',
        'الظلال',
        'Silhouettes',
        'المستخدمون',
        'سيلويت لشخصين',
        ':blue:'
    ]
};
/*people*/
emojis_language[lang][3] = {
    '👶{{skin_tone}}': [
        'طفل',
        ':baby:',
        'طفل',
        'متدرب'
    ],
    '🧒{{skin_tone}}': [
        'طفل',
        ':child:',
        'الطفل المحايد جنسانيا'
    ],
    '👧{{skin_tone}}': [
        'فتاة',
        ':girl:',
        ':woman:'
    ],
    '🧑{{skin_tone}}': [
        'شخص',
        ':person:',
        'البالغون المحايدون جنسانيا',
        'الكبار',
        ':person:'
    ],
    '🧑{{skin_tone}}': [
        'شخص: لعب',
        ':person_beard:',
        'لحم',
        'شخص محبوس',
        'شخص محبوس',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦰': [
        'شخص: شعر أحمر',
        ':person_red_hair:',
        'شخص جينجر',
        'رأس شخصي',
        'شخص ذو شعر أحمر',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦱': [
        'شخص: شعر عاطفي',
        ':person_curly_hair:',
        'شخص ذو شعر كوري',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦳': [
        'شخص: شعر أبيض',
        ':person_white_hair:',
        'شخص ذو شعر رمادي',
        ':person:'
    ],
    '🧑{{skin_tone}}‍🦲': [
        'الشخص: بالد',
        ':person_bald:',
        'شخص بدون شعر',
        ':person:'
    ],
    '👱{{skin_tone}}': [
        'الشخص: الشعر المليء',
        ':person_blond_hair:',
        'شخص ذو شعر بلوندي',
        ':person:'
    ],
    '👨{{skin_tone}}': [
        'رجل',
        ':man:',
        'ذكر',
        'رجل الماستاشي',
        ':man:'
    ],
    '🧔{{skin_tone}}‍♂️': [
        'الرجل: لحم',
        ':man_beard:',
        'لحم',
        'رجل محبوس',
        'شخص محبوس',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦰': [
        'الرجل: شعر أحمر',
        ':man_red_hair:',
        'رجل الجينجر',
        'Man Redhead',
        'رجل ذو شعر أحمر',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦱': [
        'الرجل: شعر عاطفي',
        ':man_curly_hair:',
        'رجل مع شعر كوري',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦳': [
        'الرجل: شعر أبيض',
        ':man_white_hair:',
        'رجل مع شعر رمادي',
        ':man:'
    ],
    '👨{{skin_tone}}‍🦲': [
        'الرجل: بالد',
        ':man_bald:',
        'رجل بدون شعر',
        ':man:'
    ],
    '👱{{skin_tone}}‍♂️': [
        'الرجل: الشعر الوهمي',
        ':man_blond_hair:',
        'رجل مع شعر بلوندي',
        ':man:'
    ],
    '👩{{skin_tone}}': [
        'امرأة',
        ':woman:',
        'أنثى',
        'سيدة',
        'المرأة الصفراء',
        ':woman:'
    ],
    '🧔{{skin_tone}}‍♀️': [
        'المرأة: لحم',
        ':woman_beard:',
        'لحم',
        'امرأة منبوذة',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦰': [
        'المرأة: شعر أحمر',
        ':woman_red_hair:',
        'امرأة الجينجر',
        'Woman Redhead',
        'امرأة مع شعر أحمر',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦱': [
        'المرأة: شعر كعادي',
        ':woman_curly_hair:',
        'امرأة مع شعر كوري',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦳': [
        'المرأة: شعر أبيض',
        ':woman_white_hair:',
        'امرأة مع شعر رمادي',
        ':woman:'
    ],
    '👩{{skin_tone}}‍🦲': [
        'المرأة: بالد',
        ':woman_bald:',
        'امرأة بدون شعر',
        ':woman:'
    ],
    '👱{{skin_tone}}‍♀️': [
        'المرأة: شعر بلوند',
        ':woman_blond_hair:',
        'المرأة مع شعر بلوندي',
        ':woman:'
    ],
    '👴{{skin_tone}}': [
        'رجل أقدم',
        ':older_man:',
        ':older:',
        'رجل مسن',
        'Grandpa',
        'رجل قديم',
        ':man:'
    ],
    '👵{{skin_tone}}': [
        'المرأة الأكبر سنا',
        ':older_woman:',
        ':older:',
        'امرأة مسنة',
        'جدة',
        'نانا',
        'سيدة مسنة',
        'امرأة قديمة',
        ':woman:'
    ],
    '🧓{{skin_tone}}': [
        'الشخص الأكبر سنا',
        ':older_person:',
        ':older:',
        'البالغون المسنون المحايدون جنسانيا',
        ':person:'
    ],
    '👼{{skin_tone}}': [
        'الملاك الصغير',
        ':baby_angel:',
        'الملاك',
        'Cherub',
        'الكبيل',
        'بوتو'
    ],
    '👨{{skin_tone}}‍🎄': [
        'بابا نويل',
        ':santa_claus:',
        'سانت نيكولاس',
        'Sinterklaas',
        'الأب عيد الميلاد',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎄': [
        'السيدة كلوس',
        ':mrs_claus:',
        'عيد الميلاد الأم',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎄': [
        'Mx Claus',
        ':mx_clause:',
        'عيد الميلاد الشخصي',
        ':person:'
    ],
    '🤴{{skin_tone}}': [
        'الأمير',
        ':price:',
        ':man:'
    ],
    '👸{{skin_tone}}': [
        'الأميرة',
        ':pricess:',
        'فتاة بلوندي',
        'فتاة مع التاج',
        'فتاة مع تيارا',
        ':woman:'
    ],
    '🫅{{skin_tone}}': [
        'شخص مع التاج',
        ':person_with_crown:',
        ':person:'
    ],
    '👳{{skin_tone}}‍♂️': [
        'بركة زهرة الرجل',
        ':man_wearing_turban:',
        ':wearing_turban:',
        'عربي',
        'مسلم',
        'السيخ',
        'تورباني',
        ':man:'
    ],
    '👳{{skin_tone}}‍♀️': [
        'بركة ارتداء المرأة',
        ':woman_wearing_turban:',
        ':wearing_turban:',
        'عربي',
        'مسلم',
        'السيخ',
        'تورباني',
        ':woman:'
    ],
    '👳{{skin_tone}}': [
        'بركة الزهور الشخصية',
        ':person_wearing_turban:',
        ':wearing_turban:',
        'عربي',
        'مسلم',
        'السيخ',
        'تورباني',
        ':person:'
    ],
    '👲{{skin_tone}}': [
        'شخص مع الجمجمة',
        ':person_with_skullcap:',
        'رجل آسيوي',
        'رجل مع الحد الأقصى الصيني',
        'رجل مع Gua Pi Mao',
        ':person:'
    ],
    '🧕{{skin_tone}}': [
        'امرأة مع غطاء الرأس',
        ':woman_with_headscarf:',
        'Hijab',
        'شخص ذو غطاء الرأس',
        ':woman:'
    ],
    '🤵{{skin_tone}}‍♀️': [
        'رجل في توكسيدو',
        ':man_in_tuxedo:',
        ':tuxedo:',
        'Groom',
        'رجل في بدلة',
        'زفاف',
        ':man:'
    ],
    '🤵{{skin_tone}}‍♂️': [
        'المرأة في توكسيدو',
        ':woman_in_tuxedo:',
        ':tuxedo:',
        'Groom',
        'المرأة في بدلة',
        'زفاف',
        ':woman:'
    ],
    '🤵{{skin_tone}}': [
        'شخص في توكسيدو',
        ':person_in_tuxedo:',
        ':tuxedo:',
        'Groom',
        'شخص في بدلة',
        'زفاف',
        ':person:'
    ],
    '👰{{skin_tone}}‍♂️': [
        'رجل مع فييل',
        ':man_with_veil:',
        ':veil:',
        'زفاف',
        'بريديغروم',
        'الزواج',
        ':man:'
    ],
    '👰{{skin_tone}}‍♀️': [
        'امرأة مع فييل',
        ':woman_with_veil:',
        ':veil:',
        'زفاف',
        'العروس',
        'العروس مع فييل',
        'الزواج',
        ':woman:'
    ],
    '👰{{skin_tone}}': [
        'شخص مع فييل',
        ':person_with_veil:',
        ':veil:',
        'زفاف',
        'الزواج',
        ':person:'
    ],
    '👨{{skin_tone}}‍🍼': [
        'تغذية الطفل الرضيع',
        ':man_feeding_baby:',
        ':feeding_baby:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🍼': [
        'تغذية المرأة الطفلة',
        ':woman_feeding_baby:',
        ':feeding_baby:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🍼': [
        'تغذية الطفل',
        ':person_feeding_baby:',
        ':feeding_baby:',
        ':person:'
    ],
    '🥷': [
        'النينجا',
        ':ninja:'
    ],
    '🫃{{skin_tone}}': [
        'رجل حامل',
        ':pregnant_man:',
        ':pregnant:',
        'الحمل',
        ':man:'
    ],
    '🤰{{skin_tone}}': [
        'المرأة الحامل',
        ':pregnant_woman:',
        ':pregnant:',
        'الحمل',
        'السيدة الحامل',
        ':woman:'
    ],
    '🫄{{skin_tone}}': [
        'الشخص الحامل',
        ':pregnant_person:',
        ':pregnant:',
        'الحمل',
        ':person:'
    ],
    '🤱{{skin_tone}}‍': [
        'الرضاعة الطبيعية',
        ':breast-feeding:',
        ':breast_feeding:',
        'الرضاعة الطبيعية'
    ],
    '🦸{{skin_tone}}‍♂️': [
        'بطل خارق',
        ':man_superhero:',
        ':superhero:',
        ':man:'
    ],
    '🦸{{skin_tone}}‍♀️': [
        'البطل الخارق للمرأة',
        ':woman_superhero:',
        ':superhero:',
        ':woman:'
    ],
    '🦸{{skin_tone}}': [
        'بطل خارق شخصي',
        ':person_superhero:',
        ':superhero:',
        ':person:'
    ],
    '🦹{{skin_tone}}‍♂️': [
        'رجل خارفيل',
        ':man_supervillain:',
        ':supervillain:',
        ':man:'
    ],
    '🦹{{skin_tone}}‍♀️': [
        'امرأة خارفيل',
        ':woman_supervillain:',
        ':supervillain:',
        ':woman:'
    ],
    '🦹{{skin_tone}}': [
        'شخص سوبرفيلين',
        ':person_supervillain:',
        ':supervillain:',
        ':person:'
    ],
    '🧙{{skin_tone}}‍♂️': [
        'رجل ميجا',
        ':man_mage:',
        ':mage:',
        'Sorcerer',
        'المعالج',
        ':man:'
    ],
    '🧙{{skin_tone}}‍♀️': [
        'عمرة المرأة',
        ':woman_mage:',
        ':mage:',
        'ساحرات',
        'عازفة',
        'المعالج',
        ':woman:'
    ],
    '🧙{{skin_tone}}': [
        'شخص ماجور',
        ':person_mage:',
        ':mage:',
        'المعالج',
        ':mage:',
        ':person:'
    ],
    '🧚{{skin_tone}}‍♂️': [
        'جنية رجل',
        ':man_fairy:',
        ':fairy:',
        ':man:'
    ],
    '🧚{{skin_tone}}‍♀️': [
        'جنية المرأة',
        ':woman_fairy:',
        ':fairy:',
        ':woman:'
    ],
    '🧚{{skin_tone}}': [
        'جنية شخص',
        ':person_fairy:',
        ':fairy:',
        ':person:'
    ],
    '🧛{{skin_tone}}‍♂️': [
        'مصاص دماء الرجل',
        ':man_vampire:',
        ':vampire:',
        'دراكولا',
        ':man:'
    ],
    '🧛{{skin_tone}}‍♀️': [
        'مصاص دماء المرأة',
        ':woman_vampire:',
        ':vampire:',
        ':woman:'
    ],
    '🧛{{skin_tone}}': [
        'مصاص دماء شخص',
        ':person_vampire:',
        ':vampire:',
        ':person:'
    ],
    '🧜{{skin_tone}}‍♂️': [
        'ميرمان',
        ':merman:',
        'Merboy',
        ':man:'
    ],
    '🧜{{skin_tone}}‍♀️': [
        'حمراء',
        ':mermaid:',
        'فتاة',
        ':woman:'
    ],
    '🧜{{skin_tone}}': [
        'Merperson',
        ':merperson:',
        ':person:'
    ],
    '🧝{{skin_tone}}‍♂️': [
        'قزم الرجل',
        ':man_elf:',
        ':elf:',
        ':man:'
    ],
    '🧝{{skin_tone}}‍♀️': [
        'قزم المرأة',
        ':woman_elf:',
        ':elf:',
        ':woman:'
    ],
    '🧝{{skin_tone}}': [
        'قزم شخصي',
        ':person_elf:',
        ':elf:',
        ':person:'
    ],
    '🧞‍♂️': [
        'Man Genie',
        ':man_genie:',
        ':genie:',
        ':man:'
    ],
    '🧞‍♀️': [
        'Woman Genie',
        ':woman_genie:',
        ':genie:',
        ':woman:'
    ],
    '🧞': [
        'جيني شخصي',
        ':person_genie:',
        ':genie:',
        ':person:'
    ],
    '🕵️{{skin_tone}}‍♂️': [
        'كاشف الإنسان',
        ':man_detective:',
        ':detective:',
        'عين خاص',
        'Sleuth',
        'التجسس',
        'Man Sleuth',
        'نزيف أو تجسس',
        '007',
        'مفتش',
        ':man:'
    ],
    '🕵️{{skin_tone}}‍♀️': [
        'كتشف المرأة',
        ':woman_detective:',
        ':detective:',
        'عين خاص',
        'Sleuth',
        'التجسس',
        'زهرة المرأة',
        'نزيف أو تجسس',
        '007',
        'مفتش',
        ':woman:'
    ],
    '🕵{{skin_tone}}': [
        'مكتشف الشخص',
        ':person_detective:',
        ':detective:',
        'عين خاص',
        'Sleuth',
        'التجسس',
        'سحر شخصي',
        'نزيف أو تجسس',
        '007',
        'مفتش',
        ':person:'
    ],
    '💂{{skin_tone}}‍♂️': [
        'الرجل: الحارس',
        ':man_guard:',
        ':guard:',
        'الحرس البريطاني',
        'حارس القدم',
        ':man:'
    ],
    '💂{{skin_tone}}‍♀️': [
        'المرأة: الحارس',
        ':woman_guard:',
        ':guard:',
        'الحرس البريطاني',
        'حارس القدم',
        ':woman:'
    ],
    '💂{{skin_tone}}': [
        'شخص: حارس',
        ':person_guard:',
        ':guard:',
        'الحرس البريطاني',
        'حارس القدم',
        ':person:'
    ],
    '👮{{skin_tone}}‍♂️': [
        'ضابط شرطة',
        ':man_police_officer:',
        ':police_officer:',
        'شرطي',
        'الشرطة',
        'شرطي',
        ':man:'
    ],
    '👮{{skin_tone}}‍♀️': [
        'ضابطة الشرطة النسائية',
        ':woman_police_officer:',
        ':police_officer:',
        'شرطي',
        'الشرطة',
        'الشرطة',
        ':woman:'
    ],
    '👮{{skin_tone}}': [
        'ضابط شرطة',
        ':person_police_officer:',
        ':police_officer:',
        'شرطي',
        'الشرطة',
        ':person:'
    ],
    '👨{{skin_tone}}‍🚒': [
        'رجل إطفاء',
        ':man_firefighter:',
        ':firefighter:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🚒': [
        'سيارة إطفاء',
        ':woman_firefighter:',
        ':firefighter:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🚒': [
        'رجل إطفاء',
        ':person_firefighter:',
        ':firefighter:',
        ':person:'
    ],
    '👨{{skin_tone}}‍✈️': [
        'رائد الرجل',
        ':man_pilot:',
        ':pilot:',
        ':man:'
    ],
    '👩{{skin_tone}}‍✈️': [
        'الطيار النسائي',
        ':woman_pilot:',
        ':pilot:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍✈️': [
        'طيار شخصي',
        ':person_pilot:',
        ':pilot:',
        ':person:'
    ],
    '👨{{skin_tone}}‍💻': [
        'عالم التكنولوجيا',
        ':man_technologist:',
        ':technologist:',
        'عالم التكنولوجيا',
        ':man:'
    ],
    '👩{{skin_tone}}‍💻': [
        'التكنولوجيا النسائية',
        ':woman_technologist:',
        ':technologist:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍💻': [
        'خبير تكنولوجي',
        ':person_technologist:',
        ':technologist:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🎤': [
        'مغني الرجل',
        ':man_singer:',
        ':singer:',
        'Bowie',
        'Aladdin Sane',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎤': [
        'المرأة المغنية',
        ':woman_singer:',
        ':singer:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎤': [
        'مغني شخصي',
        ':person_singer:',
        ':singer:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🎨': [
        'فنان الرجل',
        ':man_artist:',
        ':artist:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎨': [
        'فنان المرأة',
        ':woman_artist:',
        ':artist:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎨': [
        'فنان شخصي',
        ':person_artist:',
        ':artist:',
        ':person:'
    ],
    '👷{{skin_tone}}‍♂️': [
        'عامل بناء رجل',
        ':man_contruction_worker:',
        ':contruction_worker:',
        ':man:'
    ],
    '👷{{skin_tone}}‍♀️': [
        'عاملة البناء النسائية',
        ':woman_contruction_worker:',
        ':contruction_worker:',
        ':woman:'
    ],
    '👷{{skin_tone}}': [
        'عامل بناء شخصي',
        ':person_contruction_worker:',
        ':contruction_worker:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🚀': [
        'رائد فضائي',
        ':man_astronaut:',
        ':astronaut:',
        'رجل كسمونت',
        ':man:'
    ],
    '👩{{skin_tone}}‍🚀': [
        'رائدة الفضاء النسائية',
        ':woman_astronaut:',
        ':astronaut:',
        'رائدة كوسمونات أنثى',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🚀': [
        'رائد فضاء شخصي',
        ':person_astronaut:',
        ':astronaut:',
        'رائد كسمونات شخصي',
        ':person:'
    ],
    '👨{{skin_tone}}‍🔬': [
        'عالم الرجل',
        ':man_scientist:',
        ':scientist:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🔬': [
        'عالم المرأة',
        ':woman_scientist:',
        ':scientist:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🔬': [
        'عالم شخصي',
        ':person_scientist:',
        ':scientist:',
        ':person:'
    ],
    '👨{{skin_tone}}‍💼': [
        'عامل مكتب الرجل',
        ':man_office_worker:',
        ':office_worker:',
        'الرئيس التنفيذي',
        'رجل الأعمال',
        ':man:'
    ],
    '👩{{skin_tone}}‍💼': [
        'المرأة العاملة في المكتب',
        ':woman_office_worker:',
        ':office_worker:',
        'سيدة أعمال',
        'الرئيس التنفيذي',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍💼': [
        'موظف مكتب',
        ':person_office_worker:',
        ':office_worker:',
        'الأعمال',
        'الرئيس التنفيذي',
        ':person:'
    ],
    '👨{{skin_tone}}‍🏭': [
        'عامل مصنع رجل',
        ':man_factory_worker:',
        ':factory_worker:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🏭': [
        'عاملة المصانع النسائية',
        ':woman_factory_worker:',
        ':factory_worker:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🏭': [
        'عامل مصنع شخصي',
        ':person_factory_worker:',
        ':factory_worker:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🔧': [
        'ميكانيكي رجل',
        ':man_mechanic:',
        ':mechanic:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🔧': [
        'ميكانيكي المرأة',
        ':woman_mechanic:',
        ':mechanic:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🔧': [
        'ميكانيكي شخصي',
        ':person_mechanic:',
        ':mechanic:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🍳': [
        'رجل كوك',
        ':man_cook:',
        ':cook:',
        'رئيس الرجل',
        'الرئيس الذكر',
        ':man:'
    ],
    '👩{{skin_tone}}‍🍳': [
        'طهي المرأة',
        ':woman_cook:',
        ':cook:',
        'الرئيس النسائي',
        'الرئيس الأنثوي',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🍳': [
        'طهي شخصي',
        ':person_cook:',
        ':cook:',
        'رئيس شخصي',
        ':person:'
    ],
    '👨{{skin_tone}}‍🌾': [
        'مزارع رجل',
        ':man_farmer:',
        ':farmer:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🌾': [
        'مزارع المرأة',
        ':woman_farmer:',
        ':farmer:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🌾': [
        'مزارع شخصي',
        ':person_farmer:',
        ':farmer:',
        ':person:'
    ],
    '👨{{skin_tone}}‍‍⚖️': [
        'قاضية مان',
        ':man_judge:',
        ':judge:',
        ':man:'
    ],
    '👩{{skin_tone}}‍‍⚖️': [
        'قاضية امرأة',
        ':woman_judge:',
        ':judge:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍‍⚖️': [
        'قاض شخصي',
        ':person_judge:',
        ':judge:',
        ':person:'
    ],
    '👨{{skin_tone}}‍‍🏫': [
        'المعلم',
        ':man_teacher:',
        ':teacher:',
        ':man:'
    ],
    '👩{{skin_tone}}‍‍🏫': [
        'المعلمات',
        ':woman_teacher:',
        ':teacher:',
        ':woman:'
    ],
    '🧑‍{{skin_tone}}‍‍🏫': [
        'معلم شخصي',
        ':person_teacher:',
        ':teacher:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🎓': [
        'طالب رجل',
        ':man_student:',
        ':student:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🎓': [
        'الطالبة',
        ':woman_student:',
        ':student:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🎓': [
        'طالب شخصي',
        ':person_student:',
        ':student:',
        ':person:'
    ],
    '👨{{skin_tone}}‍⚕️': [
        'أخصائي الصحة',
        ':man_health_worker:',
        ':health_worker:',
        'طبيب ذكري',
        'ممرضة الذكور',
        ':man:'
    ],
    '👩{{skin_tone}}‍⚕️': [
        'العاملات الصحيات',
        ':woman_health_worker:',
        ':health_worker:',
        'دكتوراه أنثى',
        'ممرضة',
        ':woman:'
    ],
    '🧑‍{{skin_tone}}‍⚕️': [
        'عامل صحة شخصي',
        ':person_health_worker:',
        ':health_worker:',
        'طبيب شخصي',
        'ممرضة',
        ':person:'
    ],
    '🤷{{skin_tone}}‍♂️': [
        'رجل مشرق',
        ':man_shrugging:',
        ':shrugging:',
        'رجل خادع',
        'dunno',
        ':man:'
    ],
    '🤷{{skin_tone}}‍♀️': [
        'انقطاع المرأة',
        ':woman_shrugging:',
        ':shrugging:',
        'امرأة فارغة',
        'dunno',
        ':woman:'
    ],
    '🤷{{skin_tone}}': [
        'انقطاع شخصي',
        ':person_shrugging:',
        ':shrugging:',
        'شخص غير معروف',
        'dunno',
        ':person:'
    ],
    '🤦{{skin_tone}}‍♂️': [
        'وجه الرجل',
        ':man_facepalming:',
        ':facepalming:',
        ':man:'
    ],
    '🤦{{skin_tone}}‍♀️': [
        'مواجهة المرأة',
        ':woman_facepalming:',
        ':facepalming:',
        ':woman:'
    ],
    '🤦{{skin_tone}}': [
        'مواجهة الشخص',
        ':person_facepalming:',
        ':facepalming:',
        ':person:'
    ],
    '🙇{{skin_tone}}‍‍♂️': [
        'انحناء الرجل',
        ':man_bowing:',
        ':bowing:',
        ':man:'
    ],
    '🙇{{skin_tone}}‍‍♀️': [
        'ضرب المرأة',
        ':woman_bowing:',
        ':bowing:',
        ':woman:'
    ],
    '🙇{{skin_tone}}': [
        'انحناء شخصي',
        ':person_bowing:',
        ':bowing:',
        ':person:'
    ],
    '🧏{{skin_tone}}‍♂️': [
        'رجل الصم',
        ':deaf_man:',
        ':deaf:',
        ':man:'
    ],
    '🧏{{skin_tone}}‍‍♀️': [
        'صم المرأة',
        ':deaf_woman:',
        ':deaf:',
        ':woman:'
    ],
    '🧏{{skin_tone}}': [
        'صم الشخص',
        ':deaf_person:',
        ':deaf:',
        ':person:'
    ],
    '🙋{{skin_tone}}‍‍♂️': [
        'رعاة الإنسان يدوياً',
        ':man_raising_hand:',
        'رجل سعيد يربي يد واحدة',
        ':raising_hand:',
        ':man:'
    ],
    '🙋{{skin_tone}}‍♀️': [
        'تربية المرأة يدوياً',
        ':woman_raising_hand:',
        'امرأة سعيدة تربي يد واحدة',
        ':raising_hand:',
        ':woman:'
    ],
    '🙋{{skin_tone}}': [
        'الشخص الذي يربي اليد',
        ':person_raising_hand:',
        'شخص سعيد يرفع يد واحدة',
        ':raising_hand:',
        ':person:'
    ],
    '💁{{skin_tone}}‍♂️': [
        'اليد الشاطئة',
        ':man_tipping_hand:',
        'رجل مكتب الاستعلامات',
        ':tipping_hand:',
        ':man:'
    ],
    '💁{{skin_tone}}‍♀️': [
        'نصيحة المرأة',
        ':woman_tipping_hand:',
        'المرأة في مكتب المعلومات',
        ':tipping_hand:',
        ':woman:'
    ],
    '💁{{skin_tone}}': [
        'اليد الشخصية',
        ':person_tipping_hand:',
        'شخص مكتب المعلومات',
        ':tipping_hand:',
        ':person:'
    ],
    '🙆{{skin_tone}}‍♂️': [
        'Man Gesturing OK',
        ':man_gesturing_ok:',
        ':gesturing_ok:',
        ':man:'
    ],
    '🙆{{skin_tone}}‍♀️': [
        'المرأة غستندينغ حسنا',
        ':woman_gesturing_ok:',
        ':gesturing_ok:',
        ':woman:'
    ],
    '🙆{{skin_tone}}': [
        'شخص جيستنغ حسنا',
        ':person_gesturing_ok:',
        ':gesturing_ok:',
        ':person:'
    ],
    '🙅{{skin_tone}}‍♂️': [
        'الرجل غستنغ لا',
        ':man_gesturing_no:',
        ':gesturing_no:',
        ':man:'
    ],
    '🙅{{skin_tone}}‍♀️': [
        'رقم Gesturing',
        ':woman_gesturing_no:',
        ':gesturing_no:',
        ':woman:'
    ],
    '🙅{{skin_tone}}': [
        'الرقم الشخصي',
        ':person_gesturing_no:',
        ':gesturing_no:',
        ':person:'
    ],
    '🙎{{skin_tone}}‍♂️': [
        'قذارة الرجل',
        ':man_pouting:',
        ':pouting:',
        ':man:'
    ],
    '🙎{{skin_tone}}‍‍♀️': [
        'قذف المرأة',
        ':woman_pouting:',
        ':pouting:',
        ':woman:'
    ],
    '🙎{{skin_tone}}': [
        'قذف شخصي',
        ':person_pouting:',
        ':pouting:',
        ':person:'
    ],
    '🙍{{skin_tone}}‍♂️': [
        'Man Frowning',
        ':man_frowining:',
        ':frowining:',
        ':man:'
    ],
    '🙍{{skin_tone}}‍♀️': [
        'رمي المرأة',
        ':woman_frowining:',
        ':frowining:',
        ':woman:'
    ],
    '🙍{{skin_tone}}': [
        'رمي شخص',
        ':person_frowining:',
        ':frowining:',
        ':person:'
    ],
    '🧟‍‍♂️': [
        'زومبي الرجل',
        ':man_zombie:',
        ':zombie:',
        ':man:'
    ],
    '🧟‍‍♀️': [
        'زومبي المرأة',
        ':woman_zombie:',
        ':zombie:',
        ':woman:'
    ],
    '🧟': [
        'زومبي شخصي',
        ':person_zombie:',
        ':zombie:',
        ':person:'
    ],
    '🚶{{skin_tone}}‍♂️': [
        'مشي الرجل',
        ':man_walking:',
        ':walking:',
        ':man:'
    ],
    '🚶{{skin_tone}}‍♀️': [
        'المشي النسائي',
        ':woman_walking:',
        ':walking:',
        ':woman:'
    ],
    '🚶{{skin_tone}}': [
        'المشي الشخصي',
        ':person_walking:',
        ':walking:',
        ':person:'
    ],
    '🧍{{skin_tone}}‍♂️': [
        'موقف الرجل',
        ':man_standing:',
        ':standing:',
        ':man:'
    ],
    '🧍{{skin_tone}}‍♀️': [
        'وضع المرأة',
        ':woman_standing:',
        ':standing:',
        ':woman:'
    ],
    '🧍{{skin_tone}}': [
        'الشخص مقيم',
        ':person_standing:',
        ':standing:',
        ':person:'
    ],
    '🧎{{skin_tone}}‍♂️': [
        'رجل الركبة',
        ':man_kneeling:',
        ':kneeling:',
        ':man:'
    ],
    '🧎{{skin_tone}}‍♀️': [
        'ركن المرأة',
        ':woman_kneeling:',
        ':kneeling:',
        ':woman:'
    ],
    '🧎{{skin_tone}}': [
        'ركن شخصي',
        ':person_kneeling:',
        ':kneeling:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦯': [
        'رجل مع قصب أبيض',
        ':man_with_white_cane:',
        ':white_cane:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦯': [
        'امرأة مع قصب أبيض',
        ':woman_with_white_cane:',
        ':white_cane:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦯': [
        'شخص مع قصب أبيض',
        ':person_with_white_cane:',
        ':white_cane:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦼': [
        'رجل في كرسي عجلة متحرك',
        ':man_in_motorized_wheelchair:',
        ':motorized_wheelchair:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦼': [
        'المرأة في الكرسي المتحرك',
        ':woman_in_motorized_wheelchair:',
        ':motorized_wheelchair:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦼': [
        'شخص في كرسي عجلة متحرك',
        ':person_in_motorized_wheelchair:',
        ':motorized_wheelchair:',
        ':person:'
    ],
    '👨{{skin_tone}}‍🦽': [
        'رجل في كرسي عجلة يدوي',
        ':man_manual_wheelchair:',
        ':manual_wheelchair:',
        ':man:'
    ],
    '👩{{skin_tone}}‍🦽': [
        'المرأة في كرسي العجلة اليدوي',
        ':woman_manual_wheelchair:',
        ':manual_wheelchair:',
        ':woman:'
    ],
    '🧑{{skin_tone}}‍🦽': [
        'شخص في كرسي عجلة يدوي',
        ':person_manual_wheelchair:',
        ':manual_wheelchair:',
        ':person:'
    ],
    '👯‍♂️': [
        'الرجال الذين يعانون من النعرات الغنية',
        ':men_with_bunny_hears:',
        ':bunny_ears:',
        ':man:'
    ],
    '👯‍♀️': [
        'النساء اللاتي لديهن إيرز مريح',
        ':women_with_bunny_hears:',
        ':bunny_ears:',
        ':woman:'
    ],
    '👯': [
        'الأشخاص الذين يعانون من النعرات الغريبة',
        ':people_with_bunny_hears:',
        ':bunny_ears:',
        ':person:'
    ],
    '🕴️{{skin_tone}}': [
        'شخص في تمرير بدلة',
        ':person_in_suit_levitating:',
        'رجل متحرك',
        'فتى غريب',
        'Walt Jabsco',
        'رجل في بدلة الأعمال التجارية',
        ':person:'
    ],
    '🧖{{skin_tone}}‍♂️': [
        'رجل في غرفة سباني',
        ':man_in_steamy_room:',
        ':steamy_room:',
        'رجل في السونا',
        ':man:'
    ],
    '🧖{{skin_tone}}‍♀️': [
        'امرأة في غرفة سباني',
        ':woman_in_steamy_room:',
        ':steamy_room:',
        'المرأة في السونا',
        ':woman:'
    ],
    '🧖{{skin_tone}}': [
        'شخص في غرفة سبيلي',
        ':person_in_steamy_room:',
        ':steamy_room:',
        'شخص في السونا',
        ':person:'
    ],
    '👫{{skin_tone}}': [
        'أيدي المرأة والرجل القابضة',
        ':woman_and_man_holding_hands:',
        ':holding_hands:',
        'زوج من الجنس الآخر',
        'زوج مستقيم',
        'اليد القابضة من الرجال والنساء',
        ':woman:'
    ],
    '👬{{skin_tone}}': [
        'الرجال يحتجزون الأيدي',
        ':holding_hands:',
        ':men_holding_hands:',
        'زوجة المثليين',
        'رجلان يحملان اليدين',
        ':man:'
    ],
    '👭{{skin_tone}}': [
        'النساء اللاتي يمتلكن الأيدي',
        ':holding_hands:',
        ':women_holding_hands:',
        'زوج من السحاقيات',
        'امرأتان تحملان الأيدي',
        ':woman:'
    ],
    '🧑‍🤝‍🧑': [
        'الأشخاص الذين يحملون الأيدي',
        ':holding_hands:',
        ':people_holding_hands:',
        'شخصين يحملان اليدين',
        'زوج شامل للجنسين',
        'زوج حيادي جنساني',
        'زوج غير متوافق مع نوع الجنس',
        ':person:'
    ],
    '👨‍👩‍👦': [
        'العائلة مع الأم والأب والأبن',
        ':family_with_mother_father_and_son:',
        'العائلة: رجل، امرأة، فتى'
    ],
    '👨‍👩‍👧': [
        'الأسرة مع الأم والأب والبنت',
        ':family_with_mother_father_and_daughter:',
        'العائلة: رجل، امرأة، فتاة'
    ],
    '👨‍👩‍👧‍👦': [
        'الأسرة مع الأم والأب والبنت والبنت',
        ':family_with_mother_father_son_and_daughter:',
        'الأسرة: رجل وامرأة وفتاة وفتى'
    ],
    '👨‍👩‍👦‍👦': [
        'العائلة مع الأم والأب والأبنين',
        ':family_with_mother_father_and_two_sons:',
        'العائلة: رجل، امرأة، فتى، فتى'
    ],
    '👨‍👩‍👧‍👧': [
        'الأسرة مع الأم والأب والبنتين',
        ':family_with_mother_father_and_two_daughters:',
        'الأسرة: رجل وامرأة وفتاة وفتاة'
    ],
    '👨‍👨‍👦': [
        'العائلة مع والدين و ابن',
        ':family_with_two_fathers_and_son:',
        'العائلة: رجل، رجل، فتى',
        ':man:'
    ],
    '👨‍👨‍👧': [
        'الأسرة مع والدين وابنتين',
        ':family_with_two_fathers_and_daughter:',
        'العائلة: رجل، رجل، فتاة',
        ':man:'
    ],
    '👨‍👨‍👧‍👦': [
        'عائلة مع والدين وابن وابنتين',
        ':family_with_two_fathers_son_and_daughter:',
        'العائلة: رجل ، فتاة ، فتى',
        ':man:'
    ],
    '👨‍👨‍👦‍👦': [
        'العائلة مع والدين وأبنائين',
        ':family_with_two_fathers_and_two_sons:',
        'العائلة: الرجال، الرجال، الفتيان، الفتيان',
        ':man:'
    ],
    '👨‍👨‍👧‍👧': [
        'الأسرة ذات الأب والبنتين',
        ':family_with_two_fathers_and_two_daughters:',
        'الأسرة: رجل، فتاة، فتاة',
        ':man:'
    ],
    '👩‍👩‍👦': [
        'العائلة مع أمهات وأبناء',
        ':family_with_two_mothers_and_son:',
        'العائلة: امرأة، امرأة، فتى',
        ':woman:'
    ],
    '👩‍👩‍👧': [
        'الأسرة مع أمتين وابنتين',
        ':family_with_two_mothers_and_daughter:',
        'الأسرة: امرأة، امرأة، فتاة',
        ':woman:'
    ],
    '👩‍👩‍👧‍👦': [
        'العائلة مع أمتين، ابن وابنتين',
        ':family_with_two_mothers_son_and_daughter:',
        'الأسرة: المرأة والمرأة والفتاة والفتيان',
        ':woman:'
    ],
    '👩‍👩‍👦‍👦': [
        'العائلة مع أمهات وأبنين',
        ':family_with_two_mothers_and_two_sons:',
        'العائلة: امرأة، امرأة، فتى، فتى',
        ':woman:'
    ],
    '👩‍👩‍👧‍👧': [
        'الأسرة مع أمتين وبناتين',
        ':family_with_two_mothers_and_two_daughters:',
        'الأسرة: امرأة، امرأة، فتاة، فتاة',
        ':woman:'
    ],
    '👨‍👦': [
        'العائلة مع الأب و الابن',
        ':family_with_father_and_son:',
        'العائلة: رجل، فتى',
        ':man:'
    ],
    '👨‍👧': [
        'العائلة مع الأب والبنت',
        ':family_with_father_and_daughter:',
        'الأسرة: رجل، فتاة',
        ':man:'
    ],
    '👨‍👦‍👦': [
        'العائلة مع الأب وولدين',
        ':family_with_father_and_two_sons:',
        'العائلة: رجل، فتى، فتى',
        ':man:'
    ],
    '👨‍👧‍👦': [
        'الأسرة مع الأب والأبن والبنت',
        ':family_with_father_son_and_daughter:',
        'العائلة: رجل، فتاة، فتى',
        ':man:'
    ],
    '👨‍👧‍👧': [
        'العائلة مع الأب والبنتين',
        ':family_with_father_and_two_daughters:',
        'الأسرة: رجل فتاة فتاة',
        ':man:'
    ],
    '👩‍👦': [
        'العائلة مع الأم و الابن',
        ':family_with_mother_and_son:',
        'العائلة: امرأة، فتى',
        ':woman:'
    ],
    '👩‍👧': [
        'الأسرة مع الأم والبنت',
        ':family_with_mother_and_daughter:',
        'الأسرة: امرأة، فتاة',
        ':woman:'
    ],
    '👩‍👦‍👦': [
        'الأسرة مع الأم وولدين',
        ':family_with_mother_and_two_sons:',
        'العائلة: امرأة، فتى، فتى',
        ':woman:'
    ],
    '👩‍👧‍👦': [
        'الأسرة مع الأم والبنت والبنت',
        ':family_with_mother_son_and_daughter:',
        'العائلة: امرأة، فتاة، فتى',
        ':woman:'
    ],
    '👩‍👧‍👧': [
        'الأسرة مع الأم والبنتين',
        ':family_with_mother_and_two_daughters:',
        'الأسرة: امرأة، فتاة، فتاة',
        ':woman:'
    ],
    '💑{{skin_tone}}': [
        'زوجين مع القلب',
        ':couple_with_heart:',
        'زوج في الحب',
        'نقل الزوج',
        'زوج حيادي جنساني',
        ':person:'
    ],
    '👩‍❤️‍👨': [
        'رجل وامرأة مع القلب',
        ':man_and_woman_with_heart:',
        'زوج في الحب',
        'نقل الزوج',
        'زوجين مع القلب'
    ],
    '👨‍❤️‍👨': [
        'رجلان مع القلب',
        ':two_men_with_heart:',
        'زوجين مع القلب: رجل',
        ':man:'
    ],
    '👩‍❤️‍👩': [
        'امرأتان لديهما قلب',
        ':two_women_with_heart:',
        'زوجين مع القلب: امرأة، امرأة',
        ':woman:'
    ],
    '💏{{skin_tone}}': [
        'كيس زوج',
        ':couple_kissing:',
        'قبيلة',
        'زوج محايد جنسانيا كيسنغ',
        ':person:'
    ],
    '👩‍❤️‍💋‍👨': [
        'رجل وامرأة كيس',
        ':man_and_woman_kissing:'
    ],
    '👨‍❤️‍💋‍👨': [
        'اثنان من الرجال يقبلون',
        ':two_men_kissing:',
        'رجل و رجل كيس',
        ':man:'
    ],
    '👩‍❤️‍💋‍👩': [
        'امرأتان تقومان بالقياس',
        ':two_women_kissing:',
        'المرأة والمرأة كيس',
        ':woman:'
    ],
    '💆{{skin_tone}}‍♂️': [
        'هجوم الرجل على رأس',
        ':man_getting_head_massage:',
        ':getting_head_massage:',
        ':man:'
    ],
    '💆{{skin_tone}}‍♀️': [
        'تعرض المرأة للهجوم',
        ':woman_getting_head_massage:',
        ':getting_head_massage:',
        ':woman:'
    ],
    '💆{{skin_tone}}': [
        'هجوم شخص على الرأس',
        ':person_getting_head_massage:',
        ':getting_head_massage:',
        ':person:'
    ],
    '💇{{skin_tone}}‍♂️': [
        'الرجل يتقطع الشعر',
        ':man_getting_haircut:',
        ':getting_haircut:',
        ':man:'
    ],
    '💇{{skin_tone}}‍♀️': [
        'المرأة تحصل على قطيع الشعر',
        ':woman_getting_haircut:',
        ':getting_haircut:',
        ':woman:'
    ],
    '💇{{skin_tone}}': [
        'شخص يحصل على قطع الشعر',
        ':person_getting_haircut:',
        ':getting_haircut:',
        ':person:'
    ],
    '🛌{{skin_tone}}': [
        'السكن النوم',
        'tired',
        ':sleeping_accommodation:',
        'Person in Bed',
        'Person Sleeping'
    ],
    '🛀{{skin_tone}}': [
        'Person Taking Bath',
        'Bathing',
        ':bath:',
        ':person_taking_bath:',
        'Hot Bath',
        'Person Taking a Bath',
        'Bath',
        'Shower',
        'Soap'
    ],
    '🧌': [
        'Troll',
        ':troll:'
    ],
    '👺': [
        'غبلن',
        ':goblin:',
        'الوجه الطويل الأنف',
        'قناع أحمر',
        'Tengu',
        'جبلن ياباني'
    ]
};
/*animals*/
emojis_language[lang][4] = {
    '😺': [
        'قطط مطهر',
        ':happy_cat:',
        ':smiling_cat:',
        '::):',
        'قطة سعيدة',
        'قطة ابتسامة',
        'وجه قطة سعيد',
        'وجه القطة المبتسمة مع القالب المفتوح'
    ],
    '😸': [
        'طحن القطط بالعين المبتسمة',
        ':grinning_cat:',
        '::D:',
        'قطط مطهر',
        'قطة سعيدة',
        'واجهة قطط المطهر'
    ],
    '😹': [
        'قطة مع دموع من الجاه',
        ':laughing_cat:',
        '::):',
        'قطة الدموع السعيدة',
        'القط الاصطناعي'
    ],
    '😻': [
        'قطه مبتسمة بالعين القلبية',
        ':heart_eyes_cat:',
        ':*.*:',
        'قطة العيون القلبية',
        'القطط المحمولة',
        'وجه القطة المبتسمة بالعين على شكل القلب'
    ],
    '😼': [
        'قطة مع ابتسامة جافة',
        ':cat_with_wry_smile:',
        'قطط الاستكماش',
        'وجه القطة الممتعة',
        'وجه القطة مع الابتسامة الجافة'
    ],
    '😽': [
        'كيس القط',
        ':kissing_cat:',
        '::*:',
        'كيس وجه القطة',
        'كيس وجه القطة بالعيون المغلقة'
    ],
    '🙀': [
        'قطة الوزن',
        ':weary_cat:',
        '::O:',
        'قطط مهجورة',
        'قطه صورية',
        'شاشة وجه القطة في الخوف',
        'وجه القطط الزاحفة'
    ],
    '😿': [
        'كرات القط',
        ':crying_cat:',
        '::(:',
        'قطة حزينة',
        'وجه البكاء للقطة'
    ],
    '😾': [
        'قطه اللمس',
        ':pouting_cat:',
        'Grumpy Cat',
        'وجه القطة المسطحة'
    ],
    '🙈': [
        'انظر القرد الشرير',
        'قرد',
        ':see-no-evil_mokey:',
        ':see_no_evil_mokey:',
        ':monkey:',
        'ميزارو',
        'غطاء عيون القرد'
    ],
    '🙉': [
        'القرد الشرير',
        'قرد',
        ':hear-no-evil_monkey:',
        ':hear_no_evil_monkey:',
        ':monkey:',
        'Kikazaru',
        'غطاء القرد'
    ],
    '🙊': [
        'القرد الشرير',
        'قرد',
        ':speak-no-evil_monkey:',
        ':speak_no_evil_monkey:',
        ':monkey:',
        'إيوازارو',
        'القرد يغطي الفم',
        'لا يتحدث'
    ],
    '🐵': [
        'وجه القرد',
        ':monkey_face:',
        'قرد',
        'رأس القرد'
    ],
    '🐒': [
        'قرد',
        ':monkey:',
        'قرد شيكي'
    ],
    '🦍': [
        'Gorilla',
        ':gorilla:'
    ],
    '🐶': [
        'وجه الكلب',
        ':dog_face:',
        'كلب',
        'دمية'
    ],
    '🐕': [
        'كلب',
        ':dog:',
        'Doggo',
        'Akita Inu'
    ],
    '🦮': [
        'رؤية كلب العين',
        ':seeing_eye_dog:',
        'دليل الكلب'
    ],
    '🐕‍🦺': [
        'كلب الخدمة',
        ':service_dog:'
    ],
    '🐩': [
        'البودل',
        ':poodle:',
        'كلب',
        'قوالب مصغرة',
        'البودلة القياسية',
        'بودر اللعبة'
    ],
    '🐺': [
        'ذئب',
        ':wolf:',
        'وجه الذئب',
        ':gray:',
        ':grey:'
    ],
    '🦊': [
        'ثعلب',
        ':fox:',
        'وجه الثعلب',
        ':orange:'
    ],
    '🦝': [
        'راسكون',
        ':raccoon:'
    ],
    '🐱': [
        'وجه القطة',
        ':cat_face:',
        ':3',
        'كريتس',
        'كيتي'
    ],
    '🐈': [
        'قطط',
        ':cat:',
        'قطة منزلية',
        'السنور',
        'هيوسيات'
    ],
    '🐈‍⬛': [
        'قطة سوداء',
        ':black_cat:',
        ':black:'
    ],
    '🦁': [
        'الأسد',
        ':lion:',
        'وجه الأسد'
    ],
    '🐯': [
        'وجه النمر',
        ':tiger_face:',
        'نمر لطيف'
    ],
    '🐅': [
        'النمر',
        ':tiger:',
        'نمر البنغال'
    ],
    '🐆': [
        'Leopard',
        ':leopard:',
        'البارد الأفريقي',
        'Jaguar'
    ],
    '🐴': [
        'وجه الحصان',
        ':horse_face:',
        'رأس الحصان'
    ],
    '🐎': [
        'حصان',
        ':horse:',
        'حصان غالوبينغ',
        'حصان السباق'
    ],
    '🦄': [
        'يونيكورن',
        ':unicorn:',
        'وجه يونيكورن'
    ],
    '🦓': [
        'Zebra',
        ':zebra:',
        'وجه زيبرا',
        ':white:',
        ':black:'
    ],
    '🦌': [
        'الغزال',
        ':deer:',
        'بوك',
        'رنة',
        'Stag'
    ],
    '🐮': [
        'وجه البقرة',
        ':cow_face:',
        'بقرة',
        'بقرة سعيدة'
    ],
    '🐂': [
        'أوكس',
        ':ox:',
        'سبائك',
        'قنبلة',
        'أكسين',
        'أكثر'
    ],
    '🐃': [
        'مكافأة المياه',
        ':water_buffalo:',
        'بافالو',
        'مكافأة المياه المنزلية'
    ],
    '🐄': [
        'بقرة',
        ':cow:',
        'بقرة الألبان'
    ],
    '🐷': [
        'وجه الخنزير',
        ':pig_fase:',
        'خنزير',
        'رأس الخنزير',
        ':pink:'
    ],
    '🐖': [
        'خنزير',
        ':pig:',
        'خندق',
        'Sow',
        ':pink:'
    ],
    '🐗': [
        'بوار',
        ':boar:',
        'وارثوغ',
        'درع بري',
        'خنزير بري'
    ],
    '🐽': [
        'خنزير الأنف',
        ':pig_nose:'
    ],
    '🐏': [
        'Ram',
        ':ram:',
        'خروف'
    ],
    '🐑': [
        'Ewe',
        ':ewe:',
        'Lamb',
        'خروف'
    ],
    '🐐': [
        'عنزة',
        ':goat:'
    ],
    '🐪': [
        'جمال',
        ':camel:',
        'الجمال العربي',
        'الجمل المسقط',
        'ضرب الجمل'
    ],
    '🐫': [
        'جمال قفز مزدوج',
        ':two-hump_camel:',
        ':two_hump_camel:',
        'الجمال الآسيوي',
        'الجمل البكتيري'
    ],
    '🦙': [
        'Llama',
        ':llama:',
        'Alpaca'
    ],
    '🦒': [
        'Giraffe',
        ':giraffe:',
        'Giraffe Face'
    ],
    '🐘': [
        'فيل',
        ':elephant:'
    ],
    '🦏': [
        'Rhinoceros',
        ':rhinoceros:',
        'Rhino'
    ],
    '🦛': [
        'Hippopotamus',
        ':hippopotamus:',
        'Hippo'
    ],
    '🐭': [
        'وجه الفأرة',
        ':mouse_face:',
        'الفأرة'
    ],
    '🐁': [
        'الفأرة',
        ':mouse:',
        'دوردوس',
        'القارئ',
        'الجمال'
    ],
    '🐀': [
        'الفئران',
        ':rat:',
        'القارئ'
    ],
    '🐹': [
        'هامستر',
        ':hamster:',
        'وجه الحماس'
    ],
    '🐰': [
        'وجه الأرنب',
        ':rabbit_face:',
        'عيد الفصح'
    ],
    '🐇': [
        'أرنب',
        'Bunny',
        ':rabbit:',
        'رنب مجنون'
    ],
    '🐿️': [
        'شيبمونك',
        ':chipmunk:',
        'النجوم'
    ],
    '🦔': [
        'هيدجيهوج',
        ':hedgehog:'
    ],
    '🦇': [
        'الخفاش',
        ':bat:',
        'باتمان',
        ':black:'
    ],
    '🐻': [
        'الدب',
        ':bear:',
        'وجه الدب',
        'دب تيدي',
        ':brown:'
    ],
    '🐨': [
        'كوالا',
        ':koala:',
        'وجه كوالا'
    ],
    '🐼': [
        'باندا',
        ':panda:',
        'وجه الباندا'
    ],
    '🦘': [
        'كانغارو',
        ':kangaroo:',
        'روي'
    ],
    '🦡': [
        'الشارق',
        ':badger:'
    ],
    '🦃': [
        'تركيا',
        ':turkey:',
        'تركيا عيد الشكر',
        'تركيا الجامحة'
    ],
    '🐔': [
        'دجاج',
        ':chicken:',
        'Hen'
    ],
    '🐓': [
        'ساحة',
        ':cock:',
        'Rooster',
        'الجيب'
    ],
    '🐣': [
        'قفزة الرصاص',
        ':hatching_chick:',
        'دجاج طفل',
        'تشويش',
        ':yellow:'
    ],
    '🐤': [
        'شيك الطفل',
        ':baby_chick:',
        'الطائر الأصفر',
        ':yellow:'
    ],
    '🐥': [
        'الصغار المواجهة الأمامية',
        ':front_baby_chick:',
        'شيك الطفل',
        'الدرج الدائم',
        ':yellow:'
    ],
    '🐦': [
        'الطيور',
        ':bird:'
    ],
    '🐧': [
        'Penguin',
        ':penguin:'
    ],
    '🕊️': [
        'حمامة',
        ':Dove:',
        'ضربة السلام',
        ':white:'
    ],
    '🦅': [
        'نسر',
        ':Eagle:',
        'نسر بلد'
    ],
    '🦆': [
        'دك',
        ':Duck:'
    ],
    '🦢': [
        'سواني',
        ':swan:',
        ':white:'
    ],
    '🦉': [
        'أوول',
        ':owl:',
        ':brown:'
    ],
    '🦚': [
        'الطاووك',
        ':peacock:'
    ],
    '🦜': [
        'الببغاء',
        ':parrot:'
    ],
    '🐸': [
        'فطيرة',
        ':frog:',
        'تود',
        'الوجه الحطمي',
        ':green:'
    ],
    '🐊': [
        'التدوين',
        ':crocodile:',
        'النجوم',
        'كروك',
        ':green:'
    ],
    '🐢': [
        'السلاحف',
        ':turtle:',
        'Tortoise',
        ':green:'
    ],
    '🦎': [
        'المعالج',
        ':lizard:',
        'جيكو',
        ':green:'
    ],
    '🐍': [
        'ثعبان',
        ':snake:',
        'سيرفر'
    ],
    '🐲': [
        'وجه التنين',
        ':dragon_face:',
        'رأس التنين'
    ],
    '🐉': [
        'تنين',
        ':dragon:'
    ],
    '🦕': [
        'سوروبود',
        ':sauropod:',
        'Brachiosaurus',
        'Brontosaurus',
        'Dinosaur'
    ],
    '🦖': [
        'T-Rex',
        ':t-rex:',
        ':t_rex:',
        'Tyrannosaurus Rex'
    ],
    '🐳': [
        'تزوج الحوت',
        ':spouting_whale:',
        'حيتان لطيفة'
    ],
    '🐋': [
        'الحوت',
        ':whale:'
    ],
    '🐬': [
        'دولفين',
        ':dolphin:'
    ],
    '🐟': [
        'سمكة',
        ':fish:',
        'سمكة المياه العذبة'
    ],
    '🐠': [
        'السمك المداري',
        ':tropical_fish:',
        'سمكة',
        'سمك أزرق أصفر'
    ],
    '🐡': [
        'سمك الزهور',
        ':blowfish:',
        'Fugu',
        'سمك الفول'
    ],
    '🦈': [
        'القرش',
        ':shark:',
        'القرش الأبيض العظيم'
    ],
    '🐙': [
        'أوكتوبوس',
        ':octopus:'
    ],
    '🐚': [
        'قذيفة حلزونية',
        ':spiral_shell:',
        'موسيقى',
        'قذيفة'
    ],
    '🐌': [
        'حلزون',
        ':snail:',
        'سبيكة',
        'سيل الحديقة'
    ],
    '🦋': [
        'الفراشة',
        ':butterfly:'
    ],
    '🐛': [
        'خلل',
        ':bug:',
        'كاتربلر',
        'حشرة'
    ],
    '🐜': [
        'Ant',
        ':ant:',
        'خلل',
        'حشرة'
    ],
    '🐝': [
        'العسل',
        ':honeybee:',
        'النحل',
        'Bumblebee',
        ':yellow:',
        ':black:'
    ],
    '🐞': [
        'بيتة سيدة',
        ':lady_beetle:',
        'Ladybird',
        'Ladybug',
        'خلل'
    ],
    '🦗': [
        'الكريكيت',
        ':cricket:',
        'غريشوبر'
    ],
    '🕷️': [
        'العنكبوت',
        ':spider:'
    ],
    '🦂': [
        'العقرب',
        ':scorpion:'
    ],
    '🦟': [
        'البعوض',
        ':mosquito:',
        ':black:'
    ],
    '🦀': [
        'سرطان',
        ':crab:',
        ':red:'
    ],
    '🦞': [
        'اللوحات',
        ':lobster:'
    ],
    '🦐': [
        'كريم',
        ':shrimp:',
        'Prawn'
    ],
    '🦑': [
        'فتحة',
        ':squid:'
    ],
    '🦧': [
        'Orangutan',
        ':orangutan:'
    ],
    '🦥': [
        'خياش',
        ':sloth:'
    ],
    '🦦': [
        'Otter',
        ':otter:'
    ],
    '🦨': [
        'سكونك',
        ':skunk:'
    ],
    '🦬': [
        'بيسون',
        ':bison:'
    ],
    '🦣': [
        'ماموث',
        ':mammoth:',
        ':brown:'
    ],
    '🦫': [
        'بيفر',
        ':beaver:'
    ],
    '🐻‍❄️': [
        'دب قطبي',
        ':polar_bear:',
        ':white:'
    ],
    '🦤': [
        'Dodo',
        ':dodo:'
    ],
    '🦭': [
        'ختم',
        ':seal:'
    ],
    '🪲': [
        'النحل',
        ':beetle:'
    ],
    '🪳': [
        'كوكروش',
        ':cockroach:'
    ],
    '🪰': [
        'طيران',
        ':fly:'
    ],
    '🪱': [
        'دودة',
        ':worm:'
    ],
    '🦩': [
        'فلامينجو',
        ':flamingo:'
    ],
    '🪹': [
        'عش فارغ',
        ':empty_nest:',
        'الطيور',
        'الرئيسية'
    ],
    '🪺': [
        'العش بالبيض',
        ':nest_with_eggs:',
        'الطيور',
        'الرئيسية'
    ]
};
/*symbols*/
emojis_language[lang][5] = {
    '💘': [
        'قلب مع السهم',
        ':heart_with_arrow:',
        'السهم الكبيدي',
        'Lovestruck',
        ':pink:'
    ],
    '💝': [
        'قلب مع الشريط',
        ':heart_with_ribbon:',
        'صندوق الشوكولاتة',
        'صندوق الهدايا',
        'قلب الهدية',
        ':red:'
    ],
    '💖': [
        'Sparkling Heart',
        ':sparkling_heart:',
        'قلب البانكلي',
        'قلب صارخ',
        'قلب النجوم',
        ':pink:'
    ],
    '💗': [
        'القلب المتنامي',
        ':growing_heart:',
        'قلب متعدد',
        'القلب الثلاثي',
        ':pink:'
    ],
    '💓': [
        'ضرب القلب',
        ':beating_heart:',
        'منبه القلب',
        'Heartbeat',
        'قلب الواي فاي',
        ':pink:'
    ],
    '💞': [
        'القلب الدائر',
        ':revolving_hearts:',
        'قلبان',
        ':pink:'
    ],
    '💕': [
        'قلبان',
        ':two_hearts:',
        'قلوب صغيرة',
        'قلبان ورديان',
        ':pink:'
    ],
    '💟': [
        'زخرفة القلب',
        ':heart_decoration:',
        ':purple:'
    ],
    '❣️': [
        'تعجب القلب',
        ':heart_exclamation:',
        'القلب فوق الروبوت',
        'قلب أحمر كعلامة تعجب',
        'زينة علامات تعجب القلب الثقيلة',
        ':red:'
    ],
    '💔': [
        'قلب محطم',
        ':broken_heart:',
        'كسر القلب',
        'بركنه',
        'كسر القلب',
        ':red:'
    ],
    '❤️‍🩹': [
        'Mending Heart',
        ':mending_heart:',
        'Bandaged Heart',
        'Healing Heart',
        'Unbroken Heart',
        ':red:'
    ],
    '❤️‍🔥': [
        'Heart on Fire',
        ':heart_on_fire:',
        ':red:'
    ],
    '❤️': [
        'أنا أحبك',
        ':red_heart:',
        'قلب أحمر',
        'قلب',
        'قلب الحب',
        'قلب أحمر',
        ':red:'
    ],
    '🧡': [
        'القلب البرتقالي',
        ':orange_heart:',
        'أنا أحبك',
        ':orange:'
    ],
    '💛': [
        'قلب أصفر',
        ':yellow_heart:',
        '#1 BF Snapchat',
        'قلب الذهب',
        'أنا أحبك',
        ':yellow:'
    ],
    '💚': [
        'قلب أخضر',
        ':green_heart:',
        'قلب الجيب',
        'أنا أحبك',
        ':green:'
    ],
    '💙': [
        'القلب الأزرق',
        ':blue_heart:',
        'أنا أحبك',
        ':blue:'
    ],
    '💜': [
        'القلب الأرجواني',
        ':purple_heart:',
        'أنا أحبك',
        ':purple:'
    ],
    '🖤': [
        'قلب أسود',
        ':black_heart:',
        'قلب الظلام',
        'أنا أحبك',
        ':black:'
    ],
    '🤍': [
        'قلب أبيض',
        ':white_heart:',
        'أنا أحبك',
        ':white:'
    ],
    '🤎': [
        'قلب بني',
        ':brown_heart:',
        'أنا أحبك',
        ':brown:'
    ],
    //"🩷": ["Pink Heart", ":pink_heart:", "I Love You", ":pink:"],
    //"🩵": ["Light Blue Heart", ":lightblue_heart:", "I Love You", ":blue:"],
    //"🩶": ["Grey Heart","Gray Heart", ":grey_heart:",":gray_heart:", "I Love You", ":gray:", ":grey:"],
    '💯': [
        '100 نقطة',
        ':hundred_points:',
        '100',
        '%',
        'احتفظ بها 100',
        'نتيجة ممتازة',
        'رمز المائة من النقاط'
    ],
    '💬': [
        'بالون الكلام',
        ':speech_balloon:',
        'فقاعات الدردشة',
        'فقاعات الكلام',
        ':white:'
    ],
    '💭': [
        'فكر بالون',
        ':thought_balloon:',
        'فقاعات التفكير',
        'فقاعات الفقاعات',
        ':white:'
    ],
    '💤': [
        'زتز',
        ':zzz:',
        'وقت النوم',
        'الصنبور',
        'النوم',
        'لافتة النوم',
        'رمز النوم'
    ],
    '♠': [
        'بدلة المسافة',
        ':spade_suit:',
        'Spades',
        'Black Spade Suit'
    ],
    '♥': [
        'بدلة القلب',
        ':heart_suit:',
        'بطاقة مع القلب',
        'قلوب',
        'بدلة القلب الأسود'
    ],
    '♦': [
        'بدلة الماس',
        ':diamond_suit:',
        'الماس',
        'بدلة الماس الأسود'
    ],
    '♣': [
        'بدلة النادي',
        ':club_suit:',
        'النوادي',
        'بدلة النادي الأسود'
    ],
    '🏧': [
        'علامة الصراف الآلي',
        ':atm_sign:',
        'صراف',
        'آلة التلال الآلية',
        ':blue:'
    ],
    '🎧': [
        'سماعة الرأس',
        ':headphone:',
        'إيرفون',
        'أيبود',
        'سماعات'
    ],
    '🎵': [
        'ملاحظة موسيقية',
        ':musical_note:',
        'ثامنا- اقتران الملاحظات الثامنة',
        'إقران الكوافر المشعور',
        'ملاحظة موسيقية'
    ],
    '🎶': [
        'ملاحظات موسيقية',
        ':musical_notes:',
        'الموسيقى',
        'ملاحظات الموسيقى',
        'الغناء',
        'ملاحظات موسيقية متعددة'
    ],
    '🔔': [
        'جرس',
        ':bell:',
        'جرس الحرية',
        'Ringer',
        'جرس الزفاف',
        ':yellow:'
    ],
    '🔕': [
        'جرس مع Slash',
        ':bell_with_slash:',
        'الإشعارات',
        'الرنين معطل',
        'جرس مكتم',
        'جرس مع جرة الإلغاء',
        ':yellow:'
    ],
    '🔈': [
        'مستوى صوت منخفض',
        ':speaker_low_volum:',
        'حجم',
        'مكبر'
    ],
    '🔉': [
        'صوت متوسط السماعة',
        ':speaker_medium_volume:',
        'تقليل مستوى الصوت',
        'مكبر الصوت مع حجم متوسط',
        'مكبر الصوت مع موجة صوت واحدة'
    ],
    '🔊': [
        'مستوى صوت عال لمكبر الصوت',
        ':speaker_high_volume:',
        'زيادة مستوى الصوت',
        'مكبر الصوت مع ثلاث موجات صوتية'
    ],
    '🔇': [
        'مكبر الصوت',
        ':muted_speaker:',
        'كتم الصوت',
        'مكبر الصوت مع جرة الإلغاء'
    ],
    '📢': [
        'Loudspeaker',
        ':loudspeaker:',
        'إعلان',
        'نظام PAS',
        'لود متكلم العنوان العام'
    ],
    '⛔': [
        'لا يوجد مدخل',
        ':no_entry:',
        ':red:'
    ],
    '🚫': [
        'محظور',
        ':prohibited:',
        'محظور',
        'الدائرة الخلفية',
        'لا',
        'دائرة حمراء متقاطعة',
        'مقيد',
        'لا يوجد تسجيل دخول',
        ':red:'
    ],
    '🚳': [
        'لا توجد دراجات',
        ':no_bicycles:',
        'لا يوجد لافتة رماحين',
        ':red:',
        ':black:'
    ],
    '🚭': [
        'لا يوجد تدخين',
        ':no_smoking:',
        'لا يوجد رمز للتدخين',
        ':red:',
        ':black:'
    ],
    '🚯': [
        'لا يوجد انتحال',
        ':no_littering:',
        'لا توجد رموز',
        ':red:',
        ':black:'
    ],
    '🚱': [
        'مياه غير صالحة للشرب',
        ':non-potable_water:',
        ':non_potable_water:',
        'لا يوجد ماء',
        'لا يوجد ماء شرب',
        'رمز المياه غير الصالحة للشرب',
        ':red:',
        ':black:'
    ],
    '🚷': [
        'لا يوجد مشاة',
        ':no_pedestrians:',
        'لا يوجد أشخاص',
        'لا مشي',
        ':red:',
        ':black:'
    ],
    '🔞': [
        'لا يوجد شخص دون الثامنة عشرة',
        ':no_one_under_18:',
        'NSFW',
        'لا يوجد واحد تحت ثمانية عشر رمز',
        '18',
        ':red:',
        ':black:'
    ],
    '📵': [
        'لا توجد هواتف محمولة',
        ':no_mobile_phones:',
        'لا توجد هواتف خلوية',
        'لا توجد هواتف',
        'لا توجد هواتف ذكية',
        ':red:',
        ':black:'
    ],
    '☢️': [
        'Radioactive',
        ':radioactive:',
        'رمز الإشعاع الدولي',
        'نووي',
        'لافتة مشعة',
        ':orange:'
    ],
    '☣️': [
        'المخاطر الحيوية',
        ':biohazard:',
        'علامة المخاطر الحيوية',
        ':orange:'
    ],
    '⬆️': [
        'زر السهم للأعلى',
        ':up_arrow_button:',
        'نقاط السهم للأعلى',
        'السهم الأسود لأعلى',
        ':blue:'
    ],
    '↗️': [
        'زر سهم أعلى اليمين',
        ':up-right_arrow_button:',
        ':up_right_arrow_button:',
        'سهم دماغوني لأعلى اليمين',
        'السهم الشمالي الشرقي',
        ':blue:'
    ],
    '➡️': [
        'زر السهم الأيمن',
        ':right_arrow_button:',
        'نقطة السهم إلى اليمين',
        'السهم الأيمن الأسود',
        ':blue:'
    ],
    '↘️': [
        'زر السهم أسفل اليمين',
        ':down-right_arrow_button:',
        ':down_right_arrow_button:',
        'السهم أسفل اليمين',
        'سهم جنوب شرق',
        ':blue:'
    ],
    '⬇️': [
        'زر السهم لأسفل',
        ':down_arrow_button:',
        'نقاط السهم للأسفل',
        'سهم أسفل أسفل',
        ':blue:'
    ],
    '↙️': [
        'زر السهم أسفل اليسار',
        ':down-left_arrow_button:',
        ':down_left_arrow_button:',
        'سهم أسفل أسفل اليسار',
        'السهم الجنوبي الغربي',
        ':blue:'
    ],
    '⬅️': [
        'زر السهم الأيسر',
        ':left_arrow_button:',
        'نقاط السهم لليسار',
        'السهم الأسود لليسار',
        ':blue:'
    ],
    '↖️': [
        'زر سهم أعلى اليسار',
        ':up-left_arrow_button:',
        ':up_left_arrow_button:',
        'السهم الرأسي لأعلى اليسار',
        'السهم الشمالي الغربي',
        ':blue:'
    ],
    '↕️': [
        'زر السهم لأسفل',
        ':up-down_arrow_button:',
        ':up_down_arrow_button:',
        'الأسهم العمودية',
        'سهم أعلى للأسفل',
        ':blue:'
    ],
    '↔️': [
        'زر السهم لليسار واليمين',
        ':left-right_arrow_button:',
        ':left_right_arrow_button:',
        'الأسهم الأفقية',
        'الأسهم الجانبية',
        'سهم يسار اليمين',
        ':blue:'
    ],
    '↩️': [
        'زر السهم الأيمن ينحني الزر الأيسر',
        ':right_arrow_curving_left_button:',
        'رد البريد الإلكتروني',
        'سهم منحنى اليسار',
        'سهم لليسار مع هوك',
        ':blue:'
    ],
    '↪️': [
        'الزر الأيمن للسهم الأيسر',
        ':left_arrow_curving_right_button:',
        'إعادة إرسال البريد',
        'سهم منحنى اليمين',
        'سهم يمين مع هوك',
        ':blue:'
    ],
    '⤴️': [
        'زر السهم الأيمن ينحنى',
        ':right_arrow_curving_up_button:',
        'السهم يشير إلى اليمين ثم ينحسر للأعلى',
        ':blue:'
    ],
    '⤵️': [
        'زر منخفض السهم الأيمن',
        ':right_arrow_curving_down_button:',
        'سهم منحنى لأسفل',
        'السهم يشير إلى اليمين ثم ينحسر إلى الأسفل',
        ':blue:'
    ],
    '🔃': [
        'زر الأسهم العمودية الحكيمة ساعة',
        ':clockwise_vertical_button:',
        'حكيمة الوقت لأسفل وأعلى فتح أسهم الدائرة',
        ':blue:'
    ],
    '🔄': [
        'زر الأسهم المعادية لعقارب الساعة',
        ':counterclockwise_button:',
        'تحديث',
        'تدوير',
        'تبديل',
        'الأسهم المضادة للساعة',
        'أسفل أسفل وأعلى فتح أسهم الدائرة',
        ':blue:'
    ],
    '🔙': [
        'سهم خلفي',
        ':back_arrow:',
        'الرجوع',
        'العودة مع السهم لليسار فوق',
        ':black:'
    ],
    '🔚': [
        'إنهاء السهم',
        ':end_arrow:',
        'نهاية',
        'نهاية بالسهم لليسار فوق',
        ':black:'
    ],
    '🔛': [
        'على السهم!',
        ':on_arrow:',
        'تشغيل',
        'تشغيل مع علامة التعجب مع السهم اليساري الأيمن فوق',
        ':black:'
    ],
    '🔜': [
        'سهم قريب',
        ':soon_arrow:',
        'قريباً',
        'قريباً مع السهم الأيمن فوق',
        ':black:'
    ],
    '🔝': [
        'أعلى سهم',
        ':top_arrow:',
        'أعلى',
        'أعلى مع السهم للأعلى',
        ':black:'
    ],
    '🛐': [
        'مكان العبادة',
        ':place_of_worship:',
        'البناء الديني',
        ':purple:'
    ],
    '⚛️': [
        'رمز Atom',
        ':atom_symbol:',
        ':purple:'
    ],
    '🕉️': [
        'رمز Om',
        ':om_symbol:',
        'أوم',
        'Aumkara',
        'Omkara',
        'Pranava',
        ':purple:'
    ],
    '✡️': [
        'نجم ديفيد',
        ':star_of_david:',
        'ماجين ديفيد',
        ':purple:'
    ],
    '☸️': [
        'عجلة الدرما',
        ':wheel_of_dharma:',
        'مرحبا',
        ':purple:'
    ],
    '☯️': [
        'Yin Yang',
        ':yin_yang:',
        ':purple:'
    ],
    '✝️': [
        'الصليب اللاتيني',
        ':latin_cross:',
        'الصليب المسيحي',
        ':purple:'
    ],
    '☦️': [
        'الصليب الأرثوذكسي',
        ':orthodox_cross:',
        ':purple:'
    ],
    '☪️': [
        'النجوم والهلال',
        ':star_and_crescent:',
        ':purple:'
    ],
    '☮️': [
        'رمز السلام',
        ':peace:',
        'لافتة السلام',
        ':purple:'
    ],
    '🕎': [
        'المنورة',
        ':menorah:',
        'Candelabrum',
        'شموع',
        'شانوكيا',
        'المنورة',
        'مينورا مع تسعة فروع',
        ':purple:'
    ],
    '🔯': [
        'نجوم منقوطة من ست نقاط',
        ':dotted_six-pointed_star:',
        ':dotted_six_pointed_star:',
        'ستة نجوم ذات نقطة متوسطة',
        ':purple:'
    ],
    //"🪯": ["Khanda", ":khanda:", "Sikhism", ":purple:"],
    '♈': [
        'أريز',
        ':aries:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♉': [
        'Taurus',
        ':taurus:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♊': [
        'Gemini',
        ':gemini:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♋': [
        'السرطان',
        ':cancer:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♌': [
        'ليو',
        ':leo:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♍': [
        'الخيرجو',
        ':virgo:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♎': [
        'المكتبة',
        ':libra:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♏': [
        'العقرب',
        ':scorpio:',
        ':zodiac:',
        'الكوربيوس',
        'زودياك',
        ':purple:'
    ],
    '♐': [
        'Sagittarius',
        ':sagittarius:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♑': [
        'الكابريكورن',
        ':capricorn:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♒': [
        'أكاريوس',
        ':aquarius:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '♓': [
        'Pisces',
        ':pisces:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '⛎': [
        'أوفيوشوس',
        ':ophiuchus:',
        ':zodiac:',
        'زودياك',
        ':purple:'
    ],
    '⏭️': [
        'تخطي الرمز الأمامي',
        'المثلث المزدوج ذو النقاط السوداء مع الشريط العمودي',
        ':skip_forward_button:',
        'زر المسار التالي',
        ':blue:'
    ],
    '⏮️': [
        'تخطي الرمز الخلفي',
        'مثلث مزدوج للنقاط اليسرى السوداء مع شريط عمودي',
        ':skip_backward_button:',
        'زر المسار الأخير',
        'المسار السابق',
        ':blue:'
    ],
    '⏯️': [
        'تشغيل أو إيقاف زر',
        'مثلث النقاط السوداء مع شريط عمودي مزدوج',
        ':play_button:',
        ':pause_button:',
        ':play_or_pause_button:',
        'تشغيل الرمز',
        'إيقاف الرمز المؤقت',
        ':blue:'
    ],
    '🔀': [
        'تبديل زر المسارات',
        ':shuffle_tracks_button:',
        'الأسهم اليمينية الملطخة',
        ':blue:'
    ],
    '🔁': [
        'زر التكرار',
        ':repeat_button:',
        'رمز الحلقة',
        'تغريدة',
        'حكيمة الساعة الأيمن و يسار الأسهم المفتوحة الدائرة',
        ':blue:'
    ],
    '🔂': [
        'تكرار الزر الفردي',
        ':repeat_single_button:',
        'أسهم دائرة مع رقم 1',
        'التكرار مرة واحدة الرمز',
        'تكرار رمز المسار الفردي',
        'حكيمة الساعة اليمين و اليسار أسهم دائرة مفتوحة مع تراكب واحد دائري',
        ':blue:'
    ],
    '▶️': [
        'زر التشغيل',
        ':play_button:',
        'المثلث الأيمن',
        'مثلث النقاط اليمنى',
        'مثلث النقاط الأيمن السوداء',
        ':blue:'
    ],
    '◀️': [
        'زر عكسي',
        ':reverse_button:',
        'المثلث الأيسر',
        'مثلث النقاط اليسرى',
        'مثلث النقاط اليسرى السوداء',
        ':blue:'
    ],
    '🔼': [
        'زر الارتقاء',
        ':upwards_button:',
        'مثلث أعلى',
        'مثلث آخر النقاط',
        'مثلث أحمر صغير مشار إليه أعلى',
        ':blue:'
    ],
    '🔽': [
        'زر الهبوط',
        ':downwards_button:',
        'مثلث أسفل',
        'المثلث الذي يشير إلى الأسفل',
        'مثلث أحمر صغير يشير إلى الأسفل',
        ':blue:'
    ],
    '⏩': [
        'زر التقدم السريع',
        ':fast-forward_button:',
        ':fast_forward_button:',
        'التقدم السريع',
        'رمز ارسال سريع',
        'المثلث المزدوج ذو النقاط السوداء',
        ':blue:'
    ],
    '⏪': [
        'Fast Reverse Button',
        ':fast_reverse_button:',
        'Rewind',
        'رموز الإرجاع',
        'المثلث المزدوج النقاط اليسرى السوداء',
        ':blue:'
    ],
    '⏫': [
        'زر رفع سريع',
        ':fast_up_button:',
        'المثلث المزدوج الذي يشير إلى الأعلى',
        'المثلث المزدوج للنقاط السوداء',
        ':blue:'
    ],
    '⏬': [
        'زر اسفل سريع',
        ':fast_down_button:',
        'المثلث المزدوج الذي يشير إلى الأسفل',
        'المثلث المزدوج للنقاط السوداء',
        ':blue:'
    ],
    '⏹️': [
        'زر التوقف',
        ':stop_button:',
        'توقف',
        'إيقاف الرمز',
        'ساحة سوداء للإيقاف',
        ':blue:'
    ],
    '⏏️': [
        'إخراج الزر',
        ':eject_button:',
        'Eject Symbol',
        ':blue:'
    ],
    '🎦': [
        'سينما',
        ':cinema_button:',
        'شاشة السينما',
        'أفلام',
        'فيلم',
        'رمز السينما',
        'التسجيل',
        ':blue:'
    ],
    '📶': [
        'شريط هوائي',
        ':antenna_bars_button:',
        'أشرطة الاستقبال',
        'قوة الإشارة',
        'Stairs',
        'رمز قوة الإشارة',
        'هوائي مع الحانات',
        ':blue:'
    ],
    '✖️': [
        'ضرب',
        ':multiply:',
        'أوقات',
        'رمز الضرب',
        'الضرب الثقيل X',
        ':black:'
    ],
    '➕': [
        'زائد',
        ':plus:',
        'رمز إضافي',
        'علامة ثقيل زائدا',
        ':black:'
    ],
    '➖': [
        'Minus',
        ':minus:',
        'Minus Symbol',
        'توقيع ناقص الثقيل',
        ':black:'
    ],
    '➗': [
        'القسمة',
        ':divide:',
        'رمز الشعبة',
        'علامة الشعبة الثقيلة',
        ':black:'
    ],
    '🟰': [
        'علامة المساواة الثقيلة',
        ':heavy_equals_sign:',
        'يساوي',
        'النتيجة',
        ':black:'
    ],
    '♾️': [
        'اللانهائية',
        ':infinity:',
        'علامة ورقية دائمة'
    ],
    '‼️': [
        'علامة التعجب المزدوج',
        ':double_exclamation_mark:',
        'علامة الاستياء الحمراء',
        ':red:'
    ],
    '⁉️': [
        'علامة سؤال التعجب',
        ':exclamation_question_mark:',
        'علامة التعجب الأحمر و علامة الاستفسار',
        ':red:'
    ],
    '❓': [
        'علامة السؤال',
        ':question_mark:',
        'علامة سؤال حمراء',
        'زينة علامة سؤال سوداء',
        ':red:'
    ],
    '❔': [
        'علامة السؤال البيضاء',
        ':white_question_mark:',
        ':question_mark:',
        'علامة السؤال البيضاء',
        'زينة علامة السؤال البيضاء',
        ':white:'
    ],
    '❗': [
        'علامة التعجب',
        ':exclamation_mark:',
        'علامة التعجب الأحمر',
        'رمز علامة التعجب الثقيل',
        ':red:'
    ],
    '❕': [
        'علامة التعجب الأبيض',
        ':white_exclamation_mark:',
        ':exclamation_mark:',
        'زينة الاستخلاص الأبيض',
        ':white:'
    ],
    '⭕': [
        'دائرة حمراء قاتمة',
        ':hollow_red_circle:',
        'دائرة',
        'صحيح',
        'دائرة حمراء',
        'علامة الدائرة',
        'دائرة كبيرة ثقيلة',
        ':red:'
    ],
    '☑️': [
        'تحقق من المربع مع التحقق',
        ':check_box_with_check:',
        'ف',
        'خانة',
        'تحقق من العلامة في المربع',
        'صندوق الاقتراع مع التحقق'
    ],
    '✔️': [
        'التحقق من العلامة',
        ':check_mark:',
        'ف',
        'تحقق',
        'انتقل',
        'Checkmark',
        'علامة التحقق الثقيلة',
        ':black:'
    ],
    '❌': [
        'عبر العلامة',
        ':cross_mark:',
        'تقاطع',
        'س',
        ':red:'
    ],
    '✅': [
        'تحقق من زر العلامة',
        ':check_mark_button:',
        'ف',
        'العلامة الخضراء',
        'قالب أخضر',
        'التحقق من العلامة',
        'علامة الفحص البيضاء الثقيل',
        ':green:'
    ],
    '❎': [
        'زر تقاطع العلامات',
        ':cross_mark_button:',
        'تقاطع',
        'س',
        'علامة X',
        'علامة مربعة سلبية',
        ':green:'
    ],
    '#️⃣': [
        'سجل رقم بطاقة المفاتيح',
        ':hash_key:',
        '#',
        'مفتاح التجزئة',
        'وسم',
        'تشرين الأول/أكتوبر',
        'مفتاح الجنيه الآلي',
        'رقم التوقيع',
        ':blue:'
    ],
    '*️⃣': [
        'Keycap Asterisk',
        ':asterisk:',
        'قبعة مفاتيح النجمة',
        ':blue:'
    ],
    '0️⃣': [
        'الرقم 0',
        ':number_0:',
        'Keycap Digit Zero'
    ],
    '1️⃣': [
        'رقم 1',
        ':number_1:',
        'رقم المفتاح الأول'
    ],
    '2️⃣': [
        'رقم 2',
        ':number_2:',
        'رقم المفتاح 2'
    ],
    '3️⃣': [
        'رقم 3',
        ':number_3:',
        'رقم المفتاح 3'
    ],
    '4️⃣': [
        'الرقم 4',
        ':number_4:',
        'رقم لوحة المفاتيح 4'
    ],
    '5️⃣': [
        'الرقم 5',
        ':number_5:',
        'رقم المفتاح 5'
    ],
    '6️⃣': [
        'الرقم 6',
        ':number_6:',
        'رقم المفتاح 6'
    ],
    '7️⃣': [
        'الرقم 7',
        ':number_7:',
        'Keycap Digit Seven'
    ],
    '8️⃣': [
        'الرقم 8',
        ':number_8:',
        'رقم لوحة المفاتيح 8'
    ],
    '9️⃣': [
        'رقم 9',
        ':number_9:',
        'رقم لوحة المفاتيح 9'
    ],
    '🔟': [
        'الرقم 10',
        ':number_10:',
        'Keycap: 10',
        '10',
        'رقم لوحة المفاتيح 10'
    ],
    '🔠': [
        'Input Latin Uppercase',
        ':input_latin_uppercase:',
        'ABCD',
        'الحروف',
        'رمز الإدخال للحروف العلوية',
        'رمز الإدخال لرسائل رأس المال اللاتينية',
        ':blue:'
    ],
    '🔡': [
        'Input Latin Lowercase',
        ':input_latin_lowercase:',
        'حمض',
        'أقل حروف',
        'رمز الإدخال للحروف السفلية',
        'رمز الإدخال للحروف اللاتينية الصغيرة',
        ':blue:'
    ],
    '🔢': [
        'Input Numbers',
        ':input_numbers:',
        '1234',
        'الأرقام',
        'Numeric Input',
        'رمز الإدخال للأرقام',
        ':blue:'
    ],
    '🔣': [
        'رمز الإدخال للرموز',
        ':input_symbols:',
        'الرموز',
        'إدخال الرمز',
        ':blue:'
    ],
    '🔤': [
        'Input Latin Letters',
        ':input_latin_letters:',
        'بكر',
        'الأبجدية',
        'الأحرف',
        'رمز الإدخال للحروف',
        'رمز الإدخال للحروف اللاتينية',
        ':blue:'
    ],
    '🅰️': [
        'زر (نوع الدم)',
        ':a_blood:',
        'نوع الدم A',
        'حرف A',
        'الحرف ألف لرأس المال اللاتيني المربع السلبي',
        ':red:'
    ],
    '🆎': [
        'زر AB (نوع الدم)',
        ':ab_blood:',
        'أحرف AB',
        'نوع الدم AB',
        'AB ساحة سالبة',
        ':red:'
    ],
    '🅱️': [
        'زر B (نوع الدم)',
        ':b_blood:',
        'الحرف B',
        'نوع الدم B',
        'حرف رأس المال اللاتيني المربع السلبي B',
        ':red:'
    ],
    '🆑': [
        'زر CL',
        ':cl_button:',
        'مسح',
        'زر المسح',
        'توقيع CL',
        'CL مربع',
        'حروف CL',
        ':red:'
    ],
    '🆒': [
        'زر رائع',
        ':cool_button:',
        'ساحة رائعة',
        'لافتة رائعة',
        'رائع مربع',
        ':blue:'
    ],
    '🆓': [
        'زر مجاني',
        ':free_button:',
        'مجاني',
        'توقيع مجاني',
        'مجانا مربع',
        ':blue:'
    ],
    'ℹ️': [
        'معلومات',
        ':info_button:',
        'معلومات',
        'أحرف صغيرة I',
        'معلومات السياحة',
        'مصدر المعلومات',
        ':blue:'
    ],
    '🆔': [
        'زر المعرف',
        ':id_button:',
        'ID',
        'تعريف',
        'علامة تحديد الهوية',
        'معرف مربع',
        ':purple:'
    ],
    '🆕': [
        'زر جديد',
        ':new_button:',
        'جديد',
        'توقيع جديد',
        'جديد مربع',
        ':blue:'
    ],
    '🅾️': [
        'زر O (نوع الدم)',
        ':0_blood:',
        'نوع الدم O',
        '0',
        'رسالة رأسمالية لاتينية مربعة سلبية',
        'حرف O',
        ':red:'
    ],
    '🆗': [
        'زر موافق',
        ':ok_button:',
        'حسناً',
        'حسنًا',
        'مربع',
        'موافق التوقيع',
        'حسنا مربع',
        ':blue:'
    ],
    '🅿️': [
        'زر P',
        ':p_button:',
        ':parking_sign:',
        'إشارة وقوف السيارات',
        'رسالة رأسمالية لاتينية مربعة سلبية',
        'حرف P',
        ':blue:'
    ],
    '🆘': [
        'زر الاستغاثة',
        ':sos_button:',
        'إشارة الاستغاثة',
        'الطوارئ',
        'SOS',
        'توقيع النجدة',
        'استغاثة مربعة',
        'مساعدة',
        ':red:'
    ],
    '🆙': [
        'زر التحديث!',
        ':up_button:',
        'رفع المستوى',
        'أعلى',
        'تسجيل الدخول',
        'أعلى مربع مع علامة التعجب',
        ':blue:'
    ],
    '🆚': [
        'زر Vs',
        ':vs_button:',
        'Vs مربع',
        ':orange:'
    ],
    '🆖': [
        'زر NG',
        ':ng_button:',
        'NG مربع',
        'لا يوجد لافتة جيدة',
        'لا يوجد خير',
        ':ng:',
        'بلوبر',
        ':blue:'
    ],
    '🔴': [
        'دائرة حمراء',
        ':red_circle:',
        'دائرة حمراء كبيرة',
        ':red:'
    ],
    '🟠': [
        'دائرة برتقالية',
        ':orange_circle:',
        'دائرة برتقالية كبيرة',
        ':orange:'
    ],
    '🟡': [
        'دائرة صفراء',
        ':yellow_circle:',
        'دائرة أصفر كبيرة',
        ':yellow:'
    ],
    '🟢': [
        'دائرة خضراء',
        ':green_circle:',
        'دائرة خضراء كبيرة',
        ':green:'
    ],
    '🔵': [
        'دائرة زرقاء',
        ':blue_circle:',
        'دائرة زرقاء كبيرة',
        ':blue:'
    ],
    '🟣': [
        'دائرة أرجوانية',
        ':purple_circle:',
        'دائرة بنفسجية كبيرة',
        ':purple:'
    ],
    '🟤': [
        'دائرة بنية',
        ':brown_circle:',
        'دائرة بنية كبيرة',
        ':brown:'
    ],
    '⚫': [
        'دائرة سوداء',
        ':black_circle:',
        'دائرة سوداء متوسطة',
        ':black:'
    ],
    '⚪': [
        'دائرة بيضاء',
        ':white_circle:',
        'دائرة بيضاء متوسطة',
        ':white:'
    ],
    '🟥': [
        'مربع أحمر',
        ':red_square:',
        'مربع أحمر كبير',
        ':red:'
    ],
    '🟧': [
        'مربع برتقالي',
        ':orange_square:',
        'مربع برتقالي كبير',
        ':orange:'
    ],
    '🟨': [
        'مربع أصفر',
        ':yellow_square:',
        'مربع أصفر كبير',
        ':yellow:'
    ],
    '🟩': [
        'ساحة خضراء',
        ':green_square:',
        'ساحة خضراء كبيرة',
        ':green:'
    ],
    '🟦': [
        'مربع أزرق',
        ':blue_square:',
        'مربع أزرق كبير',
        ':blue:'
    ],
    '🟪': [
        'مربع أرجواني',
        ':purple_square:',
        'ساحة بنفسجية كبيرة',
        ':purple:'
    ],
    '🟫': [
        'ساحة بنية',
        ':brown_square:',
        'ساحة براون كبيرة',
        ':brown:'
    ],
    '⬛': [
        'ساحة سوداء كبيرة',
        ':black_large_square:',
        ':black:'
    ],
    '⬜': [
        'ساحة بيضاء كبيرة',
        ':white_large_square:',
        ':white:'
    ],
    '◼️': [
        'ساحة سوداء متوسطة',
        ':black_medium_square:',
        ':black:'
    ],
    '◻️': [
        'ساحة متوسطة بيضاء',
        ':white_medium_square:',
        ':white:'
    ],
    '◾': [
        'ساحة صغيرة متوسطة سوداء',
        ':black_medium_small_square:',
        ':black:'
    ],
    '◽': [
        'ساحة متوسطة بيضاء صغيرة',
        ':white_medium_small_square:',
        ':white:'
    ],
    '▪️': [
        'ساحة صغيرة سوداء',
        ':black_small_square:',
        ':black:'
    ],
    '▫️': [
        'ساحة صغيرة بيضاء',
        ':white_small_square:',
        ':white:'
    ],
    '💠': [
        'شكل ماسي مع دوت في الداخل',
        ':diamond_shape_with_dot:',
        'إهدار',
        'زهور ماسية',
        'كاواي'
    ],
    '🔶': [
        'الماس البرتقالي الكبير',
        ':large_orange_diamond:',
        ':orange:'
    ],
    '🔷': [
        'الماس الأزرق الكبير',
        ':large_blue_diamond:',
        ':blue:'
    ],
    '🔸': [
        'الماس البرتقالي الصغير',
        ':small_orange_diamond:',
        ':orange:'
    ],
    '🔹': [
        'الماس الأزرق الصغير',
        ':small_blue_diamond:',
        ':blue:'
    ],
    '🔺': [
        'المثلث الأحمر في الأعلى',
        ':red_triangle_pointed_up:',
        'المثلث الأحمر ذو النقاط العلوية',
        ':red:'
    ],
    '🔻': [
        'مثلث أحمر منخفض',
        ':red_triangle_pointed_down:',
        'المثلث الأحمر الذي يشير إلى الأسفل',
        ':red:'
    ],
    '🔳': [
        'زر الساحة البيضاء',
        ':white_square_button:',
        ':white:',
        ':black:'
    ],
    '🔲': [
        'زر الساحة السوداء',
        ':black_square_button:',
        ':white:',
        ':black:'
    ],
    '©️': [
        'حقوق التأليف',
        ':copyright:',
        ':c:',
        'علامة حقوق الطبع والنشر'
    ],
    '®️': [
        'مسجل',
        ':registered:',
        ':r:',
        'توقيع مسجل'
    ],
    '™️': [
        'علامة تجارية',
        ':trade_mark:',
        ':tm:',
        'العلامة',
        'علامة علامة التجارة'
    ],
    '🛅': [
        'الأمتعة اليسرى',
        ':left_luggage:',
        'حقيبة مع المفتاح',
        'حقيبة مقفلة',
        ':blue:'
    ],
    '🛄': [
        'المطالبة بالأمتعة',
        ':baggage_claim:',
        ':blue:'
    ],
    '🛃': [
        'الجمارك',
        ':customs:',
        ':blue:'
    ],
    '🛂': [
        'مراقبة جوازات السفر',
        ':passport_control:',
        'مراقبة الحدود',
        ':blue:'
    ],
    //"🛜": ["Wireless", ":wireless:", ":wifi:", ":wi_fi:", "Wifi", "wi-fi", "wireless connection", ":blue:"],
    '🚰': [
        'رمز المياه الصالحة للشرب',
        ':potable_water_symbol:',
        'عطش',
        'عطش',
        'ضغطة المياه',
        'تجمع المياه'
    ],
    '🇦': [
        'حرف A',
        ':letter_a:',
        ':a:',
        'حرف رمز المؤشر الإقليمي ألف'
    ],
    '🇧': [
        'الحرف B',
        ':letter_b:',
        ':b:',
        'المؤشر الإقليمي رمز الحرف باء'
    ],
    '🇨': [
        'الحرف C',
        ':letter_c:',
        ':c:',
        'رسالة رمز المؤشر الإقليمي جيم'
    ],
    '🇩': [
        'الحرف دال',
        ':letter_d:',
        ':d:',
        'الحرف دال من رمز المؤشر الإقليمي'
    ],
    '🇪': [
        'الحرف هاء',
        ':letter_e:',
        ':e:',
        'رسالة رمز المؤشر الإقليمي هاء'
    ],
    '🇫': [
        'الحرف F',
        ':letter_f:',
        ':f:',
        'المؤشر الإقليمي رمز الحرف واو'
    ],
    '🇬': [
        'الحرف G',
        ':letter_g:',
        ':g:',
        'رسالة رمز المؤشر الإقليمي زاي'
    ],
    '🇭': [
        'الحرف حاء',
        ':letter_h:',
        ':h:',
        'رسالة رمز المؤشر الإقليمي حاء'
    ],
    '🇮': [
        'الحرف الأول',
        ':letter_i:',
        ':i:',
        'رسالة رمز المؤشر الإقليمي الأولى'
    ],
    '🇯': [
        'رسالة ياء',
        ':letter_j:',
        ':j:',
        'رسالة رمزية للمؤشر الإقليمي ياء'
    ],
    '🇰': [
        'الحرف K',
        ':letter_k:',
        ':k:',
        'رسالة رمز المؤشر الإقليمي كاف'
    ],
    '🇱': [
        'حرف L',
        ':letter_l:',
        ':l:',
        'رسالة رمز المؤشر الإقليمي لام'
    ],
    '🇲': [
        'حرف M',
        ':letter_m:',
        ':m:',
        'رسالة رمزية للمؤشر الإقليمي M'
    ],
    '🇳': [
        'حرف N',
        ':letter_n:',
        ':n:',
        'رمز المؤشر الإقليمي نون'
    ],
    '🇴': [
        'حرف O',
        ':letter_o:',
        ':o:',
        'حرف رمز المؤشر الإقليمي سين'
    ],
    '🇵': [
        'حرف P',
        ':letter_p:',
        ':p:',
        'رسالة رمز المؤشر الإقليمي عين'
    ],
    '🇶': [
        'الحرف Q',
        ':letter_q:',
        ':q:',
        'رسالة رمز المؤشر الإقليمي فاء'
    ],
    '🇷': [
        'الحرف R',
        ':letter_r:',
        ':r:',
        'رسالة الرمز R للمؤشر الإقليمي'
    ],
    '🇸': [
        'حرف S',
        ':letter_s:',
        ':s:',
        'رسالة رمز المؤشر الإقليمي قاف'
    ],
    '🇹': [
        'حرف T',
        ':letter_t:',
        ':t:',
        'رسالة الرمز T للمؤشر الإقليمي'
    ],
    '🇺': [
        'الحرف U',
        ':letter_u:',
        ':u:',
        'رسالة رمزية للمؤشر الإقليمي شين'
    ],
    '🇻': [
        'الحرف الخامس',
        ':letter_v:',
        ':v:',
        'حرف رمز المؤشر الإقليمي الخامس'
    ],
    '🇼': [
        'الحرف W',
        ':letter_w:',
        ':w:',
        'رمز المؤشر الإقليمي الحرف W'
    ],
    '🇽': [
        'الحرف العاشر',
        ':letter_x:',
        ':x:',
        'حرف رمز المؤشر الإقليمي العاشر'
    ],
    '🇾': [
        'حرف ص',
        ':letter_y:',
        ':y:',
        'رسالة رمز المؤشر الإقليمي ذال'
    ],
    '🇿': [
        'حرف Z',
        ':letter_z:',
        ':z:',
        'رسالة رمزية للمؤشر الإقليمي Z'
    ],
    '💌': [
        'حرف الحب',
        ':love_letter:',
        'ظرف القلب',
        'ملاحظة الحب'
    ],
    '🚮': [
        'ضع المطر في رمز المكان الخاص به',
        ':put_litter_in_bing_sign:',
        'لاعب في لافتة الشريط',
        'وضع الممر في سلة المهملات',
        'شخص مع سلة المهملات'
    ],
    '♿': [
        'رمز الكرسي العاجل',
        ':wheelchair_symbol:',
        'حمام يمكن الوصول إليه'
    ],
    '🚹': [
        'رمز الرجال',
        ':mens_symbol:',
        'رمز الرجال',
        'مراحيض الرجال',
        'ريستروم الذكور',
        'ذكور WC',
        ':blue:'
    ],
    '🚺': [
        'رمز المرأة',
        ':womens_symbol:',
        'رمز المرأة',
        'مرحاض النساء',
        'مركز الأنثى',
        'الاتحاد العالمي الشهير',
        ':purple:',
        ':pink:'
    ],
    '🚻': [
        'ريستوم',
        ':restroom:',
        'لافتة الحمام',
        'لافتة مرحاض',
        'علامة WC',
        ':blue:'
    ],
    '🚼': [
        'رمز الطفل',
        ':baby_symbol:',
        'مركز تغيير الطفل',
        'رمز تغيير الطفل',
        'حضانة',
        ':orange:'
    ],
    '🚾': [
        'إغلاق المياه',
        ':wc:',
        'WC',
        'المرحاض WC',
        ':blue:'
    ],
    '⚠️': [
        'علامة تحذير',
        ':warning_sign:',
        'رمز التنبيه',
        ':yellow:'
    ],
    '🚸': [
        'عبور الأطفال',
        ':children_crossing:',
        'عبور الأطفال',
        'ممر المدرسة',
        ':yellow:'
    ],
    '🔅': [
        'رمز السطوع المنخفض',
        ':low_brightness_symbol:',
        'زر التعتيم',
        'تقليل السطوع'
    ],
    '🔆': [
        'رمز السطوع العالي',
        ':high_brightness_symbol:',
        'زيادة السطوع',
        'زر مشرق'
    ],
    '📳': [
        'وضع الاهتزاز',
        ':vibration_mode:',
        'قلب الهاتف',
        'الوضع الصامت',
        ':orange:'
    ],
    '📴': [
        'إيقاف الهاتف المحمول',
        ':mobile_phone_off:',
        ':orange:'
    ],
    '〰️': [
        'موجة',
        'هاش فاتح',
        ':wave:'
    ],
    '💱': [
        'صرف العملات',
        ':currency_exchange:'
    ],
    '💲': [
        'لوحة الدولار الثقيلة',
        ':dollar_symbol:',
        'دولار',
        'علامة الدولار'
    ],
    '♻️': [
        'رمز إعادة التدوير العام الأسود',
        ':recycling_symbol:',
        'رمز إعادة التدوير',
        'شعار المحذوفات',
        ':green:'
    ],
    '🔱': [
        'شعار ترايدنت',
        ':trident_emblem:',
        'بيتشفوك',
        'ترايدنت'
    ],
    '📛': [
        'اسم الشارة',
        ':name_badge:',
        'توفو على النار',
        'اسم العلامة',
        'علامة نارية'
    ],
    '🔰': [
        'الرمز الياباني للمبتدئ',
        ':japanese_symbol_beginner:',
        'شوشنشا مارك',
        'درع أخضر أصفر',
        ':green:',
        ':yellow:'
    ],
    '➰': [
        'حلقة عاطفية',
        ':curly_loop:',
        'حلقة تنازلية',
        'حلقة'
    ],
    '➿': [
        'تكرار التكرار المزدوج',
        ':double_curly_loop:',
        'حلقة مزدوجة',
        'البريد الصوتي'
    ],
    '〽️': [
        'علامة التناوب',
        ':part_alternation_mark:',
        'م',
        'ماكدونالدز'
    ],
    '✳️': [
        'ثمانية نجمة منبوذة',
        ':eight_spoked_asterisk:',
        ':green:'
    ],
    '✴️': [
        '8 نقاط نجمة سوداء',
        ':eight_pointed_star:',
        'نجم برتقالي',
        'ثمانية نجوم',
        ':orange:'
    ],
    '❇️': [
        'البانكلي',
        ':sparkle:',
        ':green:'
    ],
    'Ⓜ️': [
        'دائرة M',
        'رسالة رأس المال اللاتينية الدائرية M',
        ':circled_m:',
        'مترو',
        ':blue:'
    ],
    '🈁': [
        'إشارة الكلمة اليابانية هنا',
        'Squared Katakana Koko',
        ':japanese_here:',
        'هنا',
        'الوجهة',
        ':blue:'
    ],
    '🈂️': [
        'خدمة معنى الإشارة اليابانية أو رسوم الخدمة',
        'Squared Katakana Sa',
        ':japanese_service:',
        ':blue:'
    ],
    '🈷️': [
        'القيمة الشهرية للعلامة اليابانية',
        'إيديوغرافيا موحّدة CJK - 6708',
        ':japanese_monthly_amouny:',
        'راديكالي 74',
        '月',
        ':orange:'
    ],
    '🈶': [
        'العلامة اليابانية غير مجانية',
        'إيديوغرافيا موحّدة CJK - 6709',
        ':japanese_own:',
        'مملوك',
        '有',
        ':orange:'
    ],
    '🈯': [
        'معاني الإشارة اليابانية محجوزة',
        'إيديوغرافيا موحّدة CJK - 6307',
        ':japanese_reserved:',
        'نقطة الاصبع',
        '指',
        ':green:'
    ],
    '🉐': [
        'صفقة معنى الإشارة اليابانية',
        'ميزة الإيديوغراف الدائري',
        ':japanese_acquire:',
        'الحصول',
        '得',
        ':red:'
    ],
    '🈹': [
        'خصم معنى الإشارة اليابانية',
        'إيديوغرافيا موحّدة CJK - 5272',
        ':japanese_discount:',
        'صفقة البيع',
        '割',
        ':red:'
    ],
    '🈚': [
        'معاني الإشارة اليابانية مجانية',
        '2 - إيديوغرافيا موحَّدة من طراز CJK 7121',
        ':japanese_lacking:',
        'مفقود',
        '無',
        ':orange:'
    ],
    '🈲': [
        'معاني الإشارة اليابانية محظورة',
        'إيديوغرافيا موحَّدة تابعة لكلية جاك مربعة - 7981',
        ':japanese_prohibited:',
        'Forbid',
        '禁',
        ':red:'
    ],
    '🉑': [
        'معاني العلامة اليابانية مقبولة',
        'قبول الإيديوغراف الدائري',
        ':japanese_accept:',
        'قبول',
        ':orange:'
    ],
    '🈸': [
        'تطبيق معنى الإشارة اليابانية',
        'إيديوغرافيا موحّدة CJK - 7533',
        ':japanese_application_form:',
        'نموذج الطلب',
        'قرد',
        'طلب',
        '申',
        ':orange:'
    ],
    '🈴': [
        'تمرير معاني العلامة اليابانية (المستوى)',
        'إيديوغرافيا موحّدة CJK - 5408',
        ':japanese_agreement:',
        'إتفاقية',
        '合',
        ':red:'
    ],
    '🈳': [
        'الشعار الياباني يعني',
        'إيديوغرافيا موحّدة CJK - 7a7(أ)',
        ':japanese_available:',
        'فارغة ومتاحة',
        '空',
        ':blue:'
    ],
    '㊗️': [
        'تهانينا على الإشارة اليابانية',
        'تهانينا الإيديوغراف الدائري',
        ':japanese_congratulations:',
        ':red:'
    ],
    '㊙️': [
        'سر الإيديوغراف الدائري',
        ':japanese_secret:',
        'سر معاني الإشارة اليابانية',
        'سرية',
        ':red:'
    ],
    '🈺': [
        'العلامة اليابانية مفتوحة للأعمال التجارية',
        'إيديوغرافيا موحّدة CJK مربعة - 55b6',
        ':japanese_open_for_business:',
        'العمل',
        '営',
        ':orange:'
    ],
    '🈵': [
        'إشارة يابانية ذات معنى كاملة؛ بدون شغور',
        'إيديوغرافيا موحّدة CJK - 6e80',
        ':japanese_full:',
        'كامل',
        '満',
        ':red:'
    ],
    '🔘': [
        'زر الراديو',
        ':radio_button:'
    ],
    '🛑': [
        'إيقاف التوقيع',
        ':stop_sign:',
        'لافتة اجنبية',
        ':red:'
    ],
    '⚕️': [
        'الرمز الطبي',
        ':medical_symbol:',
        'الأنابيس',
        'Asklepios',
        'زخرفة اسكليبيوس',
        'موظفو الإسكوابيوس'
    ],
    '🛗': [
        'المصعد',
        ':elevator:',
        ':lift:',
        'رفع'
    ],
    '⚧️': [
        'رمز نقل الجنس',
        ':transgender_sign:'
    ],
    '♂️': [
        'لافتة الذكور',
        ':male_sign:',
        'رمز الرجل',
        'رمز المريخ'
    ],
    '♀️': [
        'لافتة الأنثى',
        ':female_sign:',
        'رمز المرأة',
        'Venus Symbol'
    ]
};
/*food and drinks*/
emojis_language[lang][6] = {
    '🍇': [
        'رسومات',
        ':grapes:',
        'غضب',
        ':purple:'
    ],
    '🍈': [
        'حدين',
        ':melon:',
        'Cantaloupe',
        'العسل',
        'مسكميلون'
    ],
    '🍉': [
        'البطيخ',
        ':watermelon:',
        ':red:'
    ],
    '🍊': [
        'Tangerine',
        ':tangerine:',
        'Mandarin',
        ':orange:'
    ],
    '🍋': [
        'الليمون',
        ':lemon:',
        'ليمونادي',
        ':yellow:'
    ],
    '🍌': [
        'الموز',
        ':banana:',
        'النبات',
        ':yellow:'
    ],
    '🍍': [
        'أناناس',
        ':pineapple:'
    ],
    '🥭': [
        'Mango',
        ':mango:'
    ],
    '🍎': [
        'تفاح أحمر',
        ':red_apple:',
        ':apple:',
        'تفاحة حمراء لذيذة',
        ':red:'
    ],
    '🍏': [
        'تفاحة خضراء',
        ':green_apple:',
        ':apple:',
        'تفاحة لذيذة ذهبية',
        'تفاحة جراني سميث',
        ':green:'
    ],
    '🍐': [
        'ذبابة',
        ':pear:'
    ],
    '🍑': [
        'خوخ',
        ':peach:',
        'أسفل',
        'بايت',
        ':orange:',
        ':pink:'
    ],
    '🍒': [
        'تشيرز',
        ':cherry:',
        'الكرز',
        'الكرز البري',
        ':red:'
    ],
    '🍓': [
        'الفراولة',
        ':strawberry:',
        ':red:'
    ],
    '🥝': [
        'فاكهة كيوي',
        ':kiwi:',
        'جوزيبيري صيني',
        'كيوي',
        'كيويفاكيت',
        ':green:'
    ],
    '🍅': [
        'توماتو',
        ':tomato:',
        ':red:'
    ],
    '🥥': [
        'جوز الهند',
        ':coconut:',
        'Cocoanut'
    ],
    '🥑': [
        'أأدورادو',
        ':avocado:',
        ':green:'
    ],
    '🍆': [
        'النبات',
        ':eggplant:',
        ':aubergine:',
        'Aubergine',
        'فاليس',
        'الخضار الأرجوانية',
        ':purple:'
    ],
    '🥔': [
        'بطاطس',
        ':potato:',
        'بطاطا منبوذة',
        'إيداهو بوتو'
    ],
    '🥕': [
        'الجزرة',
        ':carrot:',
        ':orange:'
    ],
    '🌽': [
        'ذرة الذرة',
        ':ear_of_corn:',
        'الذرة',
        'الذرة في اللعبة',
        'الذرة',
        'ذرة الذرة'
    ],
    '🌶️': [
        'بيبر ساخن',
        ':hot_pepper:',
        'شيلي بيبر',
        'حار',
        ':red:'
    ],
    '🥒': [
        'خيار',
        ':cucumber:',
        'جيركين',
        'اختيار',
        ':green:'
    ],
    '🥬': [
        'خضراء ورقي',
        ':leafy_green:',
        'اختيار الكتاب',
        'كابوت صيني',
        'Cos Lettuce',
        'الروم ليتوس',
        'خضراء ورقيون',
        ':green:'
    ],
    '🥦': [
        'بروكولي',
        ':broccoli:',
        ':green:'
    ],
    '🍄': [
        'الفطر',
        ':mushroom:',
        'غرف',
        'Toadstool'
    ],
    '🥜': [
        'Peanuts',
        ':peanuts:',
        'فتحات',
        ':brown:'
    ],
    '🌰': [
        'شيستنوت',
        ':chestnut:',
        'أكورن',
        'توالد',
        ':brown:'
    ],
    '🍞': [
        'الخبز',
        ':bread:',
        'لوح الخبز',
        ':brown:'
    ],
    '🥐': [
        'Croissant',
        ':croissant:',
        ':brown:'
    ],
    '🥖': [
        'خبز باغيت',
        ':baguette_bread:',
        'الخبز الفرنسي',
        'باجيت',
        ':brown:'
    ],
    '🥨': [
        'Pretzel',
        ':pretzel:',
        ':brown:'
    ],
    '🥯': [
        'باجل',
        ':bagel:',
        ':brown:'
    ],
    '🥞': [
        'بانكاك',
        ':pancakes:',
        'خلل',
        'الكعك',
        ':yellow:'
    ],
    '🧀': [
        'زجاج الجبن',
        ':cheese_wedge:',
        'جبن',
        ':yellow:'
    ],
    '🍖': [
        'لحم على العظام',
        ':meat_on_bone:',
        'BQ',
        'باربيكو',
        'لحم المانغا',
        ':red:'
    ],
    '🍗': [
        'Poultry Leg',
        ':poultry_leg:',
        'عصا البراميل',
        'ساق تركيا',
        ':red:'
    ],
    '🥩': [
        'قطع اللحم',
        ':cut_of_meat:',
        'لحم',
        'ستاك',
        ':red:'
    ],
    '🥓': [
        'البقع',
        ':bacon:',
        'Rashers',
        ':red:'
    ],
    '🍔': [
        'هامبورغر',
        ':hamburger:',
        'برغر',
        'شيشيبورجر'
    ],
    '🍟': [
        'الأصفر الفرنسيون',
        ':french_fries:',
        'رقائق',
        'الأبراج',
        'ماكدونالدز فريز',
        ':yellow:'
    ],
    '🍕': [
        'بيتزا',
        ':pizza:',
        'بيبيروني بيتزا',
        'شريحة بيتزا',
        ':red:'
    ],
    '🌭': [
        'كلب ساخن',
        ':hot_dog:',
        'هوتدوج',
        'حمام',
        ':red:'
    ],
    '🥪': [
        'ساندويتش',
        ':sandwich:'
    ],
    '🌮': [
        'تاكو',
        ':taco:'
    ],
    '🌯': [
        'Burrito',
        ':burrito:',
        'تغليف'
    ],
    '🥙': [
        'حشو فلاتفريد',
        ':stuffed_flatbread:',
        'Doner Kebab',
        'Gyro',
        'شاوارما',
        'بيتا ساندويتش'
    ],
    '🍳': [
        'الطبخ',
        ':cooking:',
        'الإفطار',
        'البيض المقلي',
        'حفر العصابة'
    ],
    '🥘': [
        'قبيلة غذاء شالو',
        ':shallow_pan_of_food:',
        'Paella',
        'رجل الطعام'
    ],
    '🍲': [
        'طقم الطعام',
        ':pot_of_food:',
        'زئبق الطعام',
        'حساء',
        'خندق'
    ],
    '🥣': [
        'بوديل مع سبون',
        ':bowl_with_spoon:',
        'حبوب الحبوب'
    ],
    '🥗': [
        'صلاد أخضر',
        ':green_salad:',
        'صلاح',
        ':green:'
    ],
    '🍿': [
        'البوكورن',
        ':popcorn:',
        'الذرة المنبضة'
    ],
    '🧂': [
        'ملح',
        ':salt:',
        'ملح شاكر',
        ':white:'
    ],
    '🥫': [
        'طعام مسبق',
        ':canned_food:',
        'آلة الطعام',
        'علبة التدوين',
        'طعام مصنوع'
    ],
    '🍱': [
        'صندوق بينتو',
        ':bento_box:',
        'صندوق الغداء'
    ],
    '🍘': [
        'راكوب الأرز',
        ':rice_cracker:',
        'كراكر'
    ],
    '🍙': [
        'كرة الأرز',
        ':rice_ball:',
        'Onigiri'
    ],
    '🍚': [
        'الأرز المطبوخ',
        ':cooked_rice:',
        'الأرز المدبغ',
        'الأرز',
        'براز الأرز',
        'الأرز البارد'
    ],
    '🍛': [
        'أرز كوري',
        ':curry_rice:',
        'كوري',
        'طعام هندي',
        'كوري وأرز'
    ],
    '🍜': [
        'بوديل البورصة',
        ':steaming_bowl:',
        'العقدة',
        'العقدة مع عصي Chopstics',
        'رامين'
    ],
    '🍝': [
        'Spaghetti',
        ':spaghetti:',
        'باستا'
    ],
    '🍠': [
        'بطاطا حلوة متجولة',
        ':roasted_sweet_potato:',
        'بطاطا حلوة',
        'يام'
    ],
    '🍢': [
        'خشبي',
        ':oden:',
        'Kebab',
        'منحنى'
    ],
    '🍣': [
        'سوشي',
        ':sushi:',
        'Sashimi',
        'الأطعمة البحرية',
        ':pink:'
    ],
    '🍤': [
        'كريم مقلي',
        ':fried_shrimp:',
        'براون المقلي',
        'بريمب تيمبورا'
    ],
    '🍥': [
        'كعكة السمك مع البوارل',
        ':fish_cake_with_swirl:',
        'كعكة الصيد',
        'Pink Swirl'
    ],
    '🥮': [
        'كعكة القمر',
        ':moon_cake:',
        'كعكة القمر'
    ],
    '🍡': [
        'Dango',
        ':dango:',
        'عصا الحلوى',
        'الكرات الخضراء الوردية'
    ],
    '🥟': [
        'الزلازل',
        ':dumpling:',
        'Empanada',
        'Pierogi'
    ],
    '🥠': [
        'كعكة الثروة',
        ':fortune_cookie:'
    ],
    '🥡': [
        'الصندوق المأخوذ',
        ':takeout_box:',
        'صندوق الغذاء الصيني',
        'Oyster Pail'
    ],
    '🍦': [
        'آيس كريم ناعم',
        ':soft_ice_cream:',
        'السيد ويبي',
        'خدمة ناعمة'
    ],
    '🍧': [
        'الجليد المسحوق',
        ':shaved_ice:',
        'مخروط الثلج'
    ],
    '🍨': [
        'الآيس كريم',
        ':ice_cream:',
        'بئر الآيس كريم',
        'حلوى'
    ],
    '🍩': [
        'البندق',
        ':doughnut:',
        'Donut'
    ],
    '🍪': [
        'كوكي',
        ':cookie:',
        'بيسكويت',
        'كعكة شريحة الشوكولاتة',
        ':brown:'
    ],
    '🎂': [
        'كعكة عيد الميلاد',
        ':birthday_cake:',
        'تاريخ الميلاد',
        'كعكة',
        'كعكة مع الشموع'
    ],
    '🍰': [
        'كعكة قصيرة',
        ':shortcake:',
        'كعكة',
        'قطعة من الكعكة',
        'كعكة الفراولة'
    ],
    '🧁': [
        'كب كيك',
        ':cupcake:',
        'كعكة جنية'
    ],
    '🥧': [
        'دائري',
        ':pie:'
    ],
    '🍫': [
        'شريط الشوكولاتة',
        ':chocolate_bar:',
        'شريط الحلوى',
        'شوكولاتة',
        ':brown:'
    ],
    '🍬': [
        'حلوى',
        ':candy:',
        'رديء',
        'لطيف'
    ],
    '🍭': [
        'لوليبوب',
        ':lollipop:',
        'ناشر'
    ],
    '🍮': [
        'كستار',
        ':custard:',
        'Creme Caramel',
        'حلوى',
        'فلان',
        'بودينغ'
    ],
    '🍯': [
        'عسل العسل',
        ':honey_pot:',
        'العسل',
        'باقة',
        ':yellow:'
    ],
    '🍼': [
        'زجاجة طفل',
        ':baby_bottle:',
        'تغذية الزجاج'
    ],
    '🥛': [
        'زجاج الحليب',
        ':glass_of_milk:',
        'الحليب',
        ':white:'
    ],
    '☕': [
        'مشروب ساخن',
        ':hot_beverage:',
        'قهوة',
        'Espresso',
        'شوكولاتة ساخنة',
        'شاي'
    ],
    '🍵': [
        'ترتيب بدون معالجة',
        ':green_tea:',
        'شاي أخضر',
        'Matcha',
        'شاي ماتشا الأخضر',
        ':green:'
    ],
    '🍶': [
        'Sake',
        ':sake:',
        'زجاجة',
        'نبيذ الأرز',
        'كأس وزجاج الزجاجة'
    ],
    '🍾': [
        'زجاجة مع النوافذ المنبثقة',
        ':champagne:',
        'الاحتفال',
        'Champagne',
        'نبيذ بارج'
    ],
    '🍷': [
        'زجاج نبيذ',
        ':wine_glass:',
        'الكحول',
        'نبيذ أحمر',
        'نبيذ'
    ],
    '🍸': [
        'زجاج كوكتيل',
        ':cocktail_glass:',
        'كوكتيل',
        'مارتيني'
    ],
    '🍹': [
        'شرب مداري',
        ':tropical_drink:',
        'بنطال الفاكهة',
        'شرب تيكي'
    ],
    '🍺': [
        'كوب البيرة',
        ':beer_mug:',
        'بيرة',
        'بيرة ستاين',
        ':yellow:'
    ],
    '🍻': [
        'ربط بيرة البيرة',
        ':clinking_beer_mugs:',
        'بيرة',
        'سخيف'
    ],
    '🥂': [
        'نظارات ربط',
        ':clinking_glasses:',
        'الاحتفال',
        'نظارات شامباني',
        'سخيف'
    ],
    '🥃': [
        'زجاج التبلر',
        ':tumbler_glass:',
        'بوربون',
        'المشروبات',
        'Rum',
        'ويسكي',
        'Whisky'
    ],
    '🥤': [
        'كأس مع الستار',
        ':cup_with_straw:',
        'اللبن',
        'ثقب',
        'بوب سودا',
        'مشروب ناعم'
    ],
    '🥢': [
        'عصي',
        ':chopsticks:'
    ],
    '🍽️': [
        'فورك و سكين مع لوحة',
        ':fork_and_knife_with_plate:',
        'العشاء',
        ':white:',
        ':gray:',
        ':grey:'
    ],
    '🍴': [
        'الفورك والسكين',
        ':fork_and_knife:',
        'القطع',
        'سكين وفورك',
        'الفضة',
        ':gray:',
        ':grey:'
    ],
    '🥄': [
        'بقعة',
        ':spoon:',
        ':gray:',
        ':grey:'
    ],
    '🧄': [
        'الثورليك',
        ':garlic:'
    ],
    '🧅': [
        'أونيون',
        ':onion:'
    ],
    '🧇': [
        'Waffle',
        ':waffle:'
    ],
    '🧆': [
        'Falafel',
        ':falafel:'
    ],
    '🧈': [
        'الزبائن',
        ':butter:'
    ],
    '🦪': [
        'المحار',
        ':oyster:'
    ],
    '🧃': [
        'صندوق المشروبات',
        ':beverage_box:',
        'صندوق العصير'
    ],
    '🧉': [
        'شرب الميت',
        ':mate_drink:',
        'Chimarra<unk>',
        'Cimarrón',
        'اليربا ماتي'
    ],
    '🫒': [
        'زيتون',
        ':olive:',
        ':green:'
    ],
    '🫐': [
        'زرقاء',
        ':blueberries:',
        ':blue:'
    ],
    '🫑': [
        'بيل بيبر',
        ':bell_pepper:',
        ':green:'
    ],
    '🫓': [
        'فلاتفريد',
        ':flatbread:'
    ],
    '🫔': [
        'التامالي',
        ':tamale:',
        'التامال'
    ],
    '🫕': [
        'Fondue',
        ':fondue:'
    ],
    '🧋': [
        'شاي الفقاعات',
        ':boba:',
        'Boba'
    ],
    '🧊': [
        'مكعب جليدي',
        ':ice_cube:'
    ],
    '🫘': [
        'Beans',
        'Flatulence',
        ':beans:',
        'حبوب البن',
        'Spill the beans'
    ],
    '🫗': [
        'تدفق السوائل',
        ':puring_liquid:',
        'مشروب التبديل',
        'الماء'
    ]
};
/*flags*/
emojis_language[lang][7] = {
    '🏁': [
        'راية مخدرة',
        ':chequered_flag:',
        'العلم المختار',
        'فتيات الشبكة',
        'راية السباق',
        ':black:',
        ':white:'
    ],
    '🚩': [
        'العلم الثلاثي',
        ':triangular_flag:',
        'العلم على القطب',
        'العلم الأحمر',
        'العلم الثلاثي عند الرد',
        ':red:'
    ],
    '🎌': [
        'الأعلام المتداخلة',
        ':crossed_flags:',
        'علامتان'
    ],
    '🏴': [
        'العلم الأسود',
        ':black_flag:',
        'حفظ العلم الأسود',
        ':black:'
    ],
    '🏳️': [
        'العلم الأبيض',
        ':white_flag:',
        'إنقاذ العلم الأبيض',
        ':white:'
    ],
    '🏳️‍🌈': [
        'راية قوس قزح',
        ':rainbow_flag:',
        'Pride Flag',
        'LGBT',
        'LGBTQIA+',
        'المثليين',
        'تغيير نوع الجنس',
        'Lesbian',
        'الجنس',
        'Queer'
    ],
    '🏳️‍⚧️': [
        'نقل العلم',
        ':transgender_flag:',
        'أزرق، وردي، وعلم أبيض',
        'عبر العلم'
    ],
    '🏴‍☠️': [
        'علم القراصنة',
        ':pirate_flag:',
        'جولي روجر',
        ':black:'
    ],
    '🇺🇳': [
        'علم الأمم المتحدة',
        ':un:',
        'العلامة: الأمم المتحدة'
    ],
    '🇪🇺': [
        'علم الاتحاد الأوروبي',
        ':eu:',
        'العلم: الاتحاد الأوروبي',
        'EU Flag'
    ],
    '🇦🇨': [
        'علم جزيرة أسنشن',
        ':ac:'
    ],
    '🇦🇩': [
        'علم أندورا',
        ':ad:',
        'Andorran Flag'
    ],
    '🇦🇪': [
        'علم الإمارات العربية المتحدة',
        ':ae:',
        'Emirati Flag',
        'علم الإمبراطور'
    ],
    '🇦🇫': [
        'علم أفغانستان',
        ':af:',
        'Afghan Flag'
    ],
    '🇦🇬': [
        'علم أنتيغوا وبربودا',
        ':ag:'
    ],
    '🇦🇮': [
        'علم أنغيلا',
        ':ai:',
        'العلم الأنغيلي'
    ],
    '🇦🇱': [
        'علم ألبانيا',
        ':al:',
        'العلم الألباني'
    ],
    '🇦🇲': [
        'علم أرمينيا',
        ':am:',
        'علم أرمينيا'
    ],
    '🇦🇴': [
        'علم أنغولا',
        ':ao:',
        'العلم الأنغولي'
    ],
    '🇦🇶': [
        'علم القارة القطبية الجنوبية',
        ':aq:',
        'علم أنتاركتيكا'
    ],
    '🇦🇷': [
        'علم الأرجنتين',
        ':ar:',
        'العلم الأرجنتيني'
    ],
    '🇦🇸': [
        'علم ساموا الأمريكية',
        ':as:',
        'American Samoan Flag'
    ],
    '🇦🇹': [
        'علم النمسا',
        ':at:',
        'Austrian Flag'
    ],
    '🇦🇺': [
        'علم أستراليا',
        ':au:',
        'العلم الأسيسي',
        'العلم الأسترالي'
    ],
    '🇦🇼': [
        'علم أروبا',
        ':aw:',
        'علم أروبا'
    ],
    '🇦🇽': [
        'علم جزر آلاند',
        ':ax:',
        'علم الارض'
    ],
    '🇦🇿': [
        'علم أذربيجان',
        ':az:',
        'علم أذربيجان'
    ],
    '🇧🇦': [
        'علم البوسنة والهرسك',
        ':ba:'
    ],
    '🇧🇧': [
        'علم بربادوس',
        ':bb:',
        'علم بربادوس',
        'علم البجان'
    ],
    '🇧🇩': [
        'علم بنغلاديش',
        ':bd:',
        'Bangladeshi Flag'
    ],
    '🇧🇪': [
        'علم بلجيكا',
        ':be:',
        'العلم البلجيكي'
    ],
    '🇧🇫': [
        'علم بوركينا فاسو',
        ':bf:',
        'علم بوركينا فاسو'
    ],
    '🇧🇬': [
        'علم بلغاريا',
        ':bg:',
        'العلم البلغاري'
    ],
    '🇧🇭': [
        'علم البحرين',
        ':bh:',
        'علم البهراني',
        'العلم البحريني'
    ],
    '🇧🇮': [
        'علم بوروندي',
        ':bi:',
        'Burundian Flag'
    ],
    '🇧🇯': [
        'علم بنن',
        ':bj:',
        'علم بنن'
    ],
    '🇧🇱': [
        'علم القديس بارثيو ليمي',
        ':bl:',
        'العلامة: سانت بارثيوليمي'
    ],
    '🇧🇲': [
        'علم برمودا',
        ':bm:',
        'Bermudan Flag'
    ],
    '🇧🇳': [
        'علم بروني',
        ':bn:',
        'علم برونيان'
    ],
    '🇧🇴': [
        'علم بوليفيا',
        ':bo:',
        'Bolivian Flag'
    ],
    '🇧🇶': [
        'علم هولندا الكاريبية',
        ':bq:',
        'Bonaire'
    ],
    '🇧🇷': [
        'علم البرازيل',
        ':br:',
        'العلم البرازيلي'
    ],
    '🇧🇸': [
        'علم جزر البهاما',
        ':bs:',
        'علم البهاما'
    ],
    '🇧🇹': [
        'علم بوتان',
        ':bt:',
        'العلم البوتاني'
    ],
    '🇧🇻': [
        'علم جزيرة بوفت',
        ':bv:',
        'العلامة: جزيرة بوفت'
    ],
    '🇧🇼': [
        'علم بوتسوانا',
        ':bw:',
        'Batswana Flag'
    ],
    '🇧🇾': [
        'علم بيلاروس',
        ':by:',
        'العلم البيلاروسي'
    ],
    '🇧🇿': [
        'علم بليز',
        ':bz:',
        'علم بليز'
    ],
    '🇨🇦': [
        'علم كندا',
        'العلم الكندي',
        ':ca:'
    ],
    '🇨🇨': [
        'علم جزر كوكوس (كيلينغ)',
        ':cc:'
    ],
    '🇨🇩': [
        'Flag of Congo - Kinshasa',
        ':cd:'
    ],
    '🇨🇫': [
        'علم جمهورية أفريقيا الوسطى',
        ':cf:',
        'علم أفريقيا الوسطى'
    ],
    '🇨🇬': [
        'علم الكونغو - برازافيل',
        ':cg:'
    ],
    '🇨🇭': [
        'علم سويسرا',
        ':ch:',
        'الصليب الأحمر',
        'العلم السويسري'
    ],
    '🇨🇮': [
        'علم ساحل العاج',
        ':ci:',
        'Flag: Côte d’Ivoire'
    ],
    '🇨🇰': [
        'علم جزر كوك',
        ':ck:',
        'علم جزر كوك'
    ],
    '🇨🇱': [
        'علم شيلي',
        ':cl:',
        'العلم الشيلي'
    ],
    '🇨🇲': [
        'علم الكاميرون',
        ':cm:',
        'العلم الكاميروني'
    ],
    '🇨🇳': [
        'علم الصين',
        ':cn:',
        'العلم الصيني'
    ],
    '🇨🇴': [
        'علم كولومبيا',
        ':co:',
        'العلم الكولومبي'
    ],
    '🇨🇵': [
        'علم جزيرة كليبرتون',
        ':cp:',
        'العلامة: جزيرة كليبرتون'
    ],
    '🇨🇷': [
        'علم كوستاريكا',
        ':cr:',
        'العلم الكوستاريكي'
    ],
    '🇨🇺': [
        'علم كوبا',
        ':cu:',
        'العلم الكوبي'
    ],
    '🇨🇻': [
        'علم الرأس الأخضر',
        ':cv:',
        'علم الرأس الأخضر'
    ],
    '🇨🇼': [
        'علم كوراتشو',
        ':cw:',
        'Curaçaoan Flag'
    ],
    '🇨🇽': [
        'علم جزيرة عيد الميلاد',
        ':cx:',
        'علم جزيرة عيد الميلاد'
    ],
    '🇨🇾': [
        'علم قبرص',
        ':cy:',
        'العلم القبرصي'
    ],
    '🇨🇿': [
        'علم تشيكيا',
        ':cz:',
        'العلم التشيكي'
    ],
    '🇩🇪': [
        'علم ألمانيا',
        ':de:',
        'علم الدوتش',
        'العلم الألماني'
    ],
    '🇩🇬': [
        'علم دييغو غارسيا',
        ':dg:',
        'العلامة: دييغو غارسيا'
    ],
    '🇩🇯': [
        'علم جيبوتي',
        ':dj:',
        'Djibouti Flag',
        'Djiboutian Flag'
    ],
    '🇩🇰': [
        'علم الدانمرك',
        ':dk:',
        'العلم الدانماركي'
    ],
    '🇩🇲': [
        'علم دومينيكا',
        ':dm:'
    ],
    '🇩🇴': [
        'علم الجمهورية الدومينيكية',
        ':do:',
        'علم Dom Rep',
        'علم دومينيكي'
    ],
    '🇩🇿': [
        'علم الجزائر',
        ':dz:',
        'Algerian Flag'
    ],
    '🇪🇦': [
        'علم سيوتا وميليلا',
        ':ea:',
        'علم مليلية',
        'علم السيوتا',
        'Flag: Ceuta & Melilla'
    ],
    '🇪🇨': [
        'علم إكوادور',
        ':ec:',
        'Ecuadorian Flag'
    ],
    '🇪🇪': [
        'علم إستونيا',
        ':ee:',
        'العلم الإستوني'
    ],
    '🇪🇬': [
        'علم مصر',
        ':eg:',
        'العلم المصري'
    ],
    '🇪🇭': [
        'علم الصحراء الغربية',
        ':eh:',
        'علم الصحراء الغربية'
    ],
    '🇪🇷': [
        'علم إريتريا',
        ':er:',
        'Eritrean Flag'
    ],
    '🇪🇹': [
        'علم إثيوبيا',
        ':et:',
        'Ethiopian Flag'
    ],
    '🇪🇸': [
        'علم اسبانيا',
        ':es:',
        'العلم الإسباني'
    ],
    '🇫🇮': [
        'علم فنلندا',
        ':fi:',
        'العلم الفنلندي'
    ],
    '🇫🇯': [
        'علم فيجي',
        ':fj:',
        'Fijian Flag'
    ],
    '🇫🇰': [
        'علم جزر فوكلاند',
        ':fk:',
        'علم الفولاندر'
    ],
    '🇫🇲': [
        'علم ميكرونيزيا',
        ':fm:',
        'العلم الميكرونيزي'
    ],
    '🇫🇴': [
        'علم جزر فارو',
        ':fo:',
        'Faroe Islander Flag'
    ],
    '🇫🇷': [
        'علم فرنسا',
        ':fr:',
        'العلم الفرنسي'
    ],
    '🇬🇦': [
        'علم غابون',
        ':ga:',
        'العلم الغابوني'
    ],
    '🇬🇧': [
        'علم بريطانيا العظمى',
        ':gb:',
        'العلم البريطاني',
        'المملكة المتحدة',
        'اتحاد جاك',
        'المملكة المتحدة'
    ],
    '🏴󠁧󠁢󠁥󠁮󠁧󠁿󠁧󠁢󠁥󠁮󠁧󠁿': [
        'علم إنكلترا',
        ':england:',
        'سانت جورج كروس',
        'العلم الإنجليزي'
    ],
    '🏴󠁧󠁢󠁷󠁬󠁳󠁿󠁧󠁢󠁷󠁬󠁳󠁿': [
        'علم ويلز',
        ':wales:',
        'العلم الويلزي',
        'التنين الاحمر',
        'Baner Cymru',
        'Y Ddraig Goch'
    ],
    '🏴󠁧󠁢󠁳󠁣󠁴󠁿󠁧󠁢󠁳󠁣󠁴󠁿': [
        'علم اسكتلندا',
        ':scotland:',
        'العلم الاسكتلندي',
        'سان أندروز الصليب',
        'المربع'
    ],
    '🇬🇩': [
        'علم غرينادا',
        ':gd:',
        'علم غرينادا'
    ],
    '🇬🇪': [
        'علم جورجيا',
        ':ge:',
        'العلم الجورجي'
    ],
    '🇬🇫': [
        'علم غيانا الفرنسية',
        ':gf:',
        'العلم الغيني الفرنسي'
    ],
    '🇬🇬': [
        'علم غيرنسي',
        ':gg:',
        'Guernsey Flag'
    ],
    '🇬🇭': [
        'علم غانا',
        ':gh:',
        'العلم الغاني'
    ],
    '🇬🇮': [
        'علم جبل طارق',
        ':gi:',
        'علم جبل طارق'
    ],
    '🇬🇱': [
        'علم غرينلاند',
        ':gl:',
        'Greenlandic Flag'
    ],
    '🇬🇲': [
        'علم غامبيا',
        ':gm:',
        'Gambian Flag'
    ],
    '🇬🇳': [
        'علم غينيا',
        ':gn:',
        'Guinean Flag'
    ],
    '🇬🇵': [
        'علم غوادلوب',
        ':gp:',
        'علم غواديلوب'
    ],
    '🇬🇶': [
        'علم غينيا الاستوائية',
        ':gq:',
        'Equatorial Guinean Flag',
        'العلم الكواتوغيني'
    ],
    '🇬🇷': [
        'علم اليونان',
        ':gr:',
        'العلم اليوناني'
    ],
    '🇬🇸': [
        'علم جورجيا الجنوبية وجزر ساندويتش الجنوبية',
        ':gs:'
    ],
    '🇬🇹': [
        'علم غواتيمالا',
        ':gt:',
        'Guatemalan Flag'
    ],
    '🇬🇺': [
        'علم غوام',
        ':gu:',
        'العلم الغواماني',
        'علم الشامورو'
    ],
    '🇬🇼': [
        'علم غينيا - بيساو',
        ':gw:',
        'Guinea-Bissau Flag'
    ],
    '🇬🇾': [
        'علم غيانا',
        ':gy:',
        'علم غيانا'
    ],
    '🇭🇰': [
        'علم منطقة هونغ كونغ الإدارية الخاصة الصينية',
        ':hk:',
        'علم هونغ كونغ'
    ],
    '🇭🇲': [
        'علم جزر سمع وماكدونالد',
        ':hm:',
        'العلم: سمع آند ماكدونالد جزر'
    ],
    '🇭🇳': [
        'علم هندوراس',
        ':hn:',
        'علم هندوراس'
    ],
    '🇭🇷': [
        'علم كرواتيا',
        ':hr:',
        'العلم الكرواتي'
    ],
    '🇭🇹': [
        'علم هايتي',
        ':ht:',
        'Haitian Flag'
    ],
    '🇭🇺': [
        'علم هنغاريا',
        ':hu:',
        'العلم الهنغاري'
    ],
    '🇮🇨': [
        'علم جزر الكناري',
        ':ic:'
    ],
    '🇮🇩': [
        'علم إندونيسيا',
        ':id:',
        'العلم الإندونيسي'
    ],
    '🇮🇪': [
        'علم أيرلندا',
        ':ie:',
        'العلم الأيرلندي'
    ],
    '🇮🇱': [
        'علم إسرائيل',
        ':il:',
        'العلم الإسرائيلي'
    ],
    '🇮🇲': [
        'علم جزيرة مان',
        ':im:',
        'Manx Flag'
    ],
    '🇮🇳': [
        'علم الهند',
        ':in:',
        'العلم الهندي'
    ],
    '🇮🇴': [
        'علم إقليم المحيط الهندي البريطاني',
        ':io:',
        'علم إقليم المحيط الهندي البريطاني'
    ],
    '🇮🇶': [
        'علم العراق',
        ':iq:',
        'Iraqi Flag'
    ],
    '🇮🇷': [
        'علم إيران',
        ':ir:',
        'العلم الإيراني'
    ],
    '🇮🇸': [
        'علم أيسلندا',
        ':is:',
        'العلم الآيسلندي'
    ],
    '🇮🇹': [
        'علم إيطاليا',
        ':it:',
        'العلم الإيطالي'
    ],
    '🇯🇪': [
        'علم جيرسي',
        ':je:',
        'علم جيرسي'
    ],
    '🇯🇲': [
        'علم جامايكا',
        ':jm:',
        'العلم الجامايكي'
    ],
    '🇯🇴': [
        'علم الأردن',
        ':jo:',
        'العلم الأردني'
    ],
    '🇯🇵': [
        'علم اليابان',
        ':jp:',
        'العلم الياباني'
    ],
    '🇰🇪': [
        'علم كينيا',
        ':ke:',
        'العلم الكيني'
    ],
    '🇰🇬': [
        'علم قيرغيزستان',
        ':kg:',
        'Kyrgyzstani Flag'
    ],
    '🇰🇭': [
        'علم كمبوديا',
        ':kh:',
        'العلم الكمبودي'
    ],
    '🇰🇮': [
        'علم كيريباس',
        ':ki:',
        'علم كيريباتي'
    ],
    '🇰🇲': [
        'علم جزر القمر',
        ':km:',
        'علم جزر القمر'
    ],
    '🇰🇳': [
        'علم سانت كيتس ونيفيس',
        ':kn:'
    ],
    '🇰🇵': [
        'علم كوريا الشمالية',
        ':kp:',
        'علم كوريا الشمالية'
    ],
    '🇰🇷': [
        'علم كوريا الجنوبية',
        ':kr:',
        'علم كوريا الجنوبية'
    ],
    '🇰🇼': [
        'علم الكويت',
        ':kw:',
        'Kuwaiti Flag'
    ],
    '🇰🇾': [
        'علم جزر كايمان',
        ':ky:',
        'العلم الكايماني'
    ],
    '🇰🇿': [
        'علم كازاخستان',
        ':kz:',
        'Kazakhstani Flag',
        'Kazakh Flag'
    ],
    '🇱🇦': [
        'علم لاوس',
        ':la:',
        'العلم اللاوي',
        'علم لاو'
    ],
    '🇱🇧': [
        'علم لبنان',
        ':lb:',
        'العلم اللبناني'
    ],
    '🇱🇨': [
        'علم سانت لوسيا',
        ':lc:'
    ],
    '🇱🇮': [
        'علم ليختنشتاين',
        ':lt:',
        'علم ليختنشتاين'
    ],
    '🇱🇰': [
        'علم سري لانكا',
        ':lk:',
        'العلم السريلانكي'
    ],
    '🇱🇷': [
        'علم ليبريا',
        ':lr:',
        'العلم الليبري'
    ],
    '🇱🇸': [
        'Flag of Lesotho',
        ':ls:',
        'Basotho Flag'
    ],
    '🇱🇹': [
        'علم ليتوانيا',
        ':lt:',
        'العلم الليتواني'
    ],
    '🇱🇺': [
        'علم لكسمبرغ',
        ':lu:',
        'علم لكسمبرغ'
    ],
    '🇱🇻': [
        'علم لاتفيا',
        ':lv:',
        'العلم اللاتفي'
    ],
    '🇱🇾': [
        'علم ليبيا',
        ':ly:',
        'العلم الليبي'
    ],
    '🇲🇦': [
        'علم المغرب',
        ':ma:',
        'العلم المغربي'
    ],
    '🇲🇨': [
        'علم موناكو',
        ':mc:',
        'علم موناكو'
    ],
    '🇲🇩': [
        'علم مولدوفا',
        ':md:',
        'علم مولدوفا'
    ],
    '🇲🇪': [
        'علم الجبل الأسود',
        ':me:',
        'علم الجبل الأسود'
    ],
    '🇲🇫': [
        'علم القديس مارتن',
        ':mf:',
        'Flag: St. Martin'
    ],
    '🇲🇬': [
        'علم مدغشقر',
        ':mg:',
        'Madagascan Flag'
    ],
    '🇲🇭': [
        'علم جزر مارشال',
        ':mh:',
        'علم المارشال'
    ],
    '🇲🇰': [
        'علم مقدونيا',
        ':mk:',
        'العلم المقدوني'
    ],
    '🇲🇱': [
        'علم مالي',
        ':ml:',
        'العلم المالي'
    ],
    '🇲🇲': [
        'علم ميانمار (بورما)',
        ':mm:',
        'أو علم ماوريس',
        'العلم لبورما',
        'العلم البورمي'
    ],
    '🇲🇳': [
        'علم منغوليا',
        ':mn:',
        'العلم المنغولي'
    ],
    '🇲🇴': [
        'علم ماكاو سار الصين',
        ':mo:',
        'علم ماكاني'
    ],
    '🇲🇵': [
        'علم جزر ماريانا الشمالية',
        ':mp:',
        'العلم الميكرونيزي'
    ],
    '🇲🇶': [
        'علم المارتينيك',
        ':mq:',
        'علم الثعبان للمارتينيك',
        'علم المارتينيكايس'
    ],
    '🇲🇷': [
        'علم موريتانيا',
        ':mr:',
        'العلم الموريتاني'
    ],
    '🇲🇸': [
        'Flag of Montserrat',
        ':ms:',
        'Montserratian Flag'
    ],
    '🇲🇹': [
        'علم مالطة',
        ':mt:',
        'Maltese Flag'
    ],
    '🇲🇺': [
        'Flag of Mauritius',
        ':mu:',
        'علم موريشيوس'
    ],
    '🇲🇻': [
        'علم ملديف',
        ':mv:',
        'علم ملديف'
    ],
    '🇲🇼': [
        'علم ملاوي',
        ':mw:',
        'Malawian Flag'
    ],
    '🇲🇽': [
        'علم المكسيك',
        ':mx:',
        'العلم المكسيكي'
    ],
    '🇲🇾': [
        'علم ماليزيا',
        ':my:',
        'Malaysian Flag'
    ],
    '🇲🇿': [
        'علم موزامبيق',
        ':mz:',
        'العلم الموزامبيقي'
    ],
    '🇳🇦': [
        'علم ناميبيا',
        ':na:',
        'Namibian Flag'
    ],
    '🇳🇨': [
        'علم كاليدونيا الجديدة',
        ':nc:',
        'علم كاليدونيا الجديدة'
    ],
    '🇳🇪': [
        'علم النيجر',
        ':ne:',
        'العلم النيجيري'
    ],
    '🇳🇫': [
        'علم جزيرة نورفولك',
        ':nf:',
        'علم جزيرة نورفولك'
    ],
    '🇳🇬': [
        'علم نيجيريا',
        ':ng:',
        'العلم النيجيري'
    ],
    '🇳🇮': [
        'Flag of Nicaragua',
        ':ni:',
        'Nicaraguan Flag'
    ],
    '🇳🇱': [
        'علم هولندا',
        ':nl:',
        'العلم الهولندي',
        'هولندا'
    ],
    '🇳🇴': [
        'علم النرويج',
        ':no:',
        'العلم النرويجي'
    ],
    '🇳🇵': [
        'علم نيبال',
        ':np:',
        'العلم النيبالي'
    ],
    '🇳🇷': [
        'علم ناورو',
        ':nr:',
        'Nauruan Flag'
    ],
    '🇳🇺': [
        'علم نيوي',
        ':nu:',
        'Niuean Flag'
    ],
    '🇳🇿': [
        'علم نيوزيلندا',
        ':nz:',
        'علم كيوي'
    ],
    '🇴🇲': [
        'علم عمان',
        ':om:',
        'العلم العماني'
    ],
    '🇵🇦': [
        'علم بنما',
        ':pa:',
        'العلم البنمي'
    ],
    '🇵🇪': [
        'علم بيرو',
        ':pe:',
        'علم بيرو'
    ],
    '🇵🇫': [
        'علم بولينيزيا الفرنسية',
        ':pf:',
        'العلم البولينيزي الفرنسي'
    ],
    '🇵🇬': [
        'علم بابوا غينيا الجديدة',
        ':pg:',
        'علم PNG',
        'Papua New Guinean Flag'
    ],
    '🇵🇭': [
        'علم الفلبين',
        ':ph:'
    ],
    '🇵🇰': [
        'علم باكستان',
        ':pk:',
        'العلم الباكستاني'
    ],
    '🇵🇱': [
        'علم بولندا',
        ':pl:',
        'العلم البولندي'
    ],
    '🇵🇲': [
        'علم القديس بيير وميكلون',
        ':pm:'
    ],
    '🇵🇳': [
        'علم بيتكيرن',
        ':pn:'
    ],
    '🇵🇷': [
        'علم بورتوريكو',
        ':pr:',
        'العلم البورتوريكي'
    ],
    '🇵🇸': [
        'علم الأراضي الفلسطينية',
        ':ps:',
        'Palestine'
    ],
    '🇵🇹': [
        'علم البرتغال',
        ':pt:',
        'العلم البرتغالي'
    ],
    '🇵🇼': [
        'علم بالاو',
        ':pw:',
        'علم بالاو'
    ],
    '🇵🇾': [
        'علم باراغواي',
        ':py:',
        'Paraguayan Flag'
    ],
    '🇶🇦': [
        'علم قطر',
        ':qa:',
        'العلم القطري'
    ],
    '🇷🇪': [
        'علم اتحاد Re<unk> Union',
        ':re:',
        'راية النقابات'
    ],
    '🇷🇴': [
        'علم رومانيا',
        ':ro:',
        'العلم الروماني'
    ],
    '🇷🇸': [
        'علم صربيا',
        ':rs:',
        'العلم الصربي'
    ],
    '🇷🇺': [
        'علم روسيا',
        ':ru:',
        'العلم الروسي'
    ],
    '🇷🇼': [
        'Flag of Rwanda',
        ':rw:',
        'Rwandan Flag'
    ],
    '🇸🇦': [
        'علم المملكة العربية السعودية',
        ':sa:',
        'العلم السعودي'
    ],
    '🇸🇧': [
        'علم جزر سليمان',
        ':sb:',
        'علم جزر سليمان'
    ],
    '🇸🇨': [
        'علم سيشيل',
        ':sc:',
        'Seychellois Flag'
    ],
    '🇸🇩': [
        'علم السودان',
        ':sd:',
        'Sudanese Flag'
    ],
    '🇸🇪': [
        'علم السويد',
        ':se:',
        'العلم السويدي'
    ],
    '🇸🇬': [
        'علم سنغافورة',
        ':sg:',
        'العلم السنغافوري'
    ],
    '🇸🇭': [
        'علم سانت هيلانة',
        ':sh:'
    ],
    '🇸🇮': [
        'علم سلوفينيا',
        ':si:',
        'العلم السلوفيني'
    ],
    '🇸🇯': [
        'علم سفالبارد و يان ماين',
        ':sj:'
    ],
    '🇸🇰': [
        'علم سلوفاكيا',
        ':sk:',
        'العلم السلوفاكي',
        'Slovakian Flag'
    ],
    '🇸🇱': [
        'علم سيراليون',
        ':sl:',
        'Sierra Leonean Flag'
    ],
    '🇸🇲': [
        'علم سان مارينو',
        ':sm:',
        'علم ساماريني'
    ],
    '🇸🇳': [
        'علم السنغال',
        ':sn:',
        'العلم الثغالي'
    ],
    '🇸🇴': [
        'علم الصومال',
        ':so:',
        'Somalian Flag'
    ],
    '🇸🇷': [
        'علم سورينام',
        ':sr:',
        'علم سورينام'
    ],
    '🇸🇸': [
        'علم جنوب السودان',
        ':ss:',
        'علم جنوب السودان'
    ],
    '🇸🇹': [
        'علم ساو تومي و بريه',
        ':st:'
    ],
    '🇸🇻': [
        'علم السلفادور',
        ':sv:',
        'العلم السلفادوري'
    ],
    '🇸🇽': [
        'علم سانت مارتن',
        ':sx:'
    ],
    '🇸🇾': [
        'علم سوريا',
        ':sy:',
        'العلم السوري'
    ],
    '🇸🇿': [
        'علم سوازيلند',
        ':sz:',
        'علم السباحة'
    ],
    '🇹🇦': [
        'Flag of Tristan Da Cunha',
        ':ta:'
    ],
    '🇹🇨': [
        'علم جزر تركس وكايكوس',
        ':tc:'
    ],
    '🇹🇩': [
        'علم تشاد',
        ':td:',
        'العلم التشادي'
    ],
    '🇹🇫': [
        'علم الأقاليم الجنوبية الفرنسية',
        ':tf:',
        'العلم الفرنسي للأراضي الجنوبية'
    ],
    '🇹🇬': [
        'علم توغو',
        ':tg:',
        'Togolese Flag'
    ],
    '🇹🇭': [
        'علم تايلند',
        ':th:',
        'العلم التايلندي'
    ],
    '🇹🇯': [
        'علم طاجيكستان',
        ':tj:',
        'العلم الطاجيكي'
    ],
    '🇹🇰': [
        'علم توكيلاو',
        ':tk:',
        'علم توكيلاو'
    ],
    '🇹🇱': [
        'علم تيمور - ليشتي',
        ':tl:',
        'علم تيمور - ليشتي',
        'علم تيمور الشرقية'
    ],
    '🇹🇲': [
        'علم تركمانستان',
        ':tm:',
        'Turkmen Flag'
    ],
    '🇹🇳': [
        'العلم التونسي',
        ':tn:',
        'العلم التونسي'
    ],
    '🇹🇴': [
        'علم تونغا',
        ':to:',
        'Tongan Flag'
    ],
    '🇹🇷': [
        'علم تركيا',
        ':tr:',
        'العلم التركي'
    ],
    '🇹🇹': [
        'علم ترينيداد وتوباغو',
        ':tt:'
    ],
    '🇹🇻': [
        'علم توفالو',
        ':tv:',
        'علم توفالو'
    ],
    '🇹🇼': [
        'علم تايوان',
        ':tw:',
        'العلم التايواني'
    ],
    '🇹🇿': [
        'علم تنزانيا',
        ':tz:',
        'Tanzanian Flag'
    ],
    '🇺🇦': [
        'علم أوكرانيا',
        ':ua:',
        'العلم الأوكراني'
    ],
    '🇺🇬': [
        'علم أوغندا',
        ':ug:',
        'العلم الأوغندي'
    ],
    '🇺🇲': [
        'العلامة: الولايات المتحدة الجزر البعيدة',
        ':um:'
    ],
    '🇺🇸': [
        'علم الولايات المتحدة',
        ':us:',
        'العلم الأمريكي',
        'علم الولايات المتحدة'
    ],
    '🇺🇾': [
        'Flag of Uruguay',
        ':uy:',
        'Uruguayan Flag'
    ],
    '🇺🇿': [
        'Flag of Uzbekistan',
        ':uz:',
        'Uzbekistani Flag',
        'Uzbek Flag'
    ],
    '🇻🇦': [
        'علم الكرسي الرسولي',
        ':va:',
        'علم الفانتيكين'
    ],
    '🇻🇨': [
        'علم سانت فنسنت وجزر غرينادين',
        ':vc:'
    ],
    '🇻🇪': [
        'علم فنزويلا',
        ':ve:',
        'العلم الفنزويلي'
    ],
    '🇻🇬': [
        'علم جزر فرجن البريطانية',
        ':vg:',
        'علم سكان جزر فرجن البريطانية'
    ],
    '🇻🇮': [
        'علم جزر فرجن التابعة للولايات المتحدة',
        ':vi:',
        'علم جزر فرجن الأمريكية'
    ],
    '🇻🇳': [
        'علم فيتنام',
        ':vn:',
        'العلم الفيتنامي'
    ],
    '🇻🇺': [
        'Flag of Vanuatu',
        ':vu:',
        'Ni-Vanuatu Flag'
    ],
    '🇼🇫': [
        'علم الويس و فوتونا',
        ':wf:'
    ],
    '🇼🇸': [
        'علم ساموا',
        ':ws:',
        'Samoan Flag'
    ],
    '🇽🇰': [
        'علم كوسوفو',
        ':xk:',
        'Kosovar Flag'
    ],
    '🇾🇪': [
        'علم اليمن',
        ':ye:',
        'العلم اليمني'
    ],
    '🇾🇹': [
        'علم مايوت',
        ':yt:',
        'علم مايوت'
    ],
    '🇿🇦': [
        'علم جنوب أفريقيا',
        ':za:',
        'علم جنوب أفريقيا'
    ],
    '🇿🇲': [
        'علم زامبيا',
        ':zm:',
        'Zambian Flag'
    ],
    '🇿🇼': [
        'علم زمبابوي',
        ':zw:',
        'علم زمبابوي',
        'علم زيم'
    ]
};
/*sports*/
emojis_language[lang][8] = {
    '🧗{{skin_tone}}‍♂️': [
        'تسلق الإنسان',
        ':man_climbing:',
        ':climbing:',
        'تسلق الصخرة للذكور',
        'تسلق الإنسان',
        ':man:'
    ],
    '🧗{{skin_tone}}‍♀️': [
        'تسلق المرأة',
        ':woman_climbing:',
        ':climbing:',
        'تتسلق الصخرة الأنثوية',
        'تسلق المرأة',
        ':woman:'
    ],
    '🧗{{skin_tone}}': [
        'تسلق شخصي',
        ':person_climbing:',
        ':climbing:',
        'تسلق صخري شخصي',
        'تسلق شخصي',
        ':person:'
    ],
    '🏇{{skin_tone}}': [
        'سباق الحصان',
        ':horse_racing:',
        'سباق الحصان',
        'جوكي'
    ],
    '⛷{{skin_tone}}‍️': [
        'تزلج',
        ':skier:'
    ],
    '🏂{{skin_tone}}‍': [
        'Snowboarder',
        ':snowboarder:'
    ],
    '🏌️{{skin_tone}}‍♂️': [
        'Man Golfer',
        ':man_golfer:',
        ':golfer:',
        ':man:'
    ],
    '🏌️{{skin_tone}}‍♀️': [
        'جولف المرأة',
        ':woman_golfer:',
        ':golfer:',
        ':woman:'
    ],
    '🏌️{{skin_tone}}': [
        'جولفر شخصي',
        ':person_golfer:',
        ':golfer:',
        ':person:'
    ],
    '🏄{{skin_tone}}‍♂️': [
        'رجل سورفر',
        ':man_surfer:',
        ':surfer:',
        ':man:'
    ],
    '🏄{{skin_tone}}‍♀️': [
        'أنثى الرافرين',
        ':woman_surfer:',
        ':surfer:',
        ':woman:'
    ],
    '🏄{{skin_tone}}': [
        'فرس الشخص',
        ':person_surfer:',
        ':surfer:',
        ':person:'
    ],
    '🚣{{skin_tone}}‍♂️': [
        'زورق رامي',
        ':man_rowing_boat:',
        ':rowing_boat:',
        ':man:'
    ],
    '🚣{{skin_tone}}‍♀️': [
        'زورق الصنبور النسائية',
        ':woman_rowing_boat:',
        ':rowing_boat:',
        ':woman:'
    ],
    '🚣{{skin_tone}}': [
        'زورق مرتفع شخصي',
        ':person_rowing_boat:',
        ':rowing_boat:',
        ':person:'
    ],
    '🏊{{skin_tone}}‍♂️': [
        'سباحة الرجل',
        ':man_swimming:',
        ':swimming:',
        'سباحة الرجل',
        ':man:'
    ],
    '🏊{{skin_tone}}‍♀️': [
        'سباحة المرأة',
        ':woman_swimming:',
        ':swimming:',
        'سباحة المرأة',
        ':woman:'
    ],
    '🏊{{skin_tone}}': [
        'السباحة الشخصية',
        ':person_swimming:',
        ':swimming:',
        'السباحة الشخصية',
        ':person:'
    ],
    '⛹{{skin_tone}}‍️‍♂️': [
        'كرة الرجل الارتداد',
        ':man_bouncing_ball:',
        ':bouncing_ball:',
        'لاعب كرة سلة الرجل',
        ':man:'
    ],
    '⛹️{{skin_tone}}‍♀️': [
        'كرة الارتداد للمرأة',
        ':woman_bouncing_ball:',
        ':boucing_ball:',
        'لاعب كرة السلة النسائية',
        ':woman:'
    ],
    '⛹️{{skin_tone}}': [
        'كرة مرتدة للشخص',
        ':person_bouncing_ball:',
        ':boucing_ball:',
        'لاعب كرة السلة الشخصي',
        ':person:'
    ],
    '🏋️{{skin_tone}}‍♂️': [
        'وزن الرجل الرافع',
        ':man_lifting_weights:',
        ':lifting_weights:',
        'رافع وزن الرجل',
        ':man:'
    ],
    '🏋️{{skin_tone}}‍♀️': [
        'وزن رفع مستوى المرأة',
        ':woman_lifting_weights:',
        ':lifting_weights:',
        'وزن المرأة',
        ':woman:'
    ],
    '🏋️{{skin_tone}}': [
        'وزن الشخص للرفع',
        ':person_lifting_weights:',
        ':lifting_weights:',
        'رافع الوزن الشخصي',
        ':person:'
    ],
    '🚴{{skin_tone}}‍♂️': [
        'دراجة الرجل',
        ':man_biking:',
        ':biking:',
        'رجل سيكلي',
        'ساكنة الذكور',
        ':man:'
    ],
    '🚴{{skin_tone}}‍♀️': [
        'دراجات النساء',
        ':woman_biking:',
        ':biking:',
        'أنثى ساكنة',
        'سيارة أنثى',
        ':woman:'
    ],
    '🚴{{skin_tone}}': [
        'دراجة السيارات الشخصية',
        ':person_biking:',
        ':biking:',
        'عازف شخصي',
        'عازف شخصي',
        ':person:'
    ],
    '🚵{{skin_tone}}‍♂️': [
        'دراجة جبال مان',
        ':man_mountain_bike:',
        ':mountain_bike:',
        'دراج جبل الرجل',
        ':man:'
    ],
    '🚵{{skin_tone}}‍♀️': [
        'دراجة جبال المرأة',
        ':woman_mountain_bike:',
        ':mountain_bike:',
        'دراج الجبال الأنثوي',
        ':woman:'
    ],
    '🚵{{skin_tone}}': [
        'الدراجات الهوائية للجبال',
        ':person_mountain_bike:',
        ':mountain_bike:',
        'دراج جبال شخصي',
        ':person:'
    ],
    '🤸{{skin_tone}}‍♂️': [
        'عجلة كارتيلي الرجل',
        ':man_cartwheeling:',
        ':cartwheeling:',
        'رجل يدوي عجلة كارتينية',
        ':man:'
    ],
    '🤸{{skin_tone}}‍♀️': [
        'كارتليلي المرأة',
        ':woman_cartwheeling:',
        ':cartwheeling:',
        'المرأة تقوم بعجلة كارتينية',
        ':woman:'
    ],
    '🤸{{skin_tone}}': [
        'كارتليلي شخصي',
        ':person_cartwheeling:',
        ':cartwheeling:',
        'شخص يفعل عجلة كارتل',
        ':person:'
    ],
    '🤼‍♂️': [
        'تصنيع الرجال',
        ':men_wrestling:',
        ':wrestling:',
        'تصنيع',
        'المصارعين',
        ':man:'
    ],
    '🤼‍♀️': [
        'النساء يصارعن',
        ':women_wrestling:',
        ':wrestling:',
        'تصنيع',
        'المصارعين',
        ':woman:'
    ],
    '🤼': [
        'تصنيع الناس',
        ':people_wrestling:',
        ':wrestling:',
        'تصنيع',
        'المصارعين',
        ':person:'
    ],
    '🤽{{skin_tone}}‍♂️': [
        'رجل يلعب بولو الماء',
        ':man_playing_water_polo:',
        ':playing_water_polo:',
        ':man:'
    ],
    '🤽{{skin_tone}}‍♀️': [
        'اللعب النسائي للماء',
        ':woman_playing_water_polo:',
        ':playing_water_polo:',
        ':woman:'
    ],
    '🤽{{skin_tone}}': [
        'شخص يلعب بولو الماء',
        ':person_playing_water_polo:',
        ':playing_water_polo:',
        ':person:'
    ],
    '🤾{{skin_tone}}‍♂️': [
        'رجل لعب كرة اليد',
        ':man_playing_handball:',
        ':playing_handball:',
        ':man:'
    ],
    '🤾{{skin_tone}}‍♀️': [
        'لعب كرة اليد النسائية',
        ':woman_playing_handball:',
        ':playing_handball:',
        ':woman:'
    ],
    '🤾{{skin_tone}}': [
        'لعب الكرة اليدوية',
        ':person_playing_handball:',
        ':playing_handball:',
        ':person:'
    ],
    '🤹{{skin_tone}}‍♂️': [
        'رجل جاينغ',
        ':man_juggling:',
        ':juggling:',
        'رجل جولر',
        ':man:'
    ],
    '🤹{{skin_tone}}‍♀️': [
        'جينغ المرأة',
        ':woman_juggling:',
        ':juggling:',
        'مؤجرة أنثوية',
        ':woman:'
    ],
    '🤹{{skin_tone}}': [
        'النجوم الشخصي',
        ':person_juggling:',
        ':juggling:',
        'مؤجل شخصي',
        ':person:'
    ],
    '🧘{{skin_tone}}‍♂️': [
        'رجل في موقع لوتس',
        ':man_lotus_position:',
        ':lotus_position:',
        'التأمل',
        'Zen',
        'تقاطع الأرجل',
        'يوغا',
        ':man:'
    ],
    '🧘{{skin_tone}}‍♀️': [
        'المرأة في موقع لوتس',
        ':woman_lotus_position:',
        ':lotus_position:',
        'التأمل',
        'Zen',
        'تقاطع الأرجل',
        'يوغا',
        ':woman:'
    ],
    '🧘{{skin_tone}}': [
        'شخص في موقع لوتس',
        ':person_lotus:_position',
        ':lotus_position:',
        'التأمل',
        'Zen',
        'تقاطع الأرجل',
        'يوغا',
        ':person:'
    ],
    '🏃{{skin_tone}}‍♂️': [
        'تشغيل الرجل',
        ':man_running:',
        ':running:',
        ':man:'
    ],
    '🏃{{skin_tone}}‍♀️': [
        'تشغيل المرأة',
        ':woman_running:',
        ':running:',
        ':woman:'
    ],
    '🏃{{skin_tone}}': [
        'تشغيل الشخص',
        ':person_running:',
        ':running:',
        ':person:'
    ],
    '🕺{{skin_tone}}': [
        'رقص الإنسان',
        ':man_dancing:',
        ':dancing:',
        ':man:'
    ],
    '💃{{skin_tone}}': [
        'رقص المرأة',
        ':woman_dancing:',
        ':dancing:',
        ':woman:'
    ],
    '🤺': [
        'سياج شخصي',
        ':person_fencing:',
        'الفانق',
        ':fencing:'
    ],
    '🏆': [
        'كأس',
        ':trophy:',
        'بطولة',
        'الفائز',
        ':gold:',
        ':yellow:'
    ],
    '🏅': [
        'الميدالية الرياضية',
        ':sports_medal:',
        ':medal:',
        ':gold:',
        ':yellow:'
    ],
    '🥇': [
        'ميدالية المركز الأول',
        ':first_place_medal:',
        ':gold_medal:',
        'ميدالية المركز الأول',
        'ميدالية ذهبية',
        ':yellow:',
        ':gold:'
    ],
    '🥈': [
        'ميدالية المركز الثاني',
        ':second_place_medal:',
        ':silver_medal:',
        'ميدالية المركز الثاني',
        'ميدالية فضية',
        ':gray:',
        ':grey:',
        ':silver:'
    ],
    '🥉': [
        'ميدالية المركز الثالث',
        ':third_place_medal:',
        ':bronze_medal:',
        'ميدالية المركز الثالث',
        'الميدالية البرونزية',
        ':brown:',
        ':bronze:'
    ],
    '⚽': [
        'كرة القدم',
        ':football:',
        'كرة القدم',
        ':white:',
        ':black:'
    ],
    '⚾': [
        'البيسبول',
        ':baseball:',
        'كرة برمجية',
        ':white:'
    ],
    '🥎': [
        'كرة برمجية',
        ':softball:',
        ':yellow:'
    ],
    '🏀': [
        'كرة السلة',
        ':basketball:',
        ':orange:',
        'كرة السلة و هوب'
    ],
    '🏐': [
        'الكرة الطائرة',
        ':volleyball:',
        ':white:'
    ],
    '🏈': [
        'كرة القدم الأمريكية',
        ':american_football:',
        'كرة القدم',
        'Gridiron',
        'سوبربوول',
        ':brown:'
    ],
    '🏉': [
        'كرة القدم الرغبي',
        ':rugby:',
        'كرة القدم',
        'البطولة',
        'الرغبي',
        'الاتحاد'
    ],
    '🎾': [
        'تنس',
        ':tennis:',
        ':ball:',
        'الكرة',
        'تجميل',
        'راكيت',
        ':yellow:'
    ],
    '🥏': [
        'قرص متحرك',
        ':flying_disk:',
        'فريسيبي'
    ],
    '🎳': [
        'البولينج',
        ':bowling:',
        'دبابيس',
        'سكاكين',
        'عشرة Pin Bowling'
    ],
    '🏏': [
        'الكريكيت',
        ':cricket:',
        'الخفاش',
        'الكرة'
    ],
    '🏑': [
        'هوكي حقل',
        ':field_hockey:',
        'الكرة',
        'عصا'
    ],
    '🏒': [
        'هوكي الجليد',
        ':ice_hockey:',
        'الكرة',
        'عصا'
    ],
    '🥍': [
        'كسر',
        ':lacrosse:',
        'الكرة',
        'عصا',
        ':red:'
    ],
    '🏓': [
        'بينغ بونغ',
        ':ping_pong:',
        ':table_tennis:',
        'تنس الطاولة',
        'الكرة',
        'Paddle'
    ],
    '🏸': [
        'Badminton',
        ':badminton:',
        'مكوك',
        'راكيت'
    ],
    '🥊': [
        'قفاص الملاكمة',
        ':boxing_glove:',
        ':red:'
    ],
    '🥋': [
        'الفنون العسكرية الموحدة',
        ':martial_arts_uniform:',
        ':judo:',
        ':karate:',
        ':kung_fu:',
        'جودو',
        'كارتا',
        'كينغ فو'
    ],
    '⛳': [
        'العلم في الفول',
        ':flag_in_hole:',
        ':golf_flag:',
        'علم الغولف'
    ],
    '⛸️': [
        'تزلج الجليد',
        ':ice_skate:',
        'التزلج'
    ],
    '🎣': [
        'صيد',
        ':fishing:',
        'القطب',
        'سمكة',
        'صيد السمك'
    ],
    '🎽': [
        'قميص قيد التشغيل',
        ':running_shirt:',
        'واحد',
        'النحاس'
    ],
    '🎿': [
        'سماء',
        ':skis:',
        'التزلج',
        'حذاء'
    ],
    '🛷': [
        'مبتذلة',
        ':sled:'
    ],
    '🥌': [
        'حجر الانحناء',
        ':curling_stone:'
    ],
    '🎯': [
        'ضربة مباشرة',
        ':direct_hit:',
        'رماة',
        'Bullseye',
        'درع'
    ],
    '🎱': [
        'الكرة 8',
        ':pool_8_ball:',
        'كرة مزروعة',
        'مجند',
        'المليارات',
        ':black:'
    ],
    '🎮': [
        'وحدة تحكم لعبة الفيديو',
        ':video_game_controller:',
        ':playstation:',
        ':xbox:',
        'مشغل',
        'Xbox',
        'لوحة اللعبة',
        'Wii U'
    ],
    '♟️': [
        'بئر الشطرنج الأسود',
        ':black_chess_pawn:',
        ':black:'
    ],
    '🏹': [
        'قوس وسهم',
        ':arch:',
        'القوس'
    ],
    '🥅': [
        'صافي الهدف',
        ':goal_net:'
    ],
    '🀄': [
        'تنين ماهجونغ الأحمر',
        ':mahjong:',
        'ماهجونغ',
        'Mahjong Tile',
        '中',
        'تنين ماهجونغ الاحمر'
    ],
    '🎴': [
        'بطاقات لعب الزهور',
        ':flower_playing_cards:',
        'مجموعة البطاقات',
        'Hanafuda',
        'Hwatu',
        'بطاقات التشغيل'
    ]
};
/*travel and places*/
emojis_language[lang][9] = {
    '🚂': [
        'قطار ستيم',
        ':steam_train:',
        'قطار ستيم',
        'قطار السكك الحديدية'
    ],
    '🚃': [
        'سيارة السكك الحديدية',
        ':railway_car:',
        'السكك الحديدية',
        'سيارة السكك الحديدية',
        'النقل بالسكك الحديدية',
        'عربة السكك الحديدية'
    ],
    '🚄': [
        'قطار سريع',
        ':high_speed_train:'
    ],
    '🚅': [
        'قطار رصاص',
        ':bullet_train:',
        'Shinkansen',
        'قطار عالي السرعة بالأنف'
    ],
    '🚆': [
        'القطار',
        ':train:'
    ],
    '🚇': [
        'تحت الارض',
        ':underground:',
        'أنبوب',
        'مترو',
        'قطار'
    ],
    '🚈': [
        'السكك الحديدية الخفيفة',
        ':light_rail:',
        'القطار'
    ],
    '🚊': [
        'صدمة',
        ':tram:'
    ],
    '🚝': [
        'المفرد',
        ':monorail:',
        'القطار'
    ],
    '🚞': [
        'سكك حديد الجبال',
        ':mountain_railway:',
        'Funicular',
        'القطار والجبال'
    ],
    '🚋': [
        'سيارة هوائية',
        ':tram_car:'
    ],
    '🚌': [
        'الحافلة',
        ':bus:',
        'مدرب'
    ],
    '🚍': [
        'الحافلة القادمة',
        ':front_of_bus:',
        'واجهة الحافلة'
    ],
    '🚎': [
        'البوابات الدرقية',
        ':trolleybus:',
        'الحافلة الكهربائية'
    ],
    '🚐': [
        'Minibus',
        ':minibus:',
        'مينيفان',
        'الناس-ناقوس'
    ],
    '🚑': [
        'سيارة إسعاف',
        ':ambulance:'
    ],
    '🚒': [
        'محرك النار',
        ':fire_engine:',
        'إدارة الإطفاء',
        'شاحنة نارية'
    ],
    '🚓': [
        'سيارة الشرطة',
        ':police_car:',
        'سيارة الشرطة',
        'سيارة الشرطة الجانبية'
    ],
    '🚔': [
        'سيارة الشرطة القادمة',
        ':front_of_police_car:',
        'قيادة سيارة الشرطة',
        'سيارة الشرطة'
    ],
    '🚕': [
        'سيارة',
        ':taxi:',
        'نيويورك سيارات الأجرة',
        'جانب سيارة الأجرة'
    ],
    '🚖': [
        'سيارة',
        ':front_of_taxi:',
        'سيارة أجرة قادمة',
        'واجهة التاكسي'
    ],
    '🚗': [
        'السيارة',
        ':car:',
        'سيارة حمراء',
        'جانب السيارة',
        'سيارة'
    ],
    '🚘': [
        'السيارات القادمة',
        ':front_of_car:',
        'سيارة حمراء',
        'مقدمة السيارة'
    ],
    '🚚': [
        'شاحنة التوصيل',
        ':lorry:',
        'غضب'
    ],
    '🚛': [
        'لوري مصمم',
        ':articulated_lorry:',
        'شاحنة خضراء'
    ],
    '🚜': [
        'الجرافة',
        ':tractor:',
        'المزرعة'
    ],
    '🛻': [
        'شاحنة التقاط',
        ':pickup_truck:'
    ],
    '🏎️': [
        'سيارة سباق',
        ':racing_car:',
        'ف1',
        'الصيغة الأولى',
        'سيارة سباق'
    ],
    '🏍️': [
        'دراجة نارية',
        ':motorbike:',
        'دراجة نارية'
    ],
    '🛵': [
        'موتور سكوتر',
        ':motor_scooter:',
        'Vespa',
        'دراجة المحرك',
        'دراجة المحرك'
    ],
    '🛺': [
        'ريكشو تلقائي',
        ':auto_rickshaw:',
        'Tuk Tuk'
    ],
    '🚲': [
        'دراجة',
        ':bike:',
        'دراجة'
    ],
    '🛴': [
        'طرد سكوتر',
        ':kick_scooter:'
    ],
    '⛵': [
        'زورق بحري',
        ':sailboat:',
        'دينغهاي',
        'اليخوت'
    ],
    '🚤': [
        'زورق السرعة',
        ':speedboat:',
        'زورق السيارات',
        'Powerboat'
    ],
    '🛳️': [
        'سفينة المسافر',
        ':passenger_ship:'
    ],
    '⛴️': [
        'عبّارة',
        ':ferry:'
    ],
    '🛥️': [
        'زورق السيارات',
        ':motor_boat:'
    ],
    '🚢': [
        'سفينة رحلات',
        ':cruise_ship:'
    ],
    '✈️': [
        'طائرة',
        ':airplane:',
        'Aeroplane'
    ],
    '🛩️': [
        'طائرة صغيرة',
        ':small_airplane:',
        'طيران صغير'
    ],
    '🚁': [
        'مروحية',
        ':helicopter:'
    ],
    '🚟': [
        'سكك حديد معلقة',
        ':suspension_railway:'
    ],
    '🚠': [
        'كابلواي جبل',
        ':mountain_cableway:'
    ],
    '🚡': [
        'الممر الهوائي',
        ':aerial_tramway:',
        'سيارة كابل',
        'Gondola',
        'روبي'
    ],
    '🛰️': [
        'الأقمار الصناعية',
        ':satellite:'
    ],
    '🚀': [
        'صاروخ',
        ':rocket:',
        'مكوك الفضاء'
    ],
    '🛸': [
        'السوكر الطائر',
        ':flying_saucer:',
        'الفتحة'
    ],
    '🚉': [
        'محطة القطار',
        ':train_station:',
        'منصة التدريب'
    ],
    '🚏': [
        'إيقاف الحافلة',
        ':bus_stop:'
    ],
    '🛣️': [
        'طريق السيارات',
        ':motorway:',
        'الطريق',
        'الطريق السريع',
        'الولايات'
    ],
    '🛤️': [
        'مسار السكك الحديدية',
        ':railway_track:'
    ],
    '🛫': [
        'مغادرة الطائرة',
        ':airplane_departure:',
        'إيقاف التشغيل'
    ],
    '🛬': [
        'وصول الطائرة',
        ':airplane_arrival:',
        'وصول الطائرة',
        'الهبوط'
    ],
    '🗾': [
        'خريطة اليابان',
        ':map_of_japan:'
    ],
    '⛰️': [
        'الجبال',
        ':mountain:'
    ],
    '🏔️': [
        'جبل كابوت الثلج',
        ':snow_capped_mountain:'
    ],
    '🌋': [
        'بركاني',
        ':volcano:'
    ],
    '🗻': [
        'جبل فوجي',
        ':mount_fuji:',
        'فوجي سان'
    ],
    '🏕️': [
        'معسكر',
        ':camping:',
        'المخيم'
    ],
    '🏖️': [
        'شاطئ مع مظلة',
        ':beach_with_umbrella:'
    ],
    '🏜️': [
        'Desert',
        ':desert:'
    ],
    '🏝️': [
        'جزيرة الصحراء',
        ':desert_island:'
    ],
    '🏞️': [
        'المتنزه الوطني',
        ':national_park:'
    ],
    '🏟️': [
        'ملعب',
        ':stadium:',
        'منصة',
        'ملعب الرياضة'
    ],
    '🏛️': [
        'بناء كلاسيكي',
        ':classical_building:',
        'اليونانية',
        'روما'
    ],
    '🏗️': [
        'بناء المباني',
        ':building_construction:',
        'رافعة'
    ],
    '🏘️': [
        'المباني السكنية',
        ':houses_building:',
        'مجموعة البيوت'
    ],
    '🏚️': [
        'مبنى البيت المهجور',
        ':old_house:',
        'المنزل المهجور',
        'البيت القديم',
        'بيت الصيد'
    ],
    '🏠': [
        'الرئيسية',
        ':home:',
        'مبنى المنزل'
    ],
    '🏡': [
        'منزل مع الحديقة',
        ':house_with_garden:',
        'البيت والشجرة'
    ],
    '🏢': [
        'مبنى المكاتب',
        ':office_building:',
        'بناء المدينة',
        'بناء عالي الارتفاع'
    ],
    '🏣': [
        'مكتب البريد الياباني',
        ':japanese_post_office:',
        'علامة بريدية يابانية'
    ],
    '🏤': [
        'مكتب البريد',
        ':european_post_office:',
        'مكتب البريد الأوروبي'
    ],
    '🏥': [
        'المستشفى',
        ':hospital:',
        'ER',
        'A&E',
        'غرفة الطوارئ',
        'الحوادث والطوارئ',
        'الصليب الأحمر',
        'طبي'
    ],
    '🏦': [
        'البنك',
        ':bank:',
        'BK',
        'Bakkureru',
        'فرع البنك',
        'Bakkureru'
    ],
    '🏨': [
        'فندق',
        ':hotel:',
        'السكن',
        'مبنى H'
    ],
    '🏩': [
        'فندق الحب',
        ':love_hotel:',
        'فندق القلب الحب'
    ],
    '🏪': [
        'متجر الراحة',
        ':convenience_store:',
        'متجر 24 ساعة',
        '7-11',
        'متجر الزاوية',
        'Kwik-E-Mart'
    ],
    '🏫': [
        'المدرسة',
        ':school:',
        'برج الساعة',
        'المستوى الأعلى الأولي'
    ],
    '🏬': [
        'متجر القسم',
        ':department_store:',
        'مركز التسوق',
        'متجر'
    ],
    '🏭': [
        'مصنع',
        ':factory:',
        'صناعي',
        'الصناعة',
        'التلوث',
        'دخان'
    ],
    '🏯': [
        'القلعة اليابانية',
        ':japanese_castle:',
        'حصن'
    ],
    '🏰': [
        'القلعة الأوروبية',
        ':european_castle:',
        'Turrets'
    ],
    '💒': [
        'قلب الكنيسة',
        ':church_heart:',
        'زفاف الكنيسة',
        'الزواج'
    ],
    '🗼': [
        'برج طوكيو',
        ':tokyo_tower:',
        'برج ايفل',
        'برج أحمر'
    ],
    '🗽': [
        'تمثال الحرية',
        ':statue_of_liberty:',
        'نيويورك'
    ],
    '⛪': [
        'مبنى الكنيسة',
        ':church_building:',
        'تقاطع'
    ],
    '🕌': [
        'مسجد',
        ':mosque:',
        'سقف مسكن',
        'Minaret'
    ],
    '🛕': [
        'معبد الهندوس',
        ':hindu_temple:'
    ],
    '🕍': [
        'كنيس',
        ':synagogue:',
        'يهودي',
        'Synagog',
        'معبد'
    ],
    '⛩️': [
        'ضريح شينتو',
        ':shinto_shrine:',
        'كامي-نو ميتشي'
    ],
    '🕋': [
        'Kaaba',
        ':kaaba:',
        'Mecca'
    ],
    '🏙️': [
        'Cityscape',
        ':cityscape:'
    ],
    '⛱️': [
        'مظلة على الأرض',
        ':beach_umbrella:',
        'مظلة الشاطئ'
    ],
    '🌄': [
        'الشروق فوق الجبال',
        ':sunrise_over_mountains:',
        'صباحا',
        'الشروق'
    ],
    '🌅': [
        'الشروق',
        ':sunrise:',
        ':sunset:',
        'غروب'
    ],
    '🌆': [
        'Cityscape في دوسك',
        ':cityscape_at_dusk:',
        'مدينة السماء البرتقالية',
        'مدينة دوسك'
    ],
    '🌇': [
        'غروب الغد فوق المباني',
        ':sunset_over_buildings:',
        'غداء المدينة'
    ],
    '🌃': [
        'ليلة مع النجوم',
        ':night_with_stars:',
        'المدينة في الليل',
        'ليلة النجوم'
    ],
    '🗿': [
        'Moai',
        ':moai:',
        'تمثال جزيرة عيد الفصح',
        'مناجرة الروك البشري',
        'تمثال مولاي'
    ],
    '🌠': [
        'نجم إطلاق النار',
        ':shooting_star:',
        'عندما تتمنى على النجمة',
        'نيزويد'
    ],
    '🌌': [
        'طريق التبانة',
        ':milky_way:',
        'مجرة',
        'سماء الليل',
        'المساحة',
        'النجوم',
        'الكون'
    ],
    '🎑': [
        'حفل عرض القمر',
        ':moon_viewing_ceremony:',
        'العشب والأوردة والقمر',
        'حصاد القمر',
        'مهرجان منتصف الخريف',
        'Tsukimi'
    ],
    '🛖': [
        'كوخ',
        ':hut:'
    ],
    '🎢': [
        'خام رديء',
        ':roller_coaster:',
        'روليركاستر',
        'منتزه الثيم'
    ],
    '🛝': [
        'شريحة Playground',
        ':playground_slide:',
        'طفل',
        'الأطفال'
    ]
};
/*technologies (smartphones, laptops, etc.) and office*/
emojis_language[lang][10] = {
    '⌚': [
        'مشاهدة',
        ':watch:',
        'توقيت',
        'ساعة التفاح'
    ],
    '⏰': [
        'ساعة المنبه',
        ':alarm_clock:'
    ],
    '⏱️': [
        'ساعة توقف',
        ':stopwatch:'
    ],
    '⏲️': [
        'ساعة المؤقت',
        ':timer_clock:'
    ],
    '🕰️': [
        'ساعة مانتلبوت',
        ':mantelpiece_clock:'
    ],
    '🧭': [
        'البوصلة',
        ':compass:'
    ],
    '🕹️': [
        'عصا التحكم',
        ':joystick:'
    ],
    '🎙️': [
        'مايكروفون ستوديو',
        ':studio_microphone:'
    ],
    '🎚️': [
        'شريط تمرير المستوى',
        ':level_slider:'
    ],
    '🎛️': [
        'التحكم في العقدة',
        ':control_knobs:'
    ],
    '📻': [
        'الراديو',
        ':radio:',
        'راديو رقمي',
        'لاسلكي'
    ],
    '📱': [
        'الهاتف المحمول',
        ':mobile_phone:',
        'الهاتف الذكي',
        'أيفون',
        'الهاتف الخلوي'
    ],
    '📲': [
        'الهاتف المحمول مع السهم الأيمن على اليسار',
        ':phone_call:',
        'مكالمة هاتفية',
        'الإشارة إلى الهاتف'
    ],
    '☎️': [
        'الهاتف الأسود',
        ':rotary_phone:',
        'هاتف الروتاري',
        ':red:'
    ],
    '📞': [
        'مستقبل الهاتف',
        ':phone:',
        'Handset',
        'الهاتف',
        ':black:'
    ],
    '📟': [
        'صمغ',
        ':pager:',
        'بيب',
        'النوم'
    ],
    '📠': [
        'ماكينة الفاكس',
        ':fax_machine:',
        'Facsimile',
        'فاكس'
    ],
    '🔋': [
        'البطارية',
        ':battery:',
        'بطارية AA',
        'بطارية الهاتف'
    ],
    '🔌': [
        'توصيل كهربائي',
        ':power_cable:',
        'AC Adaptor',
        'كابل الطاقة',
        'توصيل الطاقة'
    ],
    '💻': [
        'كمبيوتر',
        ':laptop:',
        'الحواشي',
        'كمبيوتر شخصي',
        'الحواسيب',
        'ماك بوك',
        'السطح'
    ],
    '🖥️': [
        'كمبيوتر سطح المكتب',
        ':desktop_computer:',
        'آي ماك',
        'الحواسيب'
    ],
    '🖨️': [
        'طابعة',
        ':printer:'
    ],
    '⌨️': [
        'Keyboard',
        ':keyboard:'
    ],
    '🖱️': [
        'فأرة الكمبيوتر',
        ':computer_mouse:',
        'فأرة ثلاثة أزرار'
    ],
    '🖲️': [
        'كرة المسار',
        ':trackball:'
    ],
    '💽': [
        'قرص الكمبيوتر',
        ':blu_ray:',
        'Minidisc',
        'قرص',
        'DVD',
        'أشعة بلو',
        'BD'
    ],
    '💾': [
        'قرص مرتفع',
        ':floppy_disk:',
        '3.5<unk> - قرص',
        'قرص'
    ],
    '💿': [
        'قرص بصري',
        ':cd:',
        'قرص',
        'قرص مدمج',
        'قرص مدمج'
    ],
    '📀': [
        'DVD',
        'قرص DVD-ROM',
        ':dvd:',
        'فيديو DVD'
    ],
    '🎥': [
        'كاميرا الفيلم',
        ':movie_camera:',
        'كاميرا الأفلام',
        'هوليوود',
        'فيلم'
    ],
    '🎞️': [
        'إطارات الأفلام',
        ':film_frames:'
    ],
    '📽️': [
        'عرض الأفلام',
        ':film_projector:'
    ],
    '📺': [
        'التلفزيون',
        ':tv:',
        'التلفاز'
    ],
    '📷': [
        'الكاميرا الرقمية',
        ':digital_camera:'
    ],
    '📸': [
        'الكاميرا بالفلاش',
        ':camera_flash:'
    ],
    '📹': [
        'كاميرا الفيديو',
        ':video_camera:',
        'كاميرا'
    ],
    '📼': [
        'فيديوكسيت',
        ':vhs:',
        'فيس',
        'VCR',
        'شريط الفيديو',
        'فيديوكسيت'
    ],
    '💳': [
        'بطاقة الائتمان',
        ':credit_card:',
        'بطاقة الخصم',
        'أميكس',
        'Diners Club',
        'أمريكان إكسبريس',
        'إتقان',
        'بطاقة فيزا'
    ],
    '📧': [
        'البريد الإلكتروني',
        ':email:',
        'البريد الإلكتروني'
    ],
    '📨': [
        'الظرف الوارد',
        ':incoming_envelope:',
        'ظرف مع الخطوط',
        'ظرف سريع'
    ],
    '📩': [
        'ظرف مع السهم لأسفل فوق',
        ':insert_in_envelope:',
        'ظرف السهم لأسفل',
        'إدراج في الظرف'
    ],
    '📤': [
        'قالب خارجي',
        ':outbox_tray:'
    ],
    '📥': [
        'صندوق الوارد',
        ':inbox_tray:'
    ],
    '📮': [
        'علبة',
        ':postbox:'
    ],
    '📁': [
        'مجلد الملف',
        ':file_folder:',
        'مجلد',
        'دليل',
        'مجلد الملف المغلق'
    ],
    '📂': [
        'فتح مجلد الملف',
        ':open_file_folder:',
        'دليل'
    ],
    '🗂️': [
        'فهرس البطاقة',
        ':card_index_dividers:'
    ],
    '📅': [
        'التقويم',
        ':calendar:',
        '17 تموز/يوليه',
        'يوم الرموز التعبيرية العالمي'
    ],
    '🗓️': [
        'رزنامة التقويم الدائري',
        ':spiral_calendar_pad:'
    ],
    '📆': [
        'التقويم المعطّل',
        ':day_calendar:',
        'تقويم يوم',
        'تقويم المكتب'
    ],
    '📈': [
        'زيادة الرسم البياني',
        ':increasing_chart:',
        'مخطط إيجابي',
        'الرسم البياني للأعلى',
        'رسم بياني مع الاتجاه الأعلى'
    ],
    '📉': [
        'انخفاض الرسم البياني',
        ':decreasing_chart:',
        'مخطط سلبي',
        'رسم بياني لأسفل',
        'الرسم البياني مع الاتجاه التنازلي'
    ],
    '📊': [
        'البار الرسم البياني',
        ':bar_chart:',
        'شريط الرسم البياني'
    ],
    '📌': [
        'بوشن',
        ':pushpin:',
        'Thumb Tack',
        ':red:'
    ],
    '📋': [
        'الحافظة',
        ':clipboard:'
    ],
    '📍': [
        'دفعة مستديرة',
        ':round_pushpin:',
        'تثبيت مسقط',
        'تثبيت الخريطة',
        'تثبيت',
        'تثبيت أحمر',
        ':red:'
    ],
    '📎': [
        'ورقة',
        ':paperclip:',
        'كسح'
    ],
    '📏': [
        'حاكم مستقيم',
        ':straight_ruler:'
    ],
    '📐': [
        'حاكم ثلاثي',
        ':triangular_ruler:',
        'مثلث حاكم'
    ],
    '✂️': [
        'مقص',
        ':scissors:',
        'القطع'
    ],
    '✏️': [
        'قلم رصاص',
        ':pencil:',
        'رصاص القائد'
    ],
    '✒️': [
        'النب الأسود',
        ':black_nib:',
        'بن نب',
        'نافورة بن'
    ],
    '🖋️': [
        'نافورة بن',
        ':fountain_pen:',
        'نافورة أسفل اليسار القلم'
    ],
    '🖊️': [
        'القلم',
        ':pen:',
        'القلم السفلي للنقطة اليسرى',
        'قلم نقطة الزاوية'
    ],
    '🖌️': [
        'فرشاة الألم',
        ':paintbrush:',
        'فرشاة',
        'أسفل البانتفرش اليسرى'
    ],
    '🖍️': [
        'Crayon',
        ':crayon:',
        'الكريون اليساري السفلي'
    ],
    '📝': [
        'مذكرة',
        ':memo:',
        'Memorandum',
        'ملاحظة',
        'قلم الرصاص والورقة'
    ],
    '🗑️': [
        'سلة ورق النفايات',
        ':wastepaper_basket:',
        'القمامة يمكن',
        'سلة الروبيش',
        'القمامة يمكن'
    ],
    '📡': [
        'هوائي ساتلي',
        ':satellite_antenna:'
    ],
    '🔭': [
        'التلسكوب',
        ':telescope:',
        'التعتيم'
    ],
    '🔬': [
        'مجهر',
        ':microscope:',
        'Magnify',
        'العلوم'
    ],
    '📭': [
        'فتح صندوق البريد مع العلم المخفض',
        ':open_mailbox_lowered:'
    ],
    '📬': [
        'فتح صندوق البريد مع العلم المرتفع',
        ':open_mailbox_raised:',
        'فتح صندوق البريد'
    ],
    '📪': [
        'صندوق البريد المغلق مع العلم المرتفع',
        ':closed_mailbox_lowered:'
    ],
    '📫': [
        'صندوق البريد المغلق مع العلم المرتفع',
        ':closed_mailbox_raised:'
    ],
    '📰': [
        'جريدة',
        ':newspaper:'
    ],
    '🗞️': [
        'الصحف المتقطعة',
        ':rolled_up_newspaper:',
        'إيصال الصحف'
    ],
    '📄': [
        'صفحة مواجهة للأعلى',
        ':printed_page:',
        'صفحة مطبوعة'
    ],
    '📜': [
        'تمرير',
        ':scroll:',
        'شهادة',
        'Parchment'
    ],
    '📃': [
        'صفحة مع Curl',
        ':curled_page:',
        'Curled Page',
        'Curly Page'
    ],
    '📓': [
        'الحواشي',
        ':notebook:',
        'الكتاب الأسود والأبيض'
    ],
    '📔': [
        'دفتر الملاحظات مع الغلاف الزخرفي',
        ':notebook_decorative_cover:'
    ],
    '📕': [
        'كتاب مغلق',
        ':closed_book:',
        'كتاب أحمر',
        'كتاب نصي أحمر',
        ':red:'
    ],
    '📖': [
        'فتح كتاب',
        ':open_book:',
        'كتاب',
        'رواية'
    ],
    '📗': [
        'كتاب أخضر',
        ':green_book:',
        'كتاب نصي أخضر',
        ':green:'
    ],
    '📘': [
        'الكتاب الأزرق',
        ':blue_book:',
        'كتاب نصي أزرق',
        ':blue:'
    ],
    '📙': [
        'كتاب برتقالي',
        ':orange_book:',
        'الكتاب المدرسي البرتقالي',
        ':orange:'
    ],
    '📚': [
        'الكتب',
        ':books:',
        'ملف الكتب',
        'تكدس الكتب'
    ],
    '🗳️': [
        'صندوق الاقتراع مع الاقتراع',
        ':ballot_box:',
        'صندوق التصويت',
        'التصويت'
    ],
    '🗄️': [
        'ملف مجلس الوزراء',
        ':file_cabinet:',
        'مجلس الوزراء'
    ],
    '🗃️': [
        'صندوق ملف البطاقة',
        ':card_file_box:'
    ],
    '🖇️': [
        'مقتطفات ورقية مرتبطة',
        ':linked_paperclips:',
        ':gray:',
        ':grey:'
    ]
};
/*clothes and accessories*/
emojis_language[lang][11] = {
    '👣': [
        'بصمات',
        ':footprints:',
        'قدم',
        'خطوات'
    ],
    '👓': [
        'نظارات',
        ':glasses:',
        'نظارات'
    ],
    '🕶️': [
        'نظارات شمسية',
        ':sunglasses:'
    ],
    '🥽': [
        'جوجل',
        ':goggles:'
    ],
    '🥼': [
        'معطف المختبر',
        ':lab_coat:'
    ],
    '👔': [
        'Necktie',
        ':necktie:',
        'قميص عمل',
        'قميص و تاي'
    ],
    '👕': [
        'قميص',
        ':t_shirt:',
        ':t-shirt:',
        'قميص الفريق',
        'قميص بولو'
    ],
    '👖': [
        'جينز',
        ':jeans:',
        'دنيم',
        'بنطلون',
        'سروال'
    ],
    '🧣': [
        'Scarf',
        ':scarf:'
    ],
    '🧤': [
        'قفازات',
        ':gloves:'
    ],
    '🧥': [
        'معطف',
        ':coat:'
    ],
    '🧦': [
        'Socks',
        ':socks:'
    ],
    '👗': [
        'فستان',
        ':dress:',
        'تنبيه',
        'أسفل'
    ],
    '👘': [
        'Kimono',
        ':kimono:',
        'ارتداء الملابس',
        'الفستان الياباني'
    ],
    '👙': [
        'بيكيني',
        ':bikini:',
        'باثرز',
        'بدلة السباحة'
    ],
    '🩱': [
        'بدلة سباحة من قطعة واحدة',
        'بدلة_سباحة',
        'بدلة_سباحة قطعة واحدة'
    ],
    '👚': [
        'ملابس النساء',
        ':womans_clothes:',
        'ملابس النساء',
        'Blouse',
        'قميص وردي',
        'Blouse'
    ],
    '👛': [
        'حنق',
        ':purse:',
        'المحفظة'
    ],
    '👜': [
        'حقيبة اليد',
        ':handbag:'
    ],
    '👝': [
        'حقيبة التلاعب',
        ':clutch_bag:',
        'الهولندي',
        'حقيبة صغيرة',
        'Pouch'
    ],
    '🎒': [
        'حزمة الظهر',
        ':backpack:',
        'حقيبة',
        'حقيبة مدرسة',
        'ساتل المدرسة',
        'Rucksack'
    ],
    '👞': [
        'Mans Shoe',
        ':mans_shoe:',
        'Mans Shoe',
        'حذاء',
        'عرض بني',
        'عرض الفستان'
    ],
    '👟': [
        'حذاء رياضي',
        ':athletic_shoe:',
        'تشغيل الحذاء',
        'Sneaker',
        'مشغل',
        'المدرّب',
        'حذاء تنس'
    ],
    '🥾': [
        'حذاء الفتحة',
        ':hiking_boot:'
    ],
    '🥿': [
        'حذاء مسطح',
        ':flat_shoe:'
    ],
    '👠': [
        'حذاء عالي الكثافة',
        ':high_heeled_shoe:',
        ':high_heel:',
        'ستيتو',
        'عالية الكعب'
    ],
    '👡': [
        'النساء الصندل',
        ':womans_sandal:',
        'النساء الصندل',
        'صنادل منقوش',
        'رمل',
        'Sandal'
    ],
    '👢': [
        'حذاء المرأة',
        ':womans_boots_',
        'حذاء المرأة',
        'حذاء الفتاة',
        'أحذية الركبة العالية',
        'حذاء مصاب'
    ],
    '👑': [
        'التاج',
        ':crown:',
        'الملك',
        'الملكة',
        'الأمير',
        'ملكي',
        'الأميرة',
        ':gold:',
        ':yellow:'
    ],
    '👒': [
        'قبعة',
        ':hat:',
        'قبعة النساء',
        'قبعة مع القوس',
        'قبعة سيداتي'
    ],
    '🎩': [
        'القبعة العليا',
        ':top_hat:',
        'ملابس رسمية',
        'Groom',
        ':black:'
    ],
    '🎓': [
        'الحد الاقصى للتخرج',
        ':graduation_cap:',
        'الكلية',
        'الخريج',
        'لوحة الهاون',
        'الجامعة',
        'الحد الأكاديمي المربع',
        ':black:'
    ],
    '🧢': [
        'الحد الاقصى للفواتير',
        ':billed_cap:',
        'قبعة البيسبول'
    ],
    '⛑️': [
        'خوذة مع الصليب الأبيض',
        ':helmet_with_white_cross:',
        ':helmet_with_cross:',
        ':rescue_worker_helmet:',
        ':rescue_workers_helmet:',
        'خوذة عمال الإنقاذ',
        ':red:',
        ':white:'
    ],
    '💼': [
        'حفل',
        ':briefcase:',
        'حقيبة'
    ],
    '🎖️': [
        'الميدالية العسكرية',
        ':military_medal:',
        ':medal:',
        'ميدالية',
        'ميداليون',
        'الديكور العسكري'
    ],
    '📿': [
        'صلاة بيدز',
        ':prayer_beads:',
        'ديكر بيدز',
        'روزري بيدز'
    ],
    '🎗️': [
        'تذكير ريبو',
        ':reminder_ribbo:'
    ],
    '🤿': [
        'قناع الغوص',
        ':diving_mask:'
    ],
    '🦺': [
        'سترة الأمان',
        ':safety_vest:'
    ],
    '🥻': [
        'ساري',
        ':sari:',
        'ساري',
        'شاري'
    ],
    '🩲': [
        'موجز',
        ':briefs:'
    ],
    '🩳': [
        'الاختصارات',
        ':shorts:'
    ],
    '🛼': [
        'تزلج متزلج',
        ':roller_skate:',
        'تزلج مضمن',
        'الدربي المليء'
    ],
    '🩴': [
        'انقلب الفلاش',
        ':flip_flop:',
        'ثونغ ساندال'
    ],
    '🪖': [
        'خوذة عسكرية',
        ':military_helmet:'
    ],
    '🩰': [
        'أحذية المحفظة',
        ':ballet_shoes:',
        'حذاء نقطة'
    ],
    '🩼': [
        'Crutch',
        ':crutch:'
    ]
};
/*hands and parts of body*/
emojis_language[lang][12] = {
    '👋{{skin_tone}}': [
        'تحميل علامة اليد',
        ':wave:',
        ':waving_hand:',
        'وداعا',
        'موجة اليد',
        'مرحبا',
        'Hi'
    ],
    '🖐️{{skin_tone}}': [
        'اليد مع الأصابع التي لوحظت',
        ':hand_splayed:',
        ':raised_hand_with_fingers_splayed:',
        ':hand_with_fingers_splayed:',
        'خمسة يهود',
        'اليد الملعوبة',
        'رفعت اليد بالأصابع التي لوحظت'
    ],
    '🤚{{skin_tone}}': [
        'رجوع اليدين',
        ':raised_back_of_hand:',
        ':back_of_hand:',
        'الخلفية'
    ],
    '✋{{skin_tone}}': [
        'يرفع اليد',
        ':raised_hand:',
        ':hand:',
        'عالي 5',
        'توقف'
    ],
    '🖖{{skin_tone}}': [
        'Vulcan Salute',
        ':vulcan_salute:',
        'Spock',
        'شجرة النجوم',
        'رفعت اليد مع جزء بين أصابع الوسط والخاتم'
    ],
    '👌{{skin_tone}}': [
        'حسن توقيع اليد',
        ':ok_hand:',
        'حسنًا',
        'ممتاز',
        'نعم'
    ],
    '✌️{{skin_tone}}': [
        'يدوي النصر',
        ':victory_hand:',
        'أسعار الهواء',
        'لافتة السلام',
        'علامة V'
    ],
    '🤞{{skin_tone}}': [
        'أصابع متقاطعة',
        ':crossed_fingers:',
        'أصابع متقاطعة',
        'حظاً سعيداً',
        'اليد مع الفهرس و الأصابع الوسطى'
    ],
    '🤟{{skin_tone}}': [
        'إيماءة الحب',
        ':love_you_gesture:',
        ':i_love_you_hand_sign:',
        'أنا أحبك توقيع اليد'
    ],
    '🤘{{skin_tone}}': [
        'علامة القرن',
        ':the_horns:',
        ':sign_of_the_horns:',
        ':metal:',
        'أصابع الشرير',
        'معدن ثقيل',
        'تشغيل الروك'
    ],
    '🤙{{skin_tone}}': [
        'اتصل بي توقيع اليد',
        ':call_me_hand:',
        ':call_me:',
        'اليد الهاتفية',
        'شاكا'
    ],
    '🤏{{skin_tone}}': [
        'تمزيق اليد',
        ':pinching_hand:'
    ],
    '👈{{skin_tone}}': [
        'مؤشر الدليل الخلفي لليسار',
        ':backhand_index_pointing_left:',
        ':point_left:',
        'مؤشر النقاط اليسرى البيضاء'
    ],
    '👉{{skin_tone}}': [
        'مؤشر الدليل الخلفي يمين',
        ':backhand_index_pointing_right:',
        ':point_right:',
        'مؤشر نقطة اليمين البيضاء الخلفية'
    ],
    '👆{{skin_tone}}': [
        'مؤشر الخلفية إلى الأعلى',
        ':point_up_2:',
        ':backhand_index_pointing_up:',
        'الفهرس اليدوي الأبيض الذي يشير إلى الخلفية',
        'الاصبع الأوسط'
    ],
    '👇{{skin_tone}}': [
        'مؤشر الدليل الخلفي للأسفل',
        ':point_down:',
        ':backhand_index_pointing_down:',
        'مؤشر نقطة أسفل بيضاء',
        'الإشارة إلى الأسفل'
    ],
    '☝{{skin_tone}}': [
        'فهرس نقطة الاصبع للأعلى',
        ':point_up:',
        ':index_pointing_up:',
        'مؤشر النقاط الأبيض',
        'سرية'
    ],
    '🖕{{skin_tone}}': [
        'الاصبع الأوسط',
        ':middle_finger:',
        'قلب الطائر',
        'اصبع مصنوع',
        'عكس اليد مع توسعة الاصبع الأوسط'
    ],
    '👍{{skin_tone}}': [
        'تسجيل الإتصال',
        ':thumbs_up_sign:',
        'إعجاب',
        'نعم'
    ],
    '👎{{skin_tone}}': [
        'لافتة تبويب للأسفل',
        ':thumbs_down_sign:',
        'سيء',
        'Dislike',
        'لا'
    ],
    '✊{{skin_tone}}': [
        'رفعت قبضة',
        ':raised_fist:',
        'مضخة فضائية'
    ],
    '👊{{skin_tone}}': [
        'قبضة قادمة',
        ':oncoming_fist:',
        'Bro Fist',
        'Brofist',
        'ضربة قاضية',
        'حبس',
        'قبضة مغلقة',
        'لوحة اليد المكوّنة'
    ],
    '🤛{{skin_tone}}': [
        'ضربة من اليسار',
        ':left_fist_bump:'
    ],
    '🤜{{skin_tone}}': [
        'ضربة من الوجهة اليمنى',
        ':right_fist:bump:'
    ],
    '🤌{{skin_tone}}': [
        'أصابع مبطنة',
        ':pinched_fingers:',
        'Ma Che Vuoi',
        'تنقية الأصابع'
    ],
    '👏{{skin_tone}}': [
        'علامة تصفيق الأيدي',
        ':cap:',
        ':clapping_hands:',
        'إيقاف',
        'Clap',
        'التصفيق',
        'جلف الغولف',
        'جولة من التوقف'
    ],
    '🙌{{skin_tone}}': [
        'شخص يربي كلا اليد في الاحتفال',
        ':raised_hands:',
        ':raising_hands:',
        'تربية الأيدي',
        'الأسلحة في الجو',
        'Banzai',
        'معجزة المهرجان',
        'Hallelujah',
        'امتدح اليدين',
        'يدان'
    ],
    '👐{{skin_tone}}': [
        'فتح تسجيل اليد',
        ':open_hands_sign:',
        'ضغطة',
        'يد الجاز'
    ],
    '🤲{{skin_tone}}': [
        'نخيل معا',
        ':palms_up_together:',
        'Dua'
    ],
    '🤝{{skin_tone}}': [
        'Handshake',
        ':handshake:',
        'الأيدي المهزجة'
    ],
    '🙏{{skin_tone}}': [
        'الأيدي المطولة',
        ':folded_hands:',
        'Namaste',
        'من فضلك',
        'الصلاة',
        'شكرا لك',
        'شخص ذو يدي مفضلة'
    ],
    '✍{{skin_tone}}': [
        'كتابة اليد',
        ':writing_hand:'
    ],
    '🫱{{skin_tone}}': [
        'اليد اليمينية',
        ':rightwards_hand:'
    ],
    '🫲{{skin_tone}}': [
        'اليد اليسرى',
        ':leftwards_hand:'
    ],
    '🫳{{skin_tone}}': [
        'هيد نخيل داون',
        ':palm_down_hand:'
    ],
    '🫴{{skin_tone}}': [
        'نخيل أوب يد',
        ':palm_up_hand:'
    ],
    '🫰{{skin_tone}}': [
        'اليد مع فهرس الأصابع و Thumb تقاطع',
        ':hand_with_index_finger_and_thumb_crossed:'
    ],
    '🫵{{skin_tone}}': [
        'نقاط الفهرس في العارض',
        ':index_pointing_at_the_viewer:'
    ],
    '🫶{{skin_tone}}': [
        'أيادي القلب',
        ':heart_hands:',
        'حب'
    ],
    '💪{{skin_tone}}': [
        'مبيدات مربوطة',
        ':flexed_biceps:',
        'عضلات الذراع الملتهبة',
        'Musle',
        'قوي'
    ],
    '🦵{{skin_tone}}': [
        'ساق',
        ':leg:'
    ],
    '🦶{{skin_tone}}': [
        'القدم',
        ':foot:'
    ],
    '👂{{skin_tone}}': [
        'إينو',
        ':ear:',
        'اليارز',
        'سماع',
        'الاستماع'
    ],
    '👃{{skin_tone}}': [
        'الأنف',
        ':nose:',
        'التهميم',
        'التشتت',
        'Stinky'
    ],
    '🦻{{skin_tone}}': [
        'مع معونة السمع',
        ':ear_with_hearing_aid:'
    ],
    '🧠': [
        'الدماغ',
        ':brain:',
        ':pink:'
    ],
    '🦷': [
        'أسنان',
        ':tooth:',
        ':white:'
    ],
    '👀': [
        'العيون',
        ':eyes:',
        'كرات العين',
        'عيون متقطعة',
        'عيون حكيمة'
    ],
    '👁️': [
        'العين',
        ':eye:',
        'عين واحد'
    ],
    '👅': [
        'النغمة',
        ':tongue_out:',
        ':red:'
    ],
    '👄': [
        'الفم',
        ':mouth:',
        'كيس الشفاه',
        'الشفاه',
        ':red:'
    ],
    '🫦': [
        'شفة الخنزير',
        ':biting_lip:',
        'الشفاه',
        ':red:'
    ],
    '🫀': [
        'القلب التشريحي',
        ':anatomical_heart:',
        ':red:'
    ],
    '🫁': [
        'الرهانات',
        ':lungs:',
        ':red:'
    ],
    '🦾': [
        'الذراع الميكانيكية',
        ':mechanical_arm:',
        'قوي',
        ':gray:',
        ':grey:'
    ],
    '🦿': [
        'ساق ميكانيكي',
        ':mechanical_leg:',
        ':gray:',
        ':grey:'
    ],
    '💅{{skin_tone}}': [
        'البولندية المسالمة',
        ':nail_polish:',
        'أصابع',
        'Manicure',
        'Nonchalant'
    ],
    '🤳{{skin_tone}}': [
        'سيلفي',
        ':selfie:',
        'كاميرا الهاتف',
        'سيلفي يد'
    ]
};
/*other*/
emojis_language[lang][13] = {
    '💩': [
        'ملف من Poo',
        ':pile_of_poo:',
        'قرون الكلب',
        'نقطة الابتسامة',
        ':brown:'
    ],
    '💋': [
        'علامة القلاب',
        ':kiss_mark:',
        'كيس الشفاه',
        ':red:'
    ],
    '🦴': [
        'عظام',
        ':bone:'
    ],
    '🧳': [
        'حقائب',
        ':luggage:',
        'حقيبة'
    ],
    '🌂': [
        'مظلة مغلقة',
        ':closed_umbrella:',
        'مظلة معطلة',
        'مظلة وردية',
        ':pink:',
        ':purple:'
    ],
    '☂️': [
        'مظلة',
        ':umbrella:',
        ':purple:'
    ],
    '☔': [
        'مظلة مع قطرات المطر',
        ':umbrella_with_rain_drops:',
        ':umbrella:',
        'المطر',
        'Rainy'
    ],
    '🧵': [
        'مجموعة من المواضيع',
        ':spool_of_thread:'
    ],
    '🧶': [
        'كرة يارن',
        ':ball_of_yarn:'
    ],
    '💄': [
        'Lipstick',
        ':lipstick:',
        'خسر الشفاه',
        'كياج',
        ':red:'
    ],
    '💍': [
        'خاتم',
        ':ring:',
        'خاتم الماس',
        'خاتم المشاركة'
    ],
    '💎': [
        'حجر جوهري',
        ':gem_stone:',
        'الماس',
        'جوهرة',
        'غيمستون',
        'جويل',
        ':blue:'
    ],
    '💥': [
        'رمز التصادم',
        ':collision_symbol:',
        'انفجار',
        'شفرة',
        'التأثير',
        'زحف أحمر',
        'انفجار'
    ],
    '💫': [
        'رمز ديتزي',
        ':dizzy_symbol:',
        'دائرة ونجمة',
        ':yellow:'
    ],
    '💦': [
        'شفرة الرموز الحلاقة',
        'قطرات عرقية',
        'قطرات عرقية',
        'زحف',
        'تفريغ الماء',
        'قطرات المياه',
        ':blue:'
    ],
    '💨': [
        'التقطيع بعيدا',
        ':dashing_away:',
        'سريع',
        'ستيم',
        'التلاعب',
        'الريح',
        'رمز داش',
        'زخم الرياح'
    ],
    '🌬️': [
        'وجه الريح',
        ':wind_face:',
        'الرياح المشتعلة',
        'الطبيعة الأم',
        'وجه الريح الدافئة',
        ':white:'
    ],
    '🐾': [
        'الطباعة الباطنية',
        ':paw_prints:',
        'طباعة وعاء القطط',
        'الطباعة الباطنية للكلب',
        'طباعة البقعة',
        'طباعة باك الدب'
    ],
    '🕸️': [
        'شبكة العنكبوت',
        ':spider_web:',
        'كوبويب',
        'ويب',
        'شبكة العنكبوت'
    ],
    '🦠': [
        'مايكروبي',
        ':microbe:',
        'خلية',
        'فيروس كورونا',
        'COVID-19',
        'جرس',
        'الكائنات المجهرية',
        'فيروس',
        ':green:'
    ],
    '💐': [
        'باقة الزهور',
        ':bouquet_of_flowers:'
    ],
    '🌍': [
        'الظهور العالمي لأوروبا - أفريقيا',
        ':globe_showing_europe_africa:',
        ':earth_africa:',
        'الأرض',
        'غلوب',
        'كوكب',
        'العالم',
        'الظهور العالمي لأوروبا وأفريقيا',
        ':blue:'
    ],
    '🌎': [
        'الكرة الأرضية تظهر الأمريكيتين',
        ':globe_showing_americas:',
        ':earth_americas:',
        'الأرض',
        'غلوب',
        'كوكب',
        'العالم',
        ':blue:'
    ],
    '🌏': [
        'غلوب عرض آسيوي - أستراليا',
        ':globe_showing_asia_australia:',
        ':earth_asia:',
        'الأرض',
        'غلوب',
        'كوكب',
        'العالم',
        'عرض عالمي لآسيا وأستراليا',
        ':blue:'
    ],
    '🌐': [
        'أرضية مع مريديان',
        ':globe_with_meridians:',
        'الإنترنت',
        'الشبكة العالمية',
        'WWW'
    ],
    '🌑': [
        'رمز القمر الجديد',
        ':new_moon:',
        'القمر المظلم',
        'قمر الظل',
        'كتلة شمسية',
        ':black:'
    ],
    '🌒': [
        'رموز هلال الهلال الجاهز',
        ':waxing_crescent_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌓': [
        'رمز الربع الأول من القمر',
        ':first_quarter_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌔': [
        'رموز القمر المتحرك',
        ':moon:',
        ':waxing_gibbous_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌕': [
        'رمز القمر الكامل',
        ':full_moon:',
        ':yellow:'
    ],
    '🌖': [
        'رمز قمري مرتجل',
        ':waning_gibbous_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌗': [
        'رمز الربع الأخير من القمر',
        ':last_quarter_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌘': [
        'رمز هلال الهلال المرغوب',
        ':waning_crescent_moon:',
        ':yellow:',
        ':black:'
    ],
    '🌙': [
        'قمر الهلال',
        ':crescent_moon:',
        ':yellow:'
    ],
    '🌚': [
        'قمر جديد مع وجه',
        ':new_moon_with_face:',
        'القمر المخيف',
        'وجه القمر المظلم',
        'مولستر مون',
        ':black:',
        ':gray:',
        ':grey:'
    ],
    '🌝': [
        'القمر الكامل بالوجه',
        ':full_moon_with_face:',
        'Moonface',
        'القمر المبتسم',
        'القمر المبتسم',
        ':yellow:'
    ],
    '🌛': [
        'الربع الأول من القمر بالوجه',
        ':first_quarter_moon_with_face:',
        ':first_quarter_moon_face:',
        ':yellow:'
    ],
    '🌜': [
        'الربع الأخير من القمر بالوجه',
        ':last_quarter_moon_with_face:',
        ':last_quarter_moon_face:',
        ':yellow:'
    ],
    '🌞': [
        'الشمس بالوجه',
        ':sun_with_face:',
        'الشمس المبتسمة',
        'Sunface',
        'الشمس المبتسمة',
        ':yellow:'
    ],
    '☀️': [
        'الشمس',
        ':sun:',
        'الشمس',
        ':yellow:'
    ],
    '⭐': [
        'نجوم',
        ':star:',
        'النجم الأبيض المتوسط',
        ':yellow:'
    ],
    '🌟': [
        'نجم متهرج',
        ':glowing_star:',
        'نجمة مشرقة',
        ':yellow:'
    ],
    '☁️': [
        'السحابة',
        ':cloud:',
        'غيوم',
        'الإغلاق',
        ':white:'
    ],
    '⛅': [
        'الشمس خلف السحابة',
        ':thunder_cloud_and_rain:',
        ':thunder_cloud_rain:',
        ':cloud_with_lightning_and_rain:',
        ':white:'
    ],
    '⛈️': [
        'السحابة مع البرق والمطر',
        ':thunder_cloud_and_rain:',
        ':thunder_cloud_rain:',
        ':cloud_with_lightning_and_rain:',
        'سحابة الرعد والأمطار',
        ':white:'
    ],
    '🌤️': [
        'الشمس البيضاء مع سحابة صغيرة',
        ':mostly_sunny:',
        ':sun_behind_small_cloud:',
        ':sun_small_cloud:',
        ':white_sun_small_cloud:',
        ':white_sun_with_small_cloud:',
        ':white:'
    ],
    '🌥️': [
        'الشمس خلف السحابة الكبيرة',
        ':sun_behind_large_cloud:',
        'الشمس البيضاء خلف السحابة',
        ':white:'
    ],
    '🌦️': [
        'الشمس البيضاء خلف السحابة مع المطر',
        ':sun_behind_rain_cloud:',
        ':partly_sunny_rain:',
        ':white_sun_rain_cloud:',
        ':white_sun_behind_cloud_with_rain:',
        ':white:'
    ],
    '🌧️': [
        'السحابة مع المطر',
        ':cloud_with_rain:',
        ':white:'
    ],
    '🌨️': [
        'سحابة مع الثلج',
        ':cloud_with_snow:',
        ':white:'
    ],
    '🌩️': [
        'السحابة مع البرق',
        ':cloud_with_lightning:',
        ':white:'
    ],
    '🌪️': [
        'تورنادو',
        ':tornado:',
        'السحابة مع تورنادو'
    ],
    '🌫️': [
        'Fog',
        ':fag:',
        ':white:',
        ':gray:',
        ':grey:'
    ],
    '🌈': [
        'قوس قزح',
        ':rainbow:',
        'فخر المثليين',
        'قوس قزح أساسي',
        'LGBTQIA+',
        'LGBT+'
    ],
    '❄️': [
        'ندفة الثلج',
        ':snowflake:',
        'الثلج',
        'ثلج',
        ':white:'
    ],
    '🌀': [
        'إعصار',
        ':cyclone:',
        'الإعصار',
        'حلزوني',
        'سورل',
        'تورنادو'
    ],
    '⚡': [
        'علامة فولطية عالية',
        ':high_voltage_sign:',
        'برج البرق',
        'ثيندربولت',
        'فولتية عالية'
    ],
    '☃️': [
        'رجل الثلج',
        ':snowman:',
        'رجل الثلج برقائق الثلج',
        ':white:'
    ],
    '⛄': [
        'رجل ثلج بدون ثلج',
        'رجل الثلج بدون الثلج',
        ':snowman:',
        'رجل الثلج الفروستي',
        'Olaf',
        'رجل الثلج',
        ':white:'
    ],
    '☄️': [
        'مذنب',
        ':comet:'
    ],
    '🔥': [
        'النار',
        ':fire:',
        'شعلة',
        'ساخن',
        'Lit',
        'سنابستاك',
        ':red:'
    ],
    '💧': [
        'Droplet',
        ':droplet:',
        'الماء',
        'قطرة المياه',
        ':blue:'
    ],
    '✨': [
        'البانكلس',
        ':sparkles:',
        'براقة',
        'Shiny',
        'جديد'
    ],
    '🌊': [
        'موجة المياه',
        ':water_wave:',
        'شاطئ',
        'موجة المحيط',
        'البحر',
        ':blue:'
    ],
    '🎄': [
        'شجرة عيد الميلاد',
        'شجرة عيد الميلاد',
        'عيد الميلاد',
        'شجرة عيد الميلاد',
        ':green:'
    ],
    '🎃': [
        'فانوس جاك-O-',
        'فانوس',
        'Halloween',
        'اليقطين',
        ':orange:'
    ],
    '🌻': [
        'زهرة الشمس',
        ':sunflower:',
        'زهرة أصفر',
        ':yellow:'
    ],
    '🌼': [
        'Blossom',
        ':blossom:',
        'زهرة مهزولة',
        'Daisy',
        'زهرة أصفر',
        ':yellow:'
    ],
    '🌷': [
        'Tulip',
        ':tulip:',
        ':pink:'
    ],
    '🌹': [
        'وردة الزهور',
        ':rose_flower:',
        'وردة حمراء',
        ':red:'
    ],
    '☘️': [
        'شامروك',
        ':shamrock:',
        'البرسيم',
        'تريفويل',
        ':green:'
    ],
    '🍀': [
        'برسيم أربعة أوراق',
        ':four_leaf_clover:',
        'البرسيم',
        'آيرلندا',
        'محظوظ',
        'ثروة',
        ':green:'
    ],
    '🌸': [
        'Cherry Blossom',
        ':cherry_blossom:',
        'زهرة وردية',
        'Sakura',
        ':pink:'
    ],
    '💮': [
        'زهرة بيضاء',
        ':white_flower:',
        'Cherry Blossom',
        'ورق بشكل دوري',
        'وسام حسنًا',
        ':white:'
    ],
    '🌺': [
        'Hibiscus',
        ':hibiscus:',
        ':red:'
    ],
    '🏵️': [
        'روزيت',
        ':rosette:',
        ':orange:',
        ':yellow:'
    ],
    '🌱': [
        'البذور',
        ':seedling:',
        'الربيع',
        'Sprout',
        'النبض',
        ':green:'
    ],
    '🌲': [
        'شجرة Evergreen',
        ':evergreen_tree:',
        'شجرة فاير',
        'شجرة اسطر',
        ':green:'
    ],
    '🌳': [
        'شجرة خادعة',
        ':deciduous_tree:',
        'شجرة مدورة',
        ':green:'
    ],
    '🌴': [
        'شجرة النخيل',
        ':palm_tree:',
        'شجرة جوز الهند',
        ':green:'
    ],
    '🎋': [
        'شجرة تانباتا',
        ':tanabata_tree:',
        'Tanabata',
        'نتمنى الشجرة'
    ],
    '🎍': [
        'زخرفة الأنسجة',
        ':pine_decoration:',
        'خيزران',
        'كادوماتسو',
        'زخرفة السنة الجديدة'
    ],
    '🌵': [
        'Cactus',
        ':cactus:',
        'Desert',
        ':green:'
    ],
    '🌾': [
        'شيف الأرز',
        ':sheaf_of_rice:',
        'محاصيل',
        'المزرعة',
        'قمح',
        'نوع الأرز'
    ],
    '🌿': [
        'عشب',
        ':herb:',
        'محاصيل',
        'النبات',
        ':green:'
    ],
    '🍁': [
        'أوراق المقطوعة',
        ':maple_leaf:',
        'كندا',
        'كندي',
        'عربة',
        ':brown:'
    ],
    '🍂': [
        'أوراق التسرب',
        ':fallen_leaf:',
        'ورقة الخريف',
        'أوراق الخريف',
        'أوراق البناء',
        'أوراق الخريف',
        'اوراق سقوط',
        ':brown:'
    ],
    '🍃': [
        'ورق الملوثة في الرياح',
        ':leaf_fluttering_in_wind:',
        ':leaves:',
        'أوراق خضراء',
        'الربيع',
        ':green:'
    ],
    '🪴': [
        'النباتات المحطة',
        ':potted_plant:',
        ':green:'
    ],
    '🪸': [
        'المرجان',
        ':coral:',
        'تغير المناخ'
    ],
    '🪷': [
        'لوتس',
        ':lotus:',
        'نقاء',
        'الجمال',
        'الهدوء',
        'الهدوء'
    ],
    //"🪻": ["Hyacinth", ":hyacinth:", "Purple flower", ":purple:"],
    //"🫛": ["Pea Pod", ":pea_pod:", ":green:"],
    //"🫚": ["Ginger root", ":ginger:", "Spice", "Flavour", ":brown:"],
    '🔑': [
        'المفتاح',
        ':key:',
        'مفتاح الذهب',
        ':gold:',
        ':yellow:'
    ],
    '🗝️': [
        'المفتاح القديم',
        ':old_key:',
        ':brown:'
    ],
    '🔨': [
        'مطرقة',
        ':hammer:',
        'مطرقة الشرف',
        'Handyman',
        'أداة'
    ],
    '⛏️': [
        'اختر',
        ':pick:',
        'فأس'
    ],
    '🪓': [
        'فأس',
        ':axe:',
        'firefighter'
    ],
    '🪚': [
        'صهر النجارة',
        ':carpentry_saw:'
    ],
    '🪛': [
        'مفكك الشاشة',
        ':screwdriver:'
    ],
    '🪝': [
        'ربط',
        ':hook:'
    ],
    '🪠': [
        'Plunger',
        ':plunger:'
    ],
    '🪣': [
        'دلو',
        ':bucket:'
    ],
    '🔩': [
        'بوت و بولت',
        ':nut_and_bolt:',
        'بولت',
        'طاقم',
        ':gray:',
        ':grey:'
    ],
    '🗜️': [
        'مصباح',
        ':clamp:',
        'الجدول نائب الرئيس',
        'WinZip',
        'ضغط',
        ':gray:',
        ':grey:'
    ],
    '🔒': [
        'مقفل',
        ':locked:',
        'قفل مغلق',
        'قفل'
    ],
    '🔓': [
        'فتح',
        ':unlocked:',
        'فتح Padlock',
        'فتح القفل'
    ],
    '🔏': [
        'مقفل مع القلم',
        ':locked_with_pen:',
        'قفل وقلم',
        'قفل مع قلم النافذة',
        'قفل بواسطة قلم الحبر'
    ],
    '🔐': [
        'مقفل مع المفتاح',
        ':locked_with_key:',
        'إغلاق القفل باستخدام المفتاح'
    ],
    '🗡️': [
        'Dagger',
        ':dagger:',
        'سلاح سكين',
        ':gray:',
        ':grey:'
    ],
    '⚔️': [
        'سيف متقاطع',
        ':crossed_swords:',
        ':gray:',
        ':grey:'
    ],
    '🔫': [
        'Pistol',
        ':pistol:',
        'بندقية',
        'مسدس',
        'بندقية قنبلة',
        'بندقية المياه',
        'مسدس الماء'
    ],
    '🧰': [
        'صندوق الأدوات',
        ':toolbox:',
        ':red:'
    ],
    '🧲': [
        'المغناطيس',
        ':magnet:',
        ':red:'
    ],
    '⛓️': [
        'السلاسل',
        ':chains:'
    ],
    '💉': [
        'Syringe',
        ':syringe:',
        'التبرع بالدم',
        'اختبار الدم',
        'إحتياطي',
        'التطعيم',
        'blood',
        'sick',
        'ill'
    ],
    '🧬': [
        'حمض',
        ':dna:',
        'هيلكس الحمض النووي المزدوج'
    ],
    '🧪': [
        'أنبوب اختبار',
        ':test_tube:',
        ':green:'
    ],
    '🛏️': [
        'سرير',
        ':bed:',
        'غرفة نوم'
    ],
    '🛋️': [
        'أريكة و مصباح',
        ':couch_and_lamp:',
        'صالة',
        'مستوي',
        'سوفا'
    ],
    '🪑': [
        'الرئيس',
        ':chair:'
    ],
    '🚪': [
        'باب',
        ':door:',
        'البوابة',
        'الباب الأمامي'
    ],
    '🪟': [
        'النافذة',
        ':window:'
    ],
    '🪜': [
        'سلّم',
        ':ladder:'
    ],
    '🪞': [
        'مرآة',
        ':mirror:'
    ],
    '🚽': [
        'مرحاض',
        ':toilet:',
        'حمام',
        'الشعار',
        'ريستوم',
        'WC',
        ':white:'
    ],
    '🚿': [
        'مشاهدة',
        ':shower:',
        'رأس الشاشة',
        ':shower:'
    ],
    '🛁': [
        'حوض الاستحمام',
        ':bathtub:',
        'حمام الفقاعات',
        ':shower:'
    ],
    '🧴': [
        'زجاجة الحب',
        ':location_bottle:'
    ],
    '🧷': [
        'دبوس الأمان',
        ':safety_pin:',
        ':gray:',
        ':grey:'
    ],
    '🧺': [
        'سلة',
        ':basket:',
        ':brown:'
    ],
    '🧻': [
        'قائمة الورق',
        ':roll_of_paper:',
        'ورق المراحيض',
        ':white:'
    ],
    '🧼': [
        'شريط الصابون',
        ':bar_of_soap:'
    ],
    '🧽': [
        'سبونج',
        ':sponge:',
        ':yellow:'
    ],
    '🧯': [
        'إطفاء النار',
        ':fire_extinguisher:',
        ':red:'
    ],
    '🚬': [
        'السجائر',
        ':cigarette:',
        'رمز الدخان'
    ],
    '⚰️': [
        'الكعكة',
        ':coffin:',
        'Casket',
        'دفن',
        ':brown:'
    ],
    '⚱️': [
        'قرن الدفن',
        ':funeral_urn:',
        'فتحة'
    ],
    '🛡️': [
        'درع',
        ':shield:'
    ],
    '⚙️': [
        'عتاد',
        ':gear:',
        'الإعدادات',
        'خيارات',
        ':gray:',
        ':grey:'
    ],
    '⚖️': [
        'مقياس الرصيد',
        ':balance_scale:',
        'مقاييس العدالة'
    ],
    '🔗': [
        'رابط',
        ':link:',
        'سلسلة',
        'رابط هائل',
        'سلسلة مرتبطة',
        ':gray:',
        ':grey:'
    ],
    '💀': [
        'جمجمة',
        ':skull:',
        'الموت',
        'جمجمة رمادية',
        'الهيكل',
        ':white:'
    ],
    '☠️': [
        'الجمجمة و العظام',
        ':skull_and_crossbones:',
        ':white:'
    ],
    '🎡': [
        'عجلة فيري',
        ':ferris_wheel:',
        'عجلة كبيرة',
        'Fairgroundl',
        'عجلة الملاحظة'
    ],
    '⛽': [
        'مضخة الوقود',
        'الوقود:',
        'نفط',
        'البترول',
        'الغاز',
        ':red:'
    ],
    '🚨': [
        'الضوء الدائر لسيارات الشرطة',
        ':rotating_light:',
        ':police_police_car:',
        'ضوء الطوارئ',
        'الضوء الوامض',
        'Siren',
        ':red:'
    ],
    '🚥': [
        'ضوء مرور أفقي',
        ':horizontal_traffic_light:',
        ':green:',
        ':red:',
        ':yellow:',
        ':orange:'
    ],
    '🚦': [
        'ضوء حركة المرور الرأسية',
        ':vertical_traffic_light:',
        ':green:',
        ':red:',
        ':yellow:',
        ':orange:'
    ],
    '⚓': [
        'مرساة نمط المدير',
        ':anchor:',
        'صياد الأسماك'
    ],
    '🚧': [
        'علامة البناء',
        ':construction_sign:',
        'لافتة مخططة سوداء وأصفر',
        ':yellow:',
        ':black:'
    ],
    '🪂': [
        'Parachute',
        ':parachute:'
    ],
    '💺': [
        'مقعد',
        ':seat:',
        'طائرة قطار حافلة الطيران'
    ],
    '🪐': [
        'زحل',
        ':saturn:'
    ],
    '🎆': [
        'ألعاب نارية',
        ':fireworks:',
        'انفجار'
    ],
    '🎇': [
        'Senko Hanabi',
        ':senko_hanabi:',
        'معمل الألعاب النارية'
    ],
    '💷': [
        'عقدة جنيه بنكي',
        ':pound:',
        ':pound_banknote:',
        'ملاحظة 20 جنيه استرليني',
        'ملاحظة عشرون حالة',
        'بانقود مع تسجيل الجنيه الأسترليني',
        ':purple:'
    ],
    '💶': [
        'Euro Banknote',
        ':euro:',
        ':euro_banknote:',
        '100 يورو ملاحظة',
        'بنك عقدة مع علامة اليورو',
        ':blue:'
    ],
    '💵': [
        'عملة بالدولار',
        ':dollar:',
        ':dollar_banknote:',
        '$1 ملاحظة',
        'بانكوك مع علامة الدولار',
        'فاتورة الدولار',
        'دولار أمريكي',
        ':green:'
    ],
    '💴': [
        'ين بانبورت',
        ':yen:',
        ':yen_banknote:',
        'Y 1000 ملاحظة',
        'ين نوتس',
        'بنك عقدة مع عين توقيع',
        ':yellow:'
    ],
    '⛺': [
        'خيمة المخيم',
        ':camping_tent:'
    ],
    '⛲': [
        'نافورة',
        ':fountain:',
        'خاصية المياه',
        'نافورة المياه',
        'حديقة'
    ],
    '💰': [
        'حقيبة المال',
        ':money_bag:',
        'أكياس النقود',
        'غني',
        '$'
    ],
    '💸': [
        'المال مع أجنحة',
        ':money_with_wings:',
        'أموال طيران',
        ' فقدان المال'
    ],
    '🏷️': [
        'علامة التسمية',
        ':label_tag:'
    ],
    '🔖': [
        'إشارة',
        ':bookmark:',
        'علامة السعر',
        'وسم'
    ],
    '📑': [
        'علامات التبويب المرجعية',
        ':bookmark_tabs:',
        ':white:'
    ],
    '📯': [
        'قرن بريدي',
        ':postal_horn:',
        'Bugle',
        'قرن فرنسي'
    ],
    '🪁': [
        'كيت',
        ':kite:',
        ':purple:'
    ],
    '🪀': [
        'يو',
        ':yo_yo:',
        ':yo-yo:'
    ],
    '🎊': [
        'Confetti Ball',
        ':confetti_ball:',
        'Confetti'
    ],
    '🎉': [
        'حفلة منحازة',
        ':party_popper:',
        'الاحتفال',
        'قبعة الحفلة'
    ],
    '🎈': [
        'بالون',
        ':balloon:',
        'الحفل',
        'بالون أحمر',
        ':red:'
    ],
    '🌡️': [
        'مقياس الحرارة',
        ':thermometer:',
        'الطقس الساخن',
        'درجة',
        ':red:'
    ],
    '🛢️': [
        'برميل نفطي',
        ':oil_drum:'
    ],
    '💣': [
        'قنبلة',
        ':bomb:',
        'boom'
    ],
    '🔪': [
        'سكين المطبخ',
        ':kitchen_knife:',
        'سكين',
        'سكين البوتشرز',
        'Hocho'
    ],
    '🏺': [
        'Amphora',
        ':amphora:',
        'جار',
        'فتحة'
    ],
    '🗺️': [
        'خريطة العالم',
        ':world_map:'
    ],
    '🎼': [
        'النتيجة الموسيقية',
        ':musical_score:',
        'ورقة الموسيقى',
        'Treble Clef'
    ],
    '🎬': [
        'مجلس المصغّر',
        ':clapper_board:',
        'قطع',
        'اجراء',
        'مدير',
        'قائمة الأفلام'
    ],
    '🎻': [
        'العود',
        ':violin:',
        'مجموعة المجموعة الرباعية',
        'العالم أصغر أشكال الحياة'
    ],
    '🎺': [
        'ترامبيت',
        ':trumpet:',
        'قرن',
        'الجاز'
    ],
    '🎸': [
        'غيتار',
        ':guitar:',
        'غيتار صوتي',
        'غويتار الكلاسيكي',
        'غيتار كهربائي'
    ],
    '🎷': [
        'ساكسوفون',
        ':saxophone:',
        'الجاز',
        'ساكس'
    ],
    '🥁': [
        'درام',
        ':drum:',
        'درام مع عصي البراميل'
    ],
    '🎹': [
        'بيانو',
        ':piano:',
        'لوحة المفاتيح الموسيقية',
        ':white:',
        ':black:'
    ],
    '🪕': [
        'بانجو',
        ':banjo:'
    ],
    '🪗': [
        'أكورديون',
        ':accordion:'
    ],
    '🪘': [
        'درام طويل',
        ':long_drum:'
    ],
    '🎨': [
        'لوحة الرسام',
        ':artist_palette:',
        'الفن',
        'الرسم'
    ],
    '🧩': [
        'قطع الألغاز',
        ':puzzle_piece:',
        'قطعة لغز جيغسو',
        ':green:'
    ],
    '🎲': [
        'موت اللعبة',
        ':game_die:',
        'النجدة',
        ':white:'
    ],
    '🎭': [
        'فنون الأداء',
        'فنون_الأداء',
        'المسرح',
        'المسرح',
        'أقنعة الدراما',
        'أقنعة المسرح اليوناني',
        'أقنعة مفجعة وكوميديا',
        'البندقية'
    ],
    '🔍': [
        'تكبير الزجاج المميت لليسار',
        ':mag:',
        ':magnifying_glass_tilted_left:',
        'Magnifier',
        'أيقونة البحث',
        'زجاج مكبر النقاط اليسرى',
        'البحث',
        ':transparent:'
    ],
    '🔎': [
        'تميل زجاج مكبر لليمين',
        ':mag_right:',
        ':magnifying_glass_tilted_right:',
        'Magnifier',
        'أيقونة البحث',
        'زجاج مكبر النقاط اليمنى',
        'البحث',
        ':transparent:'
    ],
    '⌛': [
        'تمهيد الزجاج',
        ':hourglass:',
        ':hourglass_done:',
        'زجاج'
    ],
    '⏳': [
        'الزجاج غير منجز',
        ':hourglass_flowing_sand:',
        ':hourglass_not_done:',
        'زجاج بالزجاج مع الرمال المتدفقة'
    ],
    '🕐': [
        'ساعة واحدة',
        ':clock1:',
        ':one_oclock:',
        'ساعة الوجه واحد OClock',
        ':gray:',
        ':grey:'
    ],
    '🕜': [
        'الساعة ثلاثون',
        ':clock130:',
        ':one_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕑': [
        'ساعتان OClock',
        ':clock2:',
        ':two_oclock:',
        'ساعة الوجه 2 ساعة',
        ':gray:',
        ':grey:'
    ],
    '🕝': [
        'الساعة الثانية والثلاثون',
        ':clock230:',
        ':two_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕒': [
        'ثلاث ساعات',
        ':clock3:',
        ':three_oclock:',
        'ساعة الواجهه الثالث',
        ':gray:',
        ':grey:'
    ],
    '🕞': [
        'الساعة الثالثة والثلاثون',
        ':clock330:',
        ':three_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕓': [
        'أربع ساعات',
        ':clock4:',
        ':four_oclock:',
        'ساعة الواجهة اربعة ساعات',
        ':gray:',
        ':grey:'
    ],
    '🕟': [
        'الساعة أربع-30',
        ':clock430:',
        ':four_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕔': [
        'خمس ساعات',
        ':clock5:',
        ':five_oclock:',
        'ساعة الوجه 5 ساعة',
        ':gray:',
        ':grey:'
    ],
    '🕠': [
        'ساعة الوجه الخمس-30',
        ':clock530:',
        ':five_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕕': [
        'ست ساعات',
        ':clock6:',
        ':size_oclock:',
        'ساعة الوجه 6 ساعة',
        ':gray:',
        ':grey:'
    ],
    '🕡': [
        'الساعة السادس-30',
        ':clock630:',
        ':six_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕖': [
        'سبعة OClock',
        ':clock7:',
        ':seven_oclock:',
        'ساعة الواجهة السابعة OClock',
        ':gray:',
        ':grey:'
    ],
    '🕢': [
        'الساعة السابعة والثلاثون',
        ':clock730:',
        ':sever_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕗': [
        'ثماني ساعات',
        ':clock8:',
        ':eight_oclock:',
        'الساعة الساعة 8 OClock',
        ':gray:',
        ':grey:'
    ],
    '🕣': [
        'الساعة 8 - 30',
        ':clock830:',
        ':eight_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕘': [
        'تسعة OClock',
        ':clock9:',
        ':nine_clock:',
        'ساعة الوجه 9 OClock',
        ':gray:',
        ':grey:'
    ],
    '🕤': [
        'واجهة 9 - 30 ساعة',
        ':clock930:',
        ':nine_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕙': [
        '10 OClock',
        ':clock10:',
        ':ten_oclock:',
        'الساعة 10 OClock',
        ':gray:',
        ':grey:'
    ],
    '🕥': [
        'الساعة 10 - 30',
        ':clock1030:',
        ':ten_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕚': [
        'Eleven OClock',
        ':click11:',
        ':eleven_oclock:',
        'ساعة الوجه 11 OClock',
        ':gray:',
        ':grey:'
    ],
    '🕦': [
        'الوجه 11-30',
        ':clock1130:',
        ':eleven_thirty:',
        ':gray:',
        ':grey:'
    ],
    '🕛': [
        'اثنا عشر ساعة',
        ':clock12:',
        ':twelve_oclock:',
        'ساعة الوجه 12 ساعة OClock',
        ':gray:',
        ':grey:'
    ],
    '🕧': [
        'واجهة اثنتين-30',
        ':clock1230:',
        ':twelve_thirty:',
        ':gray:',
        ':grey:'
    ],
    '♨️': [
        'الربيع الساخن',
        ':hot_springs:',
        'Onsen',
        'ستيم',
        ':red:'
    ],
    '💈': [
        'بولي البانر',
        ':barber_pole:',
        'متجر الشريط',
        'شرائط الباربر',
        'تصفيف الشعر',
        ':blue:',
        ':red:'
    ],
    '🎪': [
        'خيمة سيركس',
        ':circus_tent:',
        'أعلى كبير',
        'سيرك'
    ],
    '💢': [
        'رمز الغضب',
        ':anger_symbol:',
        'علامة الغضب',
        'بوبن فيين',
        ':red:'
    ],
    '🗯️': [
        'فقاعات الغضب الأيمن',
        ':right_anger_bubble:',
        ':anger_right:',
        'Zig Zag Bubble',
        'فقاعات الكلام الغاضبة',
        ':white:'
    ],
    '🗨️': [
        'Left Speech Bubble',
        ':left_speech_bubble:',
        ':speech_left:'
    ],
    '💊': [
        'Pill',
        ':pill:',
        'كابسول',
        'لوحي',
        'المخدرات',
        'Sick',
        'ill',
        ':yellow:',
        ':red:'
    ],
    '🎎': [
        'الدفعات',
        ':dolls:',
        'Hinamatsuri',
        'الدفعات الإمبراطورية',
        'الدولارات اليابانية'
    ],
    '🎏': [
        'تدفق السيارات',
        ':carp_streamer:',
        'علم السمك',
        'Koinobori',
        'جوارب الريح'
    ],
    '🎐': [
        'الريح Chime',
        ':wind_chime:',
        'Furin',
        'جلود',
        'رياح الجرس'
    ],
    '🎀': [
        'قوس الشريط',
        ':ribbon_bow:',
        'قوس وردي',
        'قوس',
        ':pink:'
    ],
    '🎁': [
        'هدية مغلفة',
        ':wrapped_gift:',
        'تاريخ الميلاد الحالي',
        'هدية عيد الميلاد',
        'هدية',
        'صندوق الهدايا',
        'حاضر',
        'هدية مغلفة'
    ],
    '🎫': [
        'التذكرة',
        ':ticket:',
        'ستايل التذكرة',
        'تذكرة الجولات العالمية'
    ],
    '🃏': [
        'فوك',
        ':joker:',
        'بطاقة المنصهر',
        'لعب البطاقة السوداء'
    ],
    '💡': [
        'مصباح فاتح',
        ':light_bulb:',
        'فكرة',
        'مصباح ضوء كهربائي'
    ],
    '🔦': [
        'ضوء الفلاش',
        ':flashlight:',
        'الشعلة',
        'شعلة كهربائية'
    ],
    '🏮': [
        'فانوس الورق الأحمر',
        ':izakaya_lantern:',
        ':lantern:',
        ':red_paper_lantern:',
        'فانوس آسيوي',
        'فانوس ياباني',
        'فانوس أحمر',
        'فانوس إيزاكايا',
        ':red:'
    ],
    '📦': [
        'حزمة',
        ':package:',
        'صندوق',
        'طرد',
        ':brown:'
    ],
    '📇': [
        'بطاقة الفهرسة',
        ':card_index:',
        'رولوديكس',
        'بطاقة النظام',
        'مؤشر البطاقة'
    ],
    '🕳️': [
        'فتحة',
        ':hole:',
        ':black:'
    ],
    '👁️‍🗨️': [
        'أنا شاهد',
        ':eye_in_speech_bubble:',
        ':eye_speech_bubble:',
        ':eye-in-speech-bubble:',
        'فقاعات العين في الكلام'
    ],
    '⚜️': [
        'Fleur-de-lis',
        ':fleur_de_lis:',
        'الكشافة',
        'قديسي نيو أورليانز'
    ],
    '⚗️': [
        'Alembic',
        ':alembic:'
    ],
    '🕯️': [
        'شمعة',
        ':candle:',
        ':white:'
    ],
    '🖼️': [
        'صورة مجزأة',
        ':framed_picture:',
        'الرسم',
        'إطار الصورة',
        'إطار مع صورة'
    ],
    '🛍️': [
        'أكياس التسوق',
        ':shopping_bags:'
    ],
    '🛒': [
        'Shopping Cart',
        ':shopping_cart:',
        'Shopping Trolley',
        ':shopping_trolley:',
        ':gray:',
        ':grey:'
    ],
    '🎟️': [
        'تذاكر القبول',
        ':admission_tickets:'
    ],
    '🛎️': [
        'Bellhop Bell',
        ':bellhop_bell:',
        ':yellow:',
        ':gold:'
    ],
    '🧾': [
        'الإيصال',
        ':receipt:',
        ':white:'
    ],
    '🧮': [
        'Abacus',
        ':abacus:'
    ],
    '🧫': [
        'بيتري ديش',
        ':petri_dish:'
    ],
    '🧹': [
        'غرفة',
        ':broom:',
        'فرشاة',
        'تفكيك',
        ':yellow:'
    ],
    '🎰': [
        'خانة آلة',
        ':slot_machine:',
        'الكازينو',
        'آلة الفاكهة',
        'المقامرة',
        'آلة البوكر'
    ],
    '🦽': [
        'كرسي عجلة يدوي',
        ':manual_wheelchair:',
        ':wheelchair:'
    ],
    '🦼': [
        'كرسي عجلة محرك',
        ':motorized_wheelchair:'
    ],
    '🪔': [
        'مصباح دييا',
        ':diya_lamp:'
    ],
    '🦯': [
        'White Cane',
        ':whie_cane:'
    ],
    '🩸': [
        'إسقاط الدم',
        ':drop_of_blood:',
        ':red:'
    ],
    '🩹': [
        'الضمادات الاضافية',
        ':adhesive_bandage:'
    ],
    '🩺': [
        'ستيثيسكوب',
        ':stethoscope:'
    ],
    '🪶': [
        'الريشة',
        ':feather:'
    ],
    '🪤': [
        'فخ الفأر',
        ':mouse_trap:'
    ],
    '🫖': [
        'Teapot',
        ':teapot:'
    ],
    '🪨': [
        'الصخور',
        ':rock:',
        ':gray:',
        ':grey:'
    ],
    '🪵': [
        'خشب',
        ':wood:',
        ':brown:'
    ],
    '🪄': [
        'عصا سحرية',
        ':magin_wand:'
    ],
    '🔮': [
        'كرة كريستال',
        ':crystal_ball:',
        'Clairvoyant',
        'مصباح الثروة',
        'سيكولوجية',
        'كريستال أرجواني',
        ':purple:'
    ],
    '🪅': [
        'بيناتا',
        ':pinata:',
        ':piñata:'
    ],
    '🪆': [
        'ضياع متحركة',
        ':nesting_dolls:',
        'ماتريوشكا'
    ],
    '🪡': [
        'ابن الخياطة',
        ':swing_needle:'
    ],
    '🪢': [
        'عقدة',
        ':knot:',
        ':red:',
        ':blue:'
    ],
    '🪙': [
        'عملة',
        ':coin:'
    ],
    '🪃': [
        'Boomerang',
        ':boomerang:',
        ':brown:'
    ],
    '🪥': [
        'فرشاة الأسنان',
        ':toothbrush:'
    ],
    '🪦': [
        'رأس',
        ':headstone:',
        ':gray:',
        ':grey:'
    ],
    '🪧': [
        'Placard',
        ':placard:'
    ],
    '🪒': [
        'رائع',
        ':razor:'
    ],
    '🫙': [
        'جار',
        ':jar:',
        ':transparent:'
    ],
    '🛞': [
        'عجلة',
        ':wheel:',
        'المركبات',
        'السيارات',
        ':black:'
    ],
    '🛟': [
        'خاتم الرنين',
        ':ring_buoy:',
        'حافظة الحياة',
        'خاتم الحياة',
        'القوارب',
        'السلامة',
        'الماء',
        'إنقاذ الحياة',
        ':red:',
        ':white:'
    ],
    '🪬': [
        'Hamsa',
        ':hamsa:',
        'Islam',
        'اليهودية',
        'Buddhism',
        'المسيحية',
        'الديانات',
        'الحظ',
        'الحماية',
        'الإرشادات',
        'القوة الأنثوية',
        'الإيمان',
        ':blue:'
    ],
    '🪩': [
        'كرة مرآة',
        ':mirror_ball:',
        'كرة ديسكو'
    ],
    '🪫': [
        'بطارية منخفضة',
        ':low_battery:',
        ':red:',
        'الطاقة',
        'أحمر'
    ],
    '🩻': [
        'أشعة',
        ':x_ray:',
        ':x-ray:',
        ':blue:'
    ],
    '🫧': [
        'فقاعات',
        ':bubbles:',
        'سودان الصابون',
        'كربون',
        'شخصية الفراغ',
        ':transparent:'
    ],
    '🪪': [
        'بطاقة الهوية',
        ':identification_card:',
        'الهوية',
        'جواز السفر',
        'ID'
    ],
    '🧿': [
        'Nazar Amulet',
        ':nazar_amulet:',
        'العين الشرير',
        ':blue:'
    ],
    '🧸': [
        'دب تيدي',
        ':teddy_bear:',
        'لعبة',
        ':brown:'
    ]
};