// descriptions took from Emojipedia.org
lang = 'zh-CN';
//use i18n language code of the browser, more details: https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/API/i18n/LanguageCode
titles_language[lang] = {
    '🔍': '成果',
    '🕒': '最多使用 emoji',
    '😀': '表情符号',
    '🙋': '人',
    '🦊': '动物。',
    '🅰️': '符号',
    '🍎': '食物和饮料',
    '🏳️‍🌈': '标记',
    '🏊': '运动',
    '✈️': '旅行和地点',
    '🖱️': '技术和办公室',
    '👗': '衣服和配件',
    '🖐️': '手势和身体部位',
    '🛎️': '其他'
};
emojis_language[lang] = [];
/*search*/
emojis_language[lang][0] = {};
/*smileys*/
emojis_language[lang][2] = {
    '😀': [
        '发明面',
        ':)',
        '快乐的面',
        '微笑的面'
    ],
    '😃': [
        '与大眼结晶面',
        ':D',
        '快乐的面',
        '微笑的面',
        '使用打开鼠标的微笑面'
    ],
    '😄': [
        '与微笑眼睛结晶面',
        '快乐的面',
        '微笑的面',
        '与正方形眼光结晶面',
        '露天鼠标和笑脸眼的微笑面'
    ],
    '😁': [
        '用微笑眼睛拍摄面具',
        '与微笑眼睛结晶面'
    ],
    '😆': [
        '研磨面具',
        'xD',
        '><',
        '大草地',
        '关闭眼睛微米',
        '正在进行中',
        '用很强的闭合眼光结晶面',
        '带有打开鼠标和极光闭合眼睛的笑脸。'
    ],
    '😅': [
        '与甜蜜的磨擦面具',
        '练习',
        '愉快的甜蜜。',
        '与正方形眼睛和甜蜜的滴味面',
        '使用打开鼠标和冷血的微笑面'
    ],
    '🤣': [
        'ROFL',
        '在地板上滚动中'
    ],
    '😂': [
        '装饰耳朵的面',
        '正在进行中',
        '正在抓住的挑战',
        '正在抓住的小工具',
        'LOL'
    ],
    '🙂': [
        '轻微笑脸部',
        ':)',
        '稍微愉快的',
        '这是很好的'
    ],
    '🙃': [
        '上下面的面',
        'Sarcasm',
        'Silly',
        '上下面的面'
    ],
    '😉': [
        'Winking Face',
        ';)',
        'Wink',
        '滑动面',
        'Winky 面'
    ],
    '😊': [
        '微笑眼睛的微笑面',
        '^^',
        '快乐的面',
        '微笑的',
        '微笑的面'
    ],
    '😇': [
        '与Halo 的微笑面',
        '天线',
        '哈洛文'
    ],
    '🥰': [
        '有心的微笑面',
        '在爱的脸上',
        '微笑眼睛和三个心胸的笑脸。'
    ],
    '😍': [
        '心眼的微笑面',
        '*.*',
        '心眼镜',
        '心面',
        '心形眼睛的微笑面'
    ],
    '🤩': [
        '星结构体',
        '兴奋的',
        '星眼镜',
        '干燥过来的',
        'Wow 面',
        'Starry Eyes 的面',
        '以星眼光结晶面'
    ],
    '😘': [
        '面部闪光一只基斯',
        ':*',
        ':-*',
        '蓝宝石座',
        'Blowing Kiss',
        '基斯化',
        '面部抛出一把基斯'
    ],
    '😗': [
        '连线面',
        ':*',
        ':-*',
        '杜克面具',
        'Kissy Face',
        '吹风'
    ],
    '☺️': [
        '微笑面具',
        '快乐的面',
        '微笑的面',
        '微笑的',
        '白色笑脸部'
    ],
    '😚': [
        '用封闭眼睛穿面具',
        '吉斯面具',
        'Kissy Face'
    ],
    '😙': [
        '与微笑眼睛连线',
        '吉斯面具',
        'Kissy',
        '口哨手势',
        '吹风'
    ],
    '😋': [
        '面部防护食物（面部防护食品）',
        '多夫文',
        '饥饿的',
        '微笑面色彩许可证Lips',
        '面部可节省的食物（美食）',
        'Yum Y'
    ],
    '😛': [
        'Tongue',
        ':P',
        '喜欢的',
        'Tongue 面具',
        'Tongue-Out',
        '被卡车出去的面具'
    ],
    '😜': [
        '使用Tongue 的Winking Face',
        ';P',
        '疯狂的',
        '疯狂的面',
        '带着被卡出去的冬季的Winking Face',
        '被卡车出门和温暖眼的面具'
    ],
    '🤪': [
        'Zany Face',
        '疯狂眼镜',
        '兴奋的',
        '野生动物协会',
        'Goofy Face',
        '一只大眼和一只小眼的磨擦面'
    ],
    '😝': [
        '使用Tongue拍摄面具',
        'xP',
        'Tongue Out',
        '被卡住出Tongue 和 Tightly-closed 眼睛的面',
        '被卡车出门和轻松封闭眼睛的面'
    ],
    '🤑': [
        '洗钱面具',
        ':$',
        '美元签名眼',
        '金钱面',
        '丰富的'
    ],
    '🤗': [
        '悬浮面',
        '色度',
        '正在休眠',
        'Hugs',
        '带有悬停之手的快乐面具'
    ],
    '🤭': [
        '哎呀。',
        '鼠标悬停的面',
        '微笑眼睛和手持盖子面具'
    ],
    '🤫': [
        'Shh',
        '舒什文',
        '滑动面具',
        '高斯省',
        '静音',
        '静音',
        '静音',
        '指纹覆盖闭合列的面'
    ],
    '🤔': [
        '什么',
        '?',
        '赫姆',
        '思考面',
        'Chin Thumb',
        '小贴士',
        '投掷阴影'
    ],
    '🤐': [
        '邮编',
        'Zipper-Mouth 面',
        '列已密送',
        '密封链接',
        '邮编',
        'Zipper 鼠标的面'
    ],
    '🤨': [
        '带有提升眼睛的面',
        '科尔伯特',
        '岩石',
        '带有提升眼睛的面',
        '用一只Eyebrow 提起的面'
    ],
    '😐': [
        '中性面',
        ':|',
        '带直线鼠标的面',
        '直面'
    ],
    '😑': [
        '无表达式面',
        '-_-',
        '带直线鼠标的面',
        '直线'
    ],
    '😶': [
        '没有鼠标的面',
        '空白面',
        '无鼠标的',
        '静音',
        '静音'
    ],
    '😏': [
        '精炼面具',
        '平面化',
        '性面',
        '烟雾面',
        '有建议的表情'
    ],
    '😒': [
        '未损坏的面',
        '不满意的',
        '小米',
        '侧边-眼色',
        '未刻录'
    ],
    '🙄': [
        '滚动眼睛的面',
        '眼镜头'
    ],
    '😬': [
        '巨型面具',
        '奥克沃德',
        'Eek',
        '步行赤道仪中',
        '内尔沃斯',
        'Snapchat相互#1 最好的朋友'
    ],
    '🤥': [
        '正在照亮面',
        '利奥尔',
        '长鼻子',
        'Pinocchio'
    ],
    '😌': [
        '放松的面',
        '内容',
        '已租赁的'
    ],
    '😔': [
        '很抱歉！',
        '阴极面',
        '阴极化',
        '悲伤的',
        '悲伤者',
        '悲伤的',
        '悲伤的阴影面'
    ],
    '😪': [
        '睡眠面具',
        '侧边栏',
        '烧烤箱'
    ],
    '🤤': [
        '萨里瓦',
        'Drooling Face',
        'Drool'
    ],
    '😴': [
        '睡眠',
        'Zzz',
        '睡眠面',
        '立体中',
        'Zzzz 面'
    ],
    '🥱': ['黄色面具'],
    '😷': [
        '带医疗面具',
        '科罗纳维鲁斯',
        'COVID-19',
        '遮罩面',
        '外科蒙版'
    ],
    '🤒': [
        '温度计的面',
        'Ill',
        '患病情况'
    ],
    '🤕': [
        '头带的面',
        '带状头',
        '淋巴细体',
        '伤害'
    ],
    '🤢': [
        '恶心的面',
        '异常的',
        '绿色面',
        '雾'
    ],
    '🤮': [
        '面部休眠',
        '速率',
        'Bleah',
        'Bleurgh',
        '尤克',
        '尤克文',
        '欧文',
        '速率',
        '向上扔出',
        '雾',
        '开启鼠标挥动的面'
    ],
    '🤧': [
        '闪电面具',
        'Gesundheit'
    ],
    '🥵': [
        '热门面',
        '过热的面'
    ],
    '🥶': [
        '寒冷面',
        '很酷的',
        '箱子',
        '冻结面具'
    ],
    '🥴': [
        '木制面具',
        '冲锋面',
        '面部与未知眼睛和Wavy Mouth'
    ],
    '😵': [
        'Dizzy Face',
        '十字眼睛面',
        '螺旋眼面'
    ],
    '🤯': [
        '爆炸头',
        'Mind Blown',
        '用爆炸头惊人的脸部'
    ],
    '🤠': [
        '奶牛帽面子',
        '小牛座',
        '小牛面具',
        '弓箭头帽子'
    ],
    '🥳': [
        '派对面',
        '派对面',
        '对方角和派对帽子'
    ],
    '😎': [
        '使用日光镜的微笑面',
        '很酷的',
        '相互最佳朋友 (Snapchat)',
        '阳光镜头'
    ],
    '🤓': [
        '无脸面',
        'Nerdy'
    ],
    '🧐': ['单人面'],
    '😕': [
        '令人困惑的面',
        ':/',
        ':S',
        '未插图',
        '拼图'
    ],
    '😟': [
        '令人担忧的面',
        ':(',
        '悲伤的',
        '悲伤者'
    ],
    '🙁': [
        '点燃面具',
        ':(',
        '轻度悲伤的'
    ],
    '☹️': [
        '拳头面',
        ':(',
        'Megafrow',
        '白化拳头面'
    ],
    '😮': [
        'Wow',
        ':O',
        '哦，我！',
        '打开鼠标的面',
        '打开Mouth',
        '带着打开鼠标的惊讶的面'
    ],
    '😯': [
        '悬停的面',
        ':O',
        '惊喜的',
        '惊喜的面'
    ],
    '😲': [
        '惊人的面',
        ':O',
        'Wow',
        '石化面具',
        '冲锋面',
        '汽油面具'
    ],
    '😳': [
        '刷新的面',
        ':$',
        'Blushing face',
        '已放入回收站',
        '可耻的',
        '带宽开眼睛的面'
    ],
    '🥺': [
        '弯曲面',
        ':(',
        '正在乞讨中',
        '光滑眼镜',
        'Simp',
        '带领眼睛的面'
    ],
    '😦': [
        '使用打开鼠标悬浮面',
        'D：',
        '青色'
    ],
    '😨': [
        '受爱好',
        'D：',
        '恐惧的脸部',
        '惊喜的'
    ],
    '😰': [
        '有汗水的迷幻面',
        '蓝色面',
        '令人关注的面',
        '神经面',
        '开启鼠标和冷血液的面'
    ],
    '😥': [
        '伤心但宽松的面具',
        ':\'(',
        '埃伊布鲁汗尤文',
        '已解冻但已放松的面'
    ],
    '😢': [
        '呼叫面',
        ':\'(',
        '呼叫中',
        '泰尔'
    ],
    '😭': [
        '响亮的面具',
        'Bawling',
        '呼叫中',
        '悲伤的耳机',
        'Sobbing'
    ],
    '😱': [
        '恐惧中的面部屏幕',
        '单独首页',
        '屏幕显示',
        '屏幕外观'
    ],
    '😖': [
        '有信仰的面',
        'QuifrowerMouth',
        '剪切的面'
    ],
    '😣': [
        '持久的面具',
        '无助面具',
        '剪切眼镜'
    ],
    '😞': [
        '令人失望的面',
        ':(',
        '悲伤的',
        '悲伤者'
    ],
    '😓': [
        '用甜蜜来下面的面具',
        '艰苦工作',
        '悲伤的汗水面面',
        '寒冷淡的面'
    ],
    '😩': [
        '天气面',
        '令人困惑的面',
        '正在发送邮件'
    ],
    '😫': [
        '恐龙面体',
        '精致的',
        '上传的',
        '令人困惑的面'
    ],
    '😤': [
        '来自鼻子的蒸汽面面',
        '求助于冤情：',
        '沮丧的',
        '疯狂的面',
        'Steaming',
        '用Anger面部居中'
    ],
    '😡': [
        '正在推送面',
        '愤怒的面',
        '毛皮面具',
        '疯狂的面',
        '红面'
    ],
    '😠': [
        '愤怒的面',
        '愤怒的',
        '毛皮面具'
    ],
    '🤬': [
        '滑动中',
        '@#$%&!',
        '鼠标上带符号的面',
        '曲目',
        '正在计算',
        'Grawlix',
        '鼠标上面有符号的面',
        '带符号覆盖鼠标的严重面'
    ],
    '🥲': ['带有泪水的微笑面'],
    '😮‍💨': [
        'Face Exhaling',
        'Sigh'
    ],
    '😵‍💫': [
        'Face with Spiral Eyes',
        'Dizzy Face'
    ],
    '🥸': ['伪装的面'],
    '😈': [
        '马上的微笑面具',
        '恶魔者',
        '恶魔马',
        '快乐的魔法魔法魔法',
        '紫色恶魔者',
        '红色的魔法魔法'
    ],
    '👿': [
        '使用Horns感到愤怒的面',
        '恶魔者',
        '恶魔马',
        '紫色恶魔者',
        '紫色Goblin',
        '悲惨的致命者',
        'Imp'
    ],
    '🤡': [
        '小花面',
        '爬行者',
        '恶魔爪子',
        'Scary Clown'
    ],
    '👽': [
        '外观',
        'ET'
    ],
    '👾': [
        '外星怪物',
        '太空入侵者',
        '视频游戏怪物'
    ],
    '🤖': [
        'Robot',
        '机器人面'
    ],
    '👹': [
        'Ogre',
        '遮罩面',
        'Oni',
        '红色怪物',
        '日语奥格雷文'
    ],
    '👻': [
        '幽灵：',
        'Halloween'
    ],
    '🗣️': [
        '扬声头',
        '曼斯平原中',
        '舒特省',
        '缓存中',
        '在Silhouette演讲头'
    ],
    '👤': [
        '在Silhouette',
        '阴影',
        'Silhouette',
        '用户',
        '人的Silhouette'
    ],
    '🫂': ['人民正在休眠'],
    '👥': [
        'Silhouette 中的忙碌案',
        '阴影',
        'Silhouettes',
        '用户',
        '两个人的Silhouette'
    ]
};
/*people*/
emojis_language[lang][3] = {
    '👶{{skin_tone}}': [
        '婴儿数',
        '儿童',
        '待办事项'
    ],
    '🧒{{skin_tone}}': [
        '儿童',
        '性别中立儿童'
    ],
    '👧{{skin_tone}}': ['女童'],
    '🧑{{skin_tone}}': [
        '人员',
        '性别中立的成年人',
        '成年人'
    ],
    '👱{{skin_tone}}': [
        '人：Blond Hair',
        '闪光',
        '布伦德',
        '黑人人',
        '有Blond Hair的人',
        '布伦德海尔人'
    ],
    '👨{{skin_tone}}': [
        'Man',
        '男性：',
        'Moustache Man'
    ],
    '🧔{{skin_tone}}': [
        '男人: 擦除',
        '碎心机',
        '束缚的人',
        '戴着手的人'
    ],
    '👨{{skin_tone}}‍🦰': [
        '人类：红头发子',
        'Ginger Man',
        'Man Redhead',
        '带红头发的人'
    ],
    '👨{{skin_tone}}‍🦱': [
        '人: 草头发人',
        '带有草原头发的人'
    ],
    '👨{{skin_tone}}‍🦳': [
        '人类：白头发子',
        '带灰色头发的人'
    ],
    '👨{{skin_tone}}‍🦲': [
        '男人: 气球',
        '没有头发的人'
    ],
    '👩{{skin_tone}}': [
        '妇女',
        '女',
        '女士们：',
        '黄色妇女'
    ],
    '👩{{skin_tone}}‍🦰': [
        '妇女：红色头发',
        'Ginger 妇女',
        'Woman Redhead',
        '带红海的妇女'
    ],
    '👩{{skin_tone}}‍🦱': [
        '妇女：曲线头发',
        '带有曲线头发的妇女'
    ],
    '👩{{skin_tone}}‍🦳': [
        '妇女：白头发子',
        '带灰色头发的妇女'
    ],
    '👩{{skin_tone}}‍🦲': [
        '妇女： 气球',
        '没有头发的妇女'
    ],
    '👱{{skin_tone}}‍♀️': [
        '妇女： Blond Hair',
        'Blonde Hair 的妇女'
    ],
    '👱{{skin_tone}}‍♂️': [
        '人类：Blond Hair',
        '布伦德海尔人'
    ],
    '🧓{{skin_tone}}‍': [
        '老人',
        '性别中立的成年人'
    ],
    '👴{{skin_tone}}‍': [
        '老人',
        '老年人',
        'Grandpa',
        '更老的人'
    ],
    '👵{{skin_tone}}‍': [
        '老妇女',
        '老年妇女',
        '格朗德马',
        '纳纳',
        '老女士',
        '老年妇女'
    ],
    '👼{{skin_tone}}‍': [
        '婴儿天线',
        '天线',
        'Cherub',
        '杯子',
        '普托文'
    ],
    '🎅{{skin_tone}}‍': [
        '圣克劳斯',
        '圣尼古拉斯',
        'Sinterklaas',
        '圣诞神器'
    ],
    '🤶{{skin_tone}}‍': [
        '克劳斯女士',
        '圣诞节'
    ],
    '🤴{{skin_tone}}‍': ['亲王座'],
    '👸{{skin_tone}}‍': [
        '公主',
        'Blonde Girl',
        '女王之手',
        '女孩与Tiara'
    ],
    '👳{{skin_tone}}‍♂️': ['人类穿甲弹头'],
    '👳{{skin_tone}}‍♀️': ['妇女问题听力炮塔'],
    '👲{{skin_tone}}‍': [
        'Skullcap的人',
        '亚洲人',
        '华人帽子',
        '与Gua Pi Mao 有联系的人'
    ],
    '🧕{{skin_tone}}‍': [
        '带头巾的妇女',
        'Hijab',
        '头巾人'
    ],
    '🤵{{skin_tone}}‍': [
        'Tuxedo的人',
        'Groom',
        '在套装中',
        'Tuxedo中的人'
    ],
    '👰{{skin_tone}}‍': [
        '有韦尔的人',
        '新增功能',
        '带着Veil彩礼。'
    ],
    '👰{{skin_tone}}‍♂️': ['有韦尔的人'],
    '👰{{skin_tone}}‍♀️': ['Woman with Veil'],
    '👩{{skin_tone}}‍🍼': ['妇女喂养婴儿问题'],
    '👨{{skin_tone}}‍🍼': ['男人喂养婴儿数'],
    '🥷': ['宁加'],
    '🤰{{skin_tone}}‍': [
        '怀孕妇女',
        '怀孕情况',
        '怀孕女士'
    ],
    '🤱{{skin_tone}}‍': [
        '母乳喂养中',
        '母乳喂养问题'
    ],
    '🦸{{skin_tone}}‍♂️': ['Man Superhero'],
    '🦸{{skin_tone}}‍‍♀️': ['妇女超级英雄'],
    '🦹{{skin_tone}}‍‍♂️': ['Man Supervillain'],
    '🦹{{skin_tone}}‍‍♀️': ['妇女超级维利'],
    '🧙{{skin_tone}}‍': [
        '魔方',
        'Sorcerer',
        '联谊会',
        '巫师',
        '向导'
    ],
    '🧙{{skin_tone}}‍‍♀️': [
        '妇女魔法',
        '巫师',
        '联谊会'
    ],
    '🧚{{skin_tone}}‍‍♂️': ['Man Fairy'],
    '🧚{{skin_tone}}‍♀️': ['妇女节奏：'],
    '🧛{{skin_tone}}‍♂️': [
        '男子吸血鬼的',
        '德拉库拉'
    ],
    '🧛{{skin_tone}}‍‍♀️': ['妇女吸血鬼。'],
    '🧜{{skin_tone}}‍♂️': ['梅尔曼'],
    '🧜{{skin_tone}}‍♀️': ['美人鱼座'],
    '🧝{{skin_tone}}‍♂️': ['Man Elf'],
    '🧝{{skin_tone}}‍♀️': ['妇女精灵省'],
    '🧞‍♂️': ['Man Genie'],
    '🧞‍♀️': ['Woman Genie'],
    '🕵️{{skin_tone}}‍♂️': [
        '人检测',
        '私人眼镜',
        'Sleuth',
        '间谍活动',
        'Man Sleuth',
        '休闲或间谍活动',
        '007',
        '检查员'
    ],
    '🕵️{{skin_tone}}‍♀️': ['妇女检测'],
    '💂{{skin_tone}}‍': [
        '守卫者',
        '英军卫士',
        '英尺护卫器'
    ],
    '💂{{skin_tone}}‍‍♀️': ['妇女卫士'],
    '👮{{skin_tone}}‍': [
        '警务干事',
        '编译',
        '警察',
        '警察',
        '女警察'
    ],
    '👮{{skin_tone}}‍‍♀️': ['妇女警察'],
    '👨{{skin_tone}}‍🚒': ['Man 消防员'],
    '👩{{skin_tone}}‍‍🚒': ['妇女消防员'],
    '👨{{skin_tone}}‍‍✈️': ['人驾驶员'],
    '👩{{skin_tone}}‍‍✈️': ['妇女飞行员'],
    '👨{{skin_tone}}‍💻': [
        '人技术师',
        '人技术师'
    ],
    '👩{{skin_tone}}‍💻': ['妇女技术师'],
    '👨{{skin_tone}}‍🎤': [
        'Man Singer',
        'Bowie',
        'Aladdin Sane'
    ],
    '👩{{skin_tone}}‍🎤': ['妇女歌手'],
    '👨{{skin_tone}}‍🎨': ['男艺人'],
    '👩{{skin_tone}}‍🎨': ['女艺人'],
    '👷{{skin_tone}}‍‍♂️': ['男建筑工'],
    '👷{{skin_tone}}‍‍♀️': ['妇女建筑工'],
    '👨{{skin_tone}}‍‍🚀': [
        '人类宇航员',
        'Man Cosmonaut'
    ],
    '👩{{skin_tone}}‍‍🚀': [
        '女宇航员',
        '妇女宇航员'
    ],
    '👨{{skin_tone}}‍‍🔬': ['Man Scientist'],
    '👩{{skin_tone}}‍‍🔬': ['女性科学家：'],
    '👨{{skin_tone}}‍💼': [
        'Man Office Workers',
        'CEO',
        '商人'
    ],
    '👩{{skin_tone}}‍💼': [
        '妇女办公室工人',
        '商界妇女',
        'CEO'
    ],
    '👨{{skin_tone}}‍🏭': ['男工厂工人'],
    '👩{{skin_tone}}‍‍🏭': ['妇女工厂工人'],
    '👨{{skin_tone}}‍‍🔧': ['Man Mechanic'],
    '👩{{skin_tone}}‍‍🔧': ['妇女机械师'],
    '👨{{skin_tone}}‍‍🍳': [
        'Man Cook',
        'Man Chef',
        '男性Chef'
    ],
    '👩{{skin_tone}}‍‍🍳': [
        '妇女库克岛',
        '妇女Chef',
        '女厨师'
    ],
    '👨{{skin_tone}}‍‍🌾': ['男农民：'],
    '👩{{skin_tone}}‍‍🌾': ['妇女农民组织'],
    '👨{{skin_tone}}‍‍⚖️': ['Man Judge'],
    '👩{{skin_tone}}‍‍⚖️': ['女法官'],
    '👨{{skin_tone}}‍‍🏫': ['男教师'],
    '👩{{skin_tone}}‍‍🏫': ['女教师'],
    '👨{{skin_tone}}‍🎓': ['男学生'],
    '👩{{skin_tone}}‍🎓': ['女学生'],
    '👨{{skin_tone}}‍‍⚕️': [
        '男保健工人',
        '男性博士',
        '男性Nurse'
    ],
    '👩{{skin_tone}}‍⚕️': [
        '妇女保健工人',
        '女博士',
        '女护士：'
    ],
    '🤷{{skin_tone}}‍♂️': [
        '男人收缩中',
        'idk 人',
        'dunno'
    ],
    '🤷{{skin_tone}}‍♀️': [
        '妇女破裂中',
        'idk 妇女',
        'dunno'
    ],
    '🤦{{skin_tone}}‍♂️': ['人脸道化'],
    '🤦{{skin_tone}}‍♀️': ['妇女脸谱化'],
    '🙇{{skin_tone}}‍‍♂️': ['Man Bbown'],
    '🙇{{skin_tone}}‍‍♀️': ['女人Bdown'],
    '🧏{{skin_tone}}‍♂️': ['死亡人'],
    '🧏{{skin_tone}}‍‍♀️': ['Deaf 妇女'],
    '🙋{{skin_tone}}‍‍♂️': [
        '男人提升手',
        '快乐的男人举一手'
    ],
    '🙋{{skin_tone}}‍♀️': [
        '妇女提升手',
        '快乐的妇女举手'
    ],
    '💁{{skin_tone}}‍♂️': [
        'Man Tiping Hand',
        '问讯处人员'
    ],
    '💁{{skin_tone}}‍♀️': [
        '妇女装配手',
        '问讯处妇女'
    ],
    '🙆{{skin_tone}}‍♂️': ['Man Gesturing OK'],
    '🙆{{skin_tone}}‍♀️': ['妇女正在寻找OK'],
    '🙅{{skin_tone}}‍♂️': ['Man Gesting 否'],
    '🙅{{skin_tone}}‍♀️': ['妇女测试中 否'],
    '🙎{{skin_tone}}‍♂️': ['Man Pouting'],
    '🙎{{skin_tone}}‍‍♀️': ['妇女Pouting'],
    '🙍{{skin_tone}}‍‍♂️': ['Man Frowning'],
    '🙍{{skin_tone}}‍‍♀️': ['妇女衰退。'],
    '🧟‍‍♂️': ['人僵尸'],
    '🧟‍‍♀️': ['妇女僵尸'],
    '🚶{{skin_tone}}‍♂️': ['人步行'],
    '🚶{{skin_tone}}‍♀️': ['妇女步行'],
    '🧍{{skin_tone}}‍‍♂️': ['Man Standard'],
    '🧍{{skin_tone}}‍‍♀️': ['妇女常驻代表'],
    '🧎{{skin_tone}}‍♂️': ['Man Kneeling'],
    '🧎{{skin_tone}}‍‍♀️': ['女人的膝关卡'],
    '👨{{skin_tone}}‍🦯': ['带白色冠军的人'],
    '👩{{skin_tone}}‍🦯': ['带白冠军的妇女'],
    '👨{{skin_tone}}‍🦼': ['摩托化轮椅中的人'],
    '👩{{skin_tone}}‍🦼': ['摩托化轮椅中的妇女'],
    '👨{{skin_tone}}‍🦽': ['手工轮椅中的人'],
    '👩{{skin_tone}}‍🦽': ['手工轮椅中的妇女'],
    '👯‍♂️': ['Bunny Ears 的男人'],
    '👯‍♀️': ['Bunny Ears 的妇女'],
    '🕴️{{skin_tone}}‍': [
        '在套装中的人 Leviting',
        '悬停人',
        '粗暴的男孩组织',
        'Walt Jabsco',
        '男人参与商业套装'
    ],
    '🧖{{skin_tone}}‍♂️': [
        '人在Steamy Room',
        '桑纳人'
    ],
    '🧖{{skin_tone}}‍♀️': [
        'Steamy房间中的妇女',
        'Sauna地区的妇女'
    ],
    '👫{{skin_tone}}‍': [
        '女人和男人持手',
        '异性伴侣：',
        '直流双手',
        '男人和女人持手'
    ],
    '👭{{skin_tone}}‍': [
        'Lesbian couple',
        '女持手',
        '两名女持手'
    ],
    '👬{{skin_tone}}‍': [
        '男人持手',
        'Gay Couple',
        '两名男子持手'
    ],
    '👨‍👩‍👦': [
        '与母亲、父亲和松族的家庭',
        '家庭：男性、女性、男孩。'
    ],
    '👨‍👩‍👧': [
        '与母亲、父亲和女儿共同生活的家庭',
        '家庭： 男性、女性、女童'
    ],
    '👨‍👩‍👧‍👦': [
        '带有母亲、父亲、松子和女儿的家庭',
        '家庭： 男人、女人、女童'
    ],
    '👨‍👩‍👦‍👦': [
        '带着母亲、父亲和两个儿子的家庭',
        '家庭： 男人、女人、男人、男人和男人'
    ],
    '👨‍👩‍👧‍👧': [
        '与母亲、父亲和两名女儿的家庭',
        '家庭： 男人、女人、女童'
    ],
    '👨‍👨‍👦': [
        '有两名父亲和男人的家庭',
        '家庭： 男性，男性，男生：'
    ],
    '👨‍👨‍👧': [
        '有两个父亲和女儿的家庭',
        '家庭： 男性，男性，女童'
    ],
    '👨‍👨‍👧‍👦': [
        '有两个父亲、僧侣和女儿的家庭',
        '家庭： 男人，男人，女孩，男人'
    ],
    '👨‍👨‍👦‍👦': [
        '有两个父亲和两个儿子的家庭',
        '家庭：男人，男人，男人，男人，男孩子，男人'
    ],
    '👨‍👨‍👧‍👧': [
        '有两名父亲和两名女儿的家庭',
        '家庭：男人，男人，女人，女童'
    ],
    '👩‍👩‍👦': [
        '有两个母亲和子女的家庭',
        '家庭： 妇女、妇女'
    ],
    '👩‍👩‍👧': [
        '有两个母亲和女儿的家庭',
        '家庭： 妇女、妇女'
    ],
    '👩‍👩‍👧‍👦': [
        '有两名母亲、松子和女儿的家庭',
        '家庭： 妇女、妇女、女孩、男孩；'
    ],
    '👩‍👩‍👦‍👦': [
        '有两个孩子的家庭',
        '家庭： 妇女、妇女、男童、男童。'
    ],
    '👩‍👩‍👧‍👧': [
        '有两名母亲和两名女儿的家庭',
        '家庭： 妇女、妇女、女童'
    ],
    '👨‍👦': [
        '与神父和神父的家庭',
        '家庭：男性，男人'
    ],
    '👨‍👦‍👦': [
        '家庭：男人，男孩，男人',
        '有父亲和两个儿子的家庭'
    ],
    '👨‍👧': [
        '与父亲和女儿共同生活的家庭',
        '家庭：男性，女童'
    ],
    '👨‍👧‍👦': [
        '与父亲、松子和女儿共同生活的家庭',
        '家庭： 男性，女孩，男孩：'
    ],
    '👨‍👧‍👧': [
        '有父亲和两名女儿的家庭',
        '家庭： 男性，女孩，'
    ],
    '👩‍👦': [
        '与母子和女子的家庭',
        '家庭： 妇女、男孩；'
    ],
    '👩‍👦‍👦': [
        '与母亲和两个儿子的家庭',
        '家庭： 妇女、男童、男童。'
    ],
    '👩‍👧': [
        '与母亲和女儿的家庭',
        '家庭： 妇女、女童'
    ],
    '👩‍👧‍👦': [
        '带有母亲、松子和女儿的家庭',
        '家庭： 妇女、女孩、男孩；'
    ],
    '👩‍👧‍👧': [
        '与母亲和两名女儿的家庭',
        '家庭： 妇女、女童'
    ],
    '💑': [
        '与心结伴随的',
        '爱情中的伴侣关系',
        '喜爱的双手',
        '爱心的男人和女人'
    ],
    '👨‍❤️‍👨': [
        '有心的两名男人',
        '与心同义：男，男人，男人'
    ],
    '👩‍❤️‍👩': [
        '两名有心的妇女',
        '与心协力：妇女、妇女'
    ],
    '💆{{skin_tone}}‍‍♂️': ['Man Getting Head Massage'],
    '💆{{skin_tone}}‍♀️': ['妇女获取头部的分布情况'],
    '💇{{skin_tone}}‍‍♂️': ['男人正在获得快车'],
    '💇{{skin_tone}}‍‍♀️': ['女人正在做出休闲动作'],
    '🛌{{skin_tone}}‍': [
        '睡眠住宿',
        '床上的人',
        '人员睡眠'
    ]
};
/*animals*/
emojis_language[lang][4] = {
    '😺': [
        '发明小猫座',
        ':)',
        '快乐小节',
        '微笑之帽',
        '快乐的猫面',
        '开启鼠标时的笑脸帽'
    ],
    '😸': [
        '与微笑眼睛一起研制小猫。',
        ':D',
        '发明小猫座',
        '快乐小节',
        '发明猫面'
    ],
    '😹': [
        '带有珍珠之帽子',
        ':\')',
        '快乐的耳机帽',
        '正在抓着的帽'
    ],
    '😻': [
        '带有心眼的微笑帽',
        '*.*',
        '爱心眼帽',
        '喜爱的猫子',
        '带有心形眼睛的微笑猫面'
    ],
    '😼': [
        '用Wry Smile来做猫子',
        '熔炼蛋糕点',
        '涂料猫面',
        '带有Wry Smile 的猫面'
    ],
    '😽': [
        '小猫座',
        ':*',
        '小猫面具',
        '带着封闭眼睛的猫面'
    ],
    '🙀': [
        'Weary Cat',
        ':O',
        '可爱的猫子',
        '屏幕通话机',
        '恐惧中的猫脸截图',
        'Weary Cat Face'
    ],
    '😿': [
        '呼叫帽',
        ':\'(',
        '伤心小节',
        '正在响起的猫面'
    ],
    '😾': [
        '正在拍摄的杯子',
        'Grumpy Cat',
        '正在拍摄的猫面'
    ],
    '🙈': [
        '猴子',
        '看看不见的魔法',
        '米扎鲁文',
        '专用封面眼镜'
    ],
    '🙉': [
        '猴子',
        '心灵-黑客专钥',
        'Kikazaru',
        'Monkey 封面'
    ],
    '🙊': [
        '猴子',
        '扬声器-黑客专钥',
        '伊瓦萨鲁文',
        'Monkey 封面Mouth',
        '没有发言'
    ],
    '🐵': [
        '猴子',
        '猴子面',
        '蒙基头'
    ],
    '🐒': [
        '猴子',
        'Cheeky Monkey'
    ],
    '🦍': ['Gorilla'],
    '🐶': [
        '狗面具',
        '门',
        '小配对'
    ],
    '🐕': [
        '门',
        'Doggo',
        'Akita Inu'
    ],
    '🦮': [
        '看到眼门',
        '导星门'
    ],
    '🐕‍🦺': ['服务门'],
    '🐩': [
        '水果',
        '门',
        '微型药水',
        '标准荷宝动付器',
        '玩具药水'
    ],
    '🐺': [
        '狼人',
        '狼面'
    ],
    '🦊': [
        'Fox',
        'Fox 面'
    ],
    '🦝': ['竞技场'],
    '🐱': [
        '猫头像',
        ':3',
        '开恩文',
        '基蒂文'
    ],
    '🐈': [
        '小猫座',
        '家居帽',
        '通道：',
        '休塞亚特'
    ],
    '🐈‍⬛': ['黑色笼子'],
    '🦁': [
        '狮子',
        '狮子面'
    ],
    '🐯': [
        '猛虎人面',
        '剪切虎头'
    ],
    '🐅': [
        '老虎座',
        'Bengal Tiger'
    ],
    '🐆': [
        'Leopard',
        '非洲莱波德',
        'Jaguar'
    ],
    '🐴': [
        '马面',
        '马头'
    ],
    '🐎': [
        '马',
        '盖洛普马',
        '赛马'
    ],
    '🦄': [
        '独角兽人',
        '独角兽面'
    ],
    '🦓': [
        'Zebra',
        'Zebra 面'
    ],
    '🦌': [
        '代尔',
        '圆石',
        '驯化者',
        'Stag'
    ],
    '🐮': [
        '牛面具',
        '牛座',
        '快乐的牛座'
    ],
    '🐂': [
        'xix',
        '公牛座',
        '布洛克',
        '牛津救济会',
        '钢铁公司'
    ],
    '🐃': [
        '水源Buffalo',
        '布法洛文',
        '家庭用水缓冲区'
    ],
    '🐄': [
        '牛座',
        '奶牛座'
    ],
    '🐷': [
        '猪面',
        'Pig',
        '猪头'
    ],
    '🐖': [
        'Pig',
        '钩子',
        'Sow'
    ],
    '🐗': [
        '鲍尔文',
        '瓦瑟克',
        '野战靴子',
        '野猪座'
    ],
    '🐽': ['猪鼻子'],
    '🐏': [
        'Ram',
        '羊座'
    ],
    '🐑': [
        'Ewe',
        'Lamb',
        '羊座'
    ],
    '🐐': ['山羊'],
    '🐪': [
        '杰梅尔',
        'Arabian Camel',
        '投掷骆驼。',
        '一波出蛋糕点'
    ],
    '🐫': [
        '双跳蛋糕点',
        '亚美尔',
        '巴克特里安杰梅尔'
    ],
    '🦙': [
        'Llama',
        'Alpaca'
    ],
    '🦒': [
        'Giraffe',
        'Giraffe Face'
    ],
    '🐘': ['大师'],
    '🦏': [
        'Rhinoceros',
        'Rhino'
    ],
    '🦛': [
        'Hippopotamus',
        'Hippo'
    ],
    '🐭': [
        '鼠标面',
        '鼠标键'
    ],
    '🐁': [
        '鼠标键',
        '多尔马',
        '罗森特',
        '米斯文'
    ],
    '🐀': [
        '干线',
        '罗森特'
    ],
    '🐹': [
        '哈姆斯特文',
        '哈姆斯特面具'
    ],
    '🐰': [
        '狂犬病面',
        '复活节布尼'
    ],
    '🐇': [
        '拉比特',
        'Bunny',
        'Bunny Rabbit'
    ],
    '🐿️': [
        '奇普蒙克',
        '潜水器'
    ],
    '🦔': ['赫德霍克'],
    '🦇': [
        '巴特',
        '巴特曼'
    ],
    '🐻': [
        '熊座',
        '熊面',
        '泰迪熊座'
    ],
    '🐨': [
        '科拉',
        'Koala 面'
    ],
    '🐼': [
        '潘达文',
        '潘达面具'
    ],
    '🦘': [
        '坎加罗奥文',
        'Roo'
    ],
    '🦡': ['Badger'],
    '🦃': [
        '土耳其',
        '向土耳其致谢。',
        '土耳其野生生物协会'
    ],
    '🐔': [
        '鸡肉',
        'Hen'
    ],
    '🐓': [
        '岩石',
        'Rooster',
        '鸡肉'
    ],
    '🐣': [
        '正在聊天室',
        '婴儿鸡肉',
        '踢人帽'
    ],
    '🐤': [
        '婴儿鸡肉',
        '黄鸟类'
    ],
    '🐥': [
        '前面的婴儿碎子',
        '婴儿鸡肉',
        '立体胸甲'
    ],
    '🐦': ['鸟类'],
    '🐧': ['Penguin'],
    '🕊️': [
        '小门',
        '和平之门'
    ],
    '🦅': [
        '鹰座',
        'Bald Eagle'
    ],
    '🦆': ['杜克'],
    '🦢': ['天狼座'],
    '🦉': ['Owl'],
    '🦚': ['建立和平'],
    '🦜': ['帕罗特'],
    '🐸': [
        '青色',
        'Toad',
        '青色面'
    ],
    '🐊': [
        '裁剪式',
        '过敏者',
        '克罗克'
    ],
    '🐢': [
        '乌特尔特',
        'Tortoise'
    ],
    '🦎': [
        '巫师',
        '吉科'
    ],
    '🐍': [
        '蛇座',
        '服务器'
    ],
    '🐲': [
        '龙面',
        '龙头'
    ],
    '🐉': ['龙座'],
    '🦕': [
        '苏罗波德',
        'Brachiosaurus',
        'Brontosaurus',
        'Dinosaur'
    ],
    '🦖': [
        'T-Rex',
        'Tyrannosaurus Rex'
    ],
    '🐳': [
        '配偶鲸鱼',
        '剪切鲸鱼'
    ],
    '🐋': ['鲸鱼座'],
    '🐬': ['海豚座'],
    '🐟': [
        '鱼类',
        '淡水鱼'
    ],
    '🐠': [
        '热带鱼',
        '鱼类',
        '黄蓝色鱼'
    ],
    '🐡': [
        'Blowfish',
        'Fugu',
        '普费尔鱼'
    ],
    '🦈': [
        '鲨鱼座',
        '伟大的白鲨鱼座'
    ],
    '🐙': ['奥多普斯'],
    '🐚': [
        '螺旋式外壳',
        '西色尔',
        '外壳'
    ],
    '🐌': [
        '冰箱',
        '缩写',
        '花园的冰箱'
    ],
    '🦋': ['蝴蝶'],
    '🐛': [
        '错误',
        '卡特皮尔',
        '昆特文'
    ],
    '🐜': [
        'Ant',
        '错误',
        '昆特文'
    ],
    '🐝': [
        '翁耶比',
        '蜜蜂：',
        'Bumblebee'
    ],
    '🐞': [
        '女人贝埃特',
        'Ladybird',
        'Ladybug',
        '错误'
    ],
    '🦗': [
        '板块',
        'Grasshoper'
    ],
    '🕷️': ['蜘蛛的'],
    '🦂': ['帝王座'],
    '🦟': ['莫斯基多'],
    '🦀': ['克拉布'],
    '🦞': ['龙虾座'],
    '🦐': [
        '收缩图',
        'Prawn'
    ],
    '🦑': ['方形'],
    '🦧': ['Orangutan'],
    '🦥': ['槽位'],
    '🦦': ['Otter'],
    '🦨': ['Skunk'],
    '🦬': ['比森语'],
    '🦣': ['曼莫斯'],
    '🦫': ['海浪者'],
    '🐻‍❄️': ['极熊熊座'],
    '🦤': ['Dodo'],
    '🦭': ['密碼'],
    '🪲': ['节点数'],
    '🪳': ['科克罗克'],
    '🪰': ['飞龙'],
    '🪱': ['虫子'],
    '🦩': ['火焰喷射器']
};
/*symbols*/
emojis_language[lang][5] = {
    '💘': [
        '用箭头爱心',
        '古代箭头',
        'Lovestruck'
    ],
    '💝': [
        '爱心带操作区',
        '巧克力宝箱',
        '礼品箱',
        '礼物心'
    ],
    '💖': [
        'Sparkling Heart',
        'Sparkle 心',
        '圣心心',
        '星之心'
    ],
    '💗': [
        '正在成长心中',
        '多个心',
        '三重心'
    ],
    '💓': [
        '殴打心',
        '心报警',
        'Heartbeat',
        'Wifi心'
    ],
    '💞': [
        '旋转心',
        '双心'
    ],
    '💕': [
        '双心',
        '小心',
        '两只粉红色心'
    ],
    '💟': ['心情装饰'],
    '❣️': [
        '心灵感子',
        '点上方的心',
        '红心作为一个感叹号',
        '重型心脏采集标记Ornement'
    ],
    '💔': [
        '破损的心',
        '打破心',
        'Brokenheared',
        '心碎了'
    ],
    '❤️': [
        '我喜欢你',
        '红心',
        '爱心',
        '爱心',
        '红心'
    ],
    '🧡': [
        '橙色心',
        '我喜欢你'
    ],
    '💛': [
        '黄色心',
        '#1 高炉快照',
        '黄金心',
        '我喜欢你'
    ],
    '💚': [
        '绿色心',
        '焦耳心',
        '我喜欢你'
    ],
    '💙': [
        '蓝色心',
        '我喜欢你'
    ],
    '💜': [
        '紫色心',
        '我喜欢你'
    ],
    '🖤': [
        '黑色心',
        '暗心',
        '我喜欢你'
    ],
    '🤍': [
        '白心',
        '我喜欢你'
    ],
    '🤎': [
        '棕色心',
        '我喜欢你'
    ],
    '💯': [
        '百分',
        '100',
        '%',
        '保留 100',
        '完美得分',
        '百点符号'
    ],
    '💬': [
        '语音气球',
        '泡泡泡泡聊天',
        '语音泡包'
    ],
    '💭': [
        '思想气球',
        '智能泡球',
        '智能弹头'
    ],
    '💤': [
        'Zzz',
        '睡眠时间',
        '着色',
        '睡眠',
        '睡眠',
        '睡眠符号'
    ],
    '♠️': [
        '螺旋套装',
        'Spades',
        'Black Spade Suit'
    ],
    '♥️': [
        '心灵套装',
        '带有心的卡',
        '爱好',
        '黑色心脏套装'
    ],
    '♦️': [
        '钻石套装',
        '四. 钻石',
        '黑色钻石套装'
    ],
    '♣️': [
        '俱乐部套装',
        'Clubs',
        '黑俱乐部套装'
    ],
    '🏧': [
        'ATM 标志',
        '自动取款机',
        '自动望远镜机'
    ],
    '🎵': [
        '音乐笔记',
        '八条笔记的贝塞尔配对',
        '怪物配对',
        '音乐笔记'
    ],
    '🎶': [
        '音乐笔记',
        '音乐',
        '音乐笔记',
        '正在唱出',
        '多个音乐笔记'
    ],
    '🔔': [
        '铃声',
        '自由铃声',
        'Ringer',
        '婚礼铃声'
    ],
    '🔕': [
        '带斜杠铃声',
        '通知',
        '铃声已禁用',
        '静音铃声',
        '带有取消笔记的铃声'
    ],
    '🔈': [
        '扬声器低音量',
        '音量',
        '扬声器'
    ],
    '🔉': [
        '扬声器中等音量',
        '减少音量',
        '音量中等的扬声器',
        '扬声器有一波声波。'
    ],
    '🔊': [
        '扬声器高音量',
        '增加音量',
        '带有三波音频的扬声器'
    ],
    '🔇': [
        '静音扬声器',
        '静音音量',
        '带有取消笔记的扬声器'
    ],
    '⛔': ['无条目'],
    '🚫': [
        '禁止的',
        '封禁',
        '圆形反斜线',
        '否',
        '红色圆环十字准线',
        '受限',
        '无条目签名'
    ],
    '🚳': [
        '没有自行车',
        '没有Bikes签名'
    ],
    '🚭': [
        '无烟化',
        '没有烟雾符号'
    ],
    '🚯': [
        '无闪烁',
        '不要垃圾符号'
    ],
    '🚱': [
        '不可用水',
        '无水',
        '无饮水',
        '不可用水符号'
    ],
    '🚷': [
        '无步行者',
        '没有人',
        '无步行'
    ],
    '🔞': [
        '十八岁以下没有',
        'NSFW',
        '十八个符号下没有',
        '18'
    ],
    '📵': [
        '无手机号码',
        '无手机号码',
        '无电话',
        '无智能手机'
    ],
    '☢️': [
        'Radioactive',
        '国际辐射符号',
        'B. 核部分: 第91页, 34',
        '放射性标志'
    ],
    '☣️': [
        '生物危险',
        '生物危害标志'
    ],
    '⬆️': [
        '上箭头',
        '向上箭头',
        '向上移动黑箭头'
    ],
    '↗️': [
        '右上箭头',
        '对角向上箭头',
        '东北箭头'
    ],
    '➡️': [
        '右箭头',
        '右箭头',
        '右黑箭头'
    ],
    '↘️': [
        '右下箭头',
        '右对角箭头',
        '东南箭头'
    ],
    '⬇️': [
        '向下箭头',
        '向下箭头',
        '向下的黑箭头'
    ],
    '↙️': [
        '左箭头',
        '对角左箭头',
        '西南箭头'
    ],
    '⬅️': [
        '左箭头',
        '左箭头',
        '左侧黑箭头'
    ],
    '↖️': [
        '左上箭头',
        '对角左箭头',
        '西北箭头'
    ],
    '↕️': [
        '上下箭头',
        '垂直箭头',
        '向下箭头'
    ],
    '↔️': [
        '左箭头',
        '水平箭头',
        '侧边箭头',
        '左右箭头'
    ],
    '↩️': [
        '右箭头曲线左移',
        '电子邮件回复',
        '左曲线箭头',
        '用钩子左箭头'
    ],
    '↪️': [
        '左箭头曲线右移',
        '电子邮件转发方式',
        '右曲线箭头',
        '用钩子向右箭头'
    ],
    '⤴️': [
        '右箭头曲线',
        '向右箭头点数然后向上曲线'
    ],
    '⤵️': [
        '右箭头曲线下移',
        '曲线下箭头',
        '向右箭头指针，然后向下曲线'
    ],
    '🔃': [
        '顺时针垂直箭头',
        '顺时针向下和向上打开环形箭头'
    ],
    '🔄': [
        '逆时针箭头按钮',
        '刷新',
        '旋转',
        '交换机',
        '逆时针箭头',
        '逆时针向下和向上打开环形箭头'
    ],
    '🔙': [
        '后箭头',
        '后退',
        '用左箭头返回上方'
    ],
    '🔚': [
        '结束箭头',
        '结束',
        '以左箭头结束'
    ],
    '🔛': [
        '开了！箭头',
        '开启',
        '带着右箭头右上标记开启。'
    ],
    '🔜': [
        '很快箭头',
        '很快的',
        '很快使用右箭头'
    ],
    '🔝': [
        '顶部箭头',
        '顶端',
        '顶部与上箭头'
    ],
    '🛐': [
        '礼拜地点',
        '宗教建设'
    ],
    '⚛️': ['Atom 符号'],
    '🕉️': [
        'Om 符号',
        '好的',
        'Aumkara',
        'Omkara',
        'Pranava'
    ],
    '✡️': [
        '大卫之星',
        'Magen David'
    ],
    '☸️': [
        '达尔马之车',
        '头盔'
    ],
    '☯️': ['Yin Yang'],
    '✝️': [
        '拉丁十字座',
        '基督教十字勋章'
    ],
    '☦️': ['东正教十字座'],
    '☪️': ['星与新年'],
    '☮️': [
        '和平符号',
        '和平标志'
    ],
    '🕎': [
        '梅洛拉',
        'Candelabrum',
        '糖果箱',
        '查努基亚',
        '梅洛拉',
        'Menorah 含九个分支'
    ],
    '🔯': [
        '虚拟六点星星',
        '中点星六点星。'
    ],
    '♈': [
        '阿里斯',
        '芝加哥州'
    ],
    '♉': [
        'Taurus',
        '芝加哥州'
    ],
    '♊': [
        'Gemini',
        '芝加哥州'
    ],
    '♋': [
        'Cancer',
        '芝加哥州'
    ],
    '♌': [
        '莱奥文',
        '芝加哥州'
    ],
    '♍': [
        '维戈文',
        '芝加哥州'
    ],
    '♎': [
        '利伯拉',
        '芝加哥州'
    ],
    '♏': [
        '斯波皮奥文',
        '巨型战利品',
        '芝加哥州'
    ],
    '♐': [
        'Sagittarius',
        '芝加哥州'
    ],
    '♑': [
        '克里科恩文',
        '芝加哥州'
    ],
    '♒': [
        '水星座',
        '芝加哥州'
    ],
    '♓': [
        'Pisces',
        '芝加哥州'
    ],
    '⛎': [
        '奥普丘斯',
        '芝加哥州'
    ],
    '⏭️': [
        '带垂直条形的黑右双角三角形',
        '跳过转发符号',
        '下一曲目按钮'
    ],
    '⏮️': [
        '带有垂直条形的黑色左双点三角形',
        '跳过后向符号',
        '最后曲目按钮',
        '上一曲目'
    ],
    '⏯️': [
        '带有双垂直条形的黑色右点三角形',
        '播放或暂停按钮',
        '播放符号',
        '暂停符号'
    ],
    '🔀': [
        '随机曲目按钮',
        '右箭头'
    ],
    '🔁': [
        '重复按钮',
        '循环符号',
        '转发器',
        '顺时针右向和左环开环形箭头'
    ],
    '🔂': [
        '重复单个按钮',
        '有数字1的圆形箭头',
        '循环一次符号',
        '重复单轨符号',
        '顺时针右转和左手环形箭头带有圆形叠加的环形箭头'
    ],
    '▶️': [
        '播放按钮',
        '右三角形',
        '右点三角形',
        '黑色右点三角形'
    ],
    '◀️': [
        '反向按钮',
        '左三角形',
        '左指针三角形',
        '黑色左角三角形'
    ],
    '🔼': [
        '更新按钮',
        '上三角形',
        '上点三角形',
        '上点小红三角形'
    ],
    '🔽': [
        '向下按钮',
        '下三角形',
        '正在下点三角形',
        '低点红三角形'
    ],
    '⏩': [
        '快速转发按钮',
        '快速向导',
        '快速转发符号',
        '黑色右点双三角形'
    ],
    '⏪': [
        'Fast Reverse Button',
        'Rewind',
        '倒退符号',
        '黑色左双角三角形'
    ],
    '⏫': [
        '快速按钮',
        '双角三角形',
        '黑色上点双三角形'
    ],
    '⏬': [
        '快速向下按钮',
        '双角三角形',
        '黑色低点双三角形'
    ],
    '⏹️': [
        '停止按钮',
        '停止',
        '停止符号',
        '黑方正方形以停止'
    ],
    '⏏️': [
        '弹出按钮',
        'Eject Symbol'
    ],
    '🎦': [
        '电影座',
        '电影屏幕',
        '电影',
        '胶片',
        '电影符号',
        '录制中'
    ],
    '📶': [
        '天线条',
        '接收栏',
        '信号强度',
        'Stairs',
        '信号强度符号',
        '带条的天线'
    ],
    '✖️': [
        '加成',
        '乘号',
        '重型乘法 X'
    ],
    '➕': [
        '加号',
        '加符号',
        '重加标志'
    ],
    '➖': [
        'Minus',
        'Minus Symbol',
        '重型小标志牌'
    ],
    '➗': [
        '拆分',
        'Division Symbol',
        '重型师标志'
    ],
    '♾️': [
        '无限的',
        '永久性纸牌'
    ],
    '‼️': [
        '双采集标记',
        '红色双采集标记'
    ],
    '⁉️': [
        '探索问题标记',
        '红采集标记和问题标记'
    ],
    '❓': [
        '问题标记',
        '红色问题标记',
        '黑色问题标记排行'
    ],
    '❔': [
        '白问题标记',
        '白问题标记',
        '白色问题标记Ornement'
    ],
    '❗': [
        '曝光标记',
        '红采集标记',
        '重型散布标记符号'
    ],
    '❕': [
        '白色的装饰标记',
        '白色彩装饰'
    ],
    '⭕': [
        'Hollow 红色圆',
        '圆圈',
        '正确',
        '红圆',
        '圆形标记',
        '重型大圆'
    ],
    '☑️': [
        '勾选复选框',
        '五',
        '复选框',
        '勾选框中标记',
        '带有选票的选票箱'
    ],
    '✔️': [
        '检查标记',
        '五',
        '检查',
        '刻度',
        'Checkmark',
        '重型检查标记'
    ],
    '❌': [
        '交叉标记',
        '十字线',
        'X'
    ],
    '✅': [
        '检查标记按钮',
        '五',
        '绿色检查标记',
        '绿色梯子',
        '检查标记',
        '白色重型检查标记'
    ],
    '❎': [
        '交叉标记按钮',
        '十字线',
        'X',
        'X 标记',
        '正方形交叉标记'
    ],
    '#️⃣': [
        '密钥号码签名',
        '#',
        '哈希键',
        '标签',
        '八十年代的胸甲',
        '磅密钥',
        '号码签名'
    ],
    '*️⃣': [
        'Keycap Asterisk',
        '星星按键值'
    ],
    '0️⃣': [
        '数字 0',
        'Keycap Digit Zero'
    ],
    '1️⃣': [
        '数字1',
        'Keycap 数字一个'
    ],
    '2️⃣': [
        '数字2',
        'Keycap 数字二'
    ],
    '3️⃣': [
        '数字3',
        'Keycap 数字3'
    ],
    '4️⃣': [
        '数字4',
        'Keycap 数字四'
    ],
    '5️⃣': [
        '第 5 号',
        'Keycap 数字5'
    ],
    '6️⃣': [
        '第 6 条',
        'Keycap 数字6'
    ],
    '7️⃣': [
        '第 7 号',
        'Keycap Digit Seven'
    ],
    '8️⃣': [
        '第 8 条',
        'Keycap 数字8'
    ],
    '9️⃣': [
        '号码',
        '密钥数字九'
    ],
    '🔟': [
        '第 10 条',
        'Keycap: 10',
        '10',
        'Keycap 数字 10'
    ],
    '🔠': [
        'Input Latin Uppercase',
        'ABCD',
        '大写',
        '大写字母输入符号',
        '拉丁字母输入符号'
    ],
    '🔡': [
        'Input Latin Lowercase',
        '巴克德',
        '小写',
        '小写字母输入符号',
        '拉丁字母输入符号'
    ],
    '🔢': [
        'Input Numbers',
        '1234',
        '数字',
        'Numeric Input',
        '数字输入符号'
    ],
    '🔣': [
        '符号输入符号',
        '符号',
        '符号输入'
    ],
    '🔤': [
        'Input Latin Letters',
        'bc',
        '字母表',
        '字母',
        '字母输入符号',
        '拉丁字母输入符号'
    ],
    '🅰️': [
        '按钮(布局类型)',
        '血型A',
        '第 A 条',
        '负平面拉丁字母A'
    ],
    '🆎': [
        'AB 按钮(布局类型)',
        '字母 AB',
        '血型AB',
        '负平方 AB'
    ],
    '🅱️': [
        'B 按钮(布局类型)',
        '第 B 条',
        '血型B',
        '负平面拉丁字母B'
    ],
    '🆑': [
        'CL 按钮',
        '清空',
        '清除按钮',
        'CL 标志',
        '平方 CL',
        '字母 CL'
    ],
    '🆒': [
        '棉花按钮',
        '冷正方形',
        '很酷的标志',
        '正方形酷色'
    ],
    '🆓': [
        '免费按钮',
        '免费的',
        '免费签名',
        '空闲平方'
    ],
    'ℹ️': [
        '信息',
        '信息',
        '小写I',
        '旅游信息',
        '信息来源'
    ],
    '🆔': [
        'ID 按钮',
        'ID',
        '1. 身份识别',
        '标识符',
        '方形ID'
    ],
    '🆕': [
        '新按钮',
        '新的',
        '新建标志',
        '新建平方'
    ],
    '🅾️': [
        'O 按钮(布局类型)',
        '血型O',
        '0',
        '负平面拉丁文资本信',
        '字母O'
    ],
    '🆗': [
        '确定按钮',
        '好的',
        '好的',
        '方形',
        '确定签名',
        '正方形'
    ],
    '🅿️': [
        'P按钮',
        '停车标志',
        '负平面拉丁文资本信',
        '信 P'
    ],
    '🆘': [
        'SOS按钮',
        '危难信号',
        '紧急情况',
        'SOS',
        'SOS 签名',
        'SOS 平方',
        '帮助'
    ],
    '🆙': [
        '上传！按钮',
        '等级向上',
        '上移',
        '上次注册',
        '用探险标记上方平方'
    ],
    '🆚': [
        'Vs 按钮',
        '平方'
    ],
    '🆖': [
        'NG 按钮',
        '平方 NG',
        '没有很好的标志',
        '不好',
        'NG',
        '环绕器'
    ],
    '🔴': [
        '红圆',
        '大红圆'
    ],
    '🟠': [
        '橙色圆',
        '大橙色圆圈'
    ],
    '🟡': [
        '黄色圆圈',
        '大黄色圆圈'
    ],
    '🟢': [
        '绿色圆',
        '大绿色圆'
    ],
    '🔵': [
        '蓝色圆圈',
        '大蓝圆'
    ],
    '🟣': [
        '紫色圆',
        '大型紫色圆'
    ],
    '🟤': [
        '棕色圆',
        '大棕色圆'
    ],
    '⚫': [
        '黑色圆',
        '中等黑色圆'
    ],
    '⚪': [
        '白圆',
        '中等白圆'
    ],
    '🟥': [
        '红色方形',
        '大红色正方形'
    ],
    '🟧': [
        '橙色方形',
        '大橙色方形'
    ],
    '🟨': [
        '黄色方形',
        '大黄色方形'
    ],
    '🟩': [
        '绿色方形',
        '大绿方形'
    ],
    '🟦': [
        '蓝色方形',
        '大蓝色方形'
    ],
    '🟪': [
        '紫色方形',
        '大型紫色正方形'
    ],
    '🟫': [
        '棕色方形',
        '大棕色方形'
    ],
    '⬛': ['黑色大方形'],
    '⬜': ['白色大方形'],
    '◼️': ['黑色中方格'],
    '◻️': ['白中方格'],
    '◾': ['黑色中型小方形'],
    '◽': ['白中型小方形'],
    '▪️': ['黑色小方形'],
    '▫️': ['白色小方形'],
    '💠': [
        '钻石形状内有点的圆点',
        '切割性',
        '钻石花板',
        '卡瓦尼'
    ],
    '🔶': ['大型橙色钻石公司'],
    '🔷': ['大型蓝钻石公司'],
    '🔸': ['小型橙色钻石公司'],
    '🔹': ['小蓝宝石公司'],
    '🔺': [
        '红色三角形指针上',
        '上点红三角形'
    ],
    '🔻': [
        '红色三角形下点',
        '下点红三角形'
    ],
    '🔳': ['白方按钮'],
    '🔲': ['黑方按钮'],
    '©️': [
        '版权所有',
        '版权签名'
    ],
    '®️': [
        '已注册',
        '注册标志'
    ],
    '™️': [
        '交易标记',
        '四月',
        '商标：',
        '交易标记标志'
    ],
    '🛅': [
        '左行李数',
        '带密钥的包',
        '锁定套装'
    ],
    '🛄': ['行李索赔'],
    '🛃': ['B. 海关事务'],
    '🛂': [
        '护照管制',
        '边境管制'
    ],
    '🚰': [
        '饮用水符号',
        '第三次会议',
        '第三次会议',
        '水龙头',
        '水水'
    ],
    '🇦': [
        '第 A 条',
        '区域指标编号字母A'
    ],
    '🇧': [
        '第 B 条',
        '区域指标符号信B'
    ],
    '🇨': [
        '第 C 条',
        '区域指标符号信C'
    ],
    '🇩': [
        '第 D 条',
        '区域指标符号信 D'
    ],
    '🇪': [
        '第 E 条',
        '区域指标编号字母E'
    ],
    '🇫': [
        '第 F 条',
        '区域指标符号信F'
    ],
    '🇬': [
        '第 G 条',
        '区域指标符号信G'
    ],
    '🇭': [
        '第 H 条',
        '区域指标符号信 H'
    ],
    '🇮': [
        '信件一',
        '区域指标编号I'
    ],
    '🇯': [
        '信件J',
        '区域指标符号信J'
    ],
    '🇰': [
        '信件K',
        '区域指标符号信K'
    ],
    '🇱': [
        '信 L',
        '区域指标符号信L'
    ],
    '🇲': [
        '信 M',
        '区域指标符号信M'
    ],
    '🇳': [
        '信 N',
        '区域指标符号信N'
    ],
    '🇴': [
        '字母O',
        '区域指标符号字母O'
    ],
    '🇵': [
        '信 P',
        '区域指标符号 P'
    ],
    '🇶': [
        '第 Q 章',
        '区域指标符号字母Q'
    ],
    '🇷': [
        '字母 R',
        '区域指标符号信R'
    ],
    '🇸': [
        '第 S 条',
        '区域指标符号信S'
    ],
    '🇹': [
        '字母 T',
        '区域指标符号信T'
    ],
    '🇺': [
        '字母 U',
        '区域指标编号字母U'
    ],
    '🇻': [
        '第 五 章',
        '区域指标符号字母V'
    ],
    '🇼': [
        '字母 W',
        '区域指标符号(W)'
    ],
    '🇽': [
        '字母 X',
        '区域指标符号信X'
    ],
    '🇾': [
        '第 Y 条',
        '区域指标符号字母Y'
    ],
    '🇿': [
        '字母 Z',
        '区域指标符号信Z'
    ],
    '💌': [
        '喜欢的信',
        '心灵信封',
        '爱情笔记'
    ],
    '🚮': [
        '将垃圾放在其地方符号',
        '箱牌里的垃圾箱',
        '将垃圾放入回收站',
        '带垃圾的人'
    ],
    '♿': [
        '轮椅符号',
        '可访问的浴室'
    ],
    '🚹': [
        '几分钟符号',
        '男符号',
        'Mens厕所',
        '男性重生',
        '男性WC'
    ],
    '🚺': [
        '妇女符号',
        '妇女符号',
        '妇女厕所',
        '女性Restroom',
        'Famale WC'
    ],
    '🚻': [
        '重试',
        '浴室标志',
        '厕所标志',
        'WC 签名'
    ],
    '🚼': [
        '婴儿符号',
        '婴儿更换站',
        '婴儿更改符号',
        '托儿所'
    ],
    '🚾': [
        '水箱',
        '西北地区',
        '厕所'
    ],
    '⚠️': [
        '警告标志',
        '警报符号'
    ],
    '🚸': [
        '儿童横道',
        '正在跨越儿童',
        '学校交叉路由'
    ],
    '🔅': [
        '低亮度符号',
        '暗淡按钮',
        '降低亮度'
    ],
    '🔆': [
        '高亮度符号',
        '增强亮度',
        '明亮按钮'
    ],
    '📳': [
        '振动模式',
        '手机心',
        '静音模式'
    ],
    '📴': ['手机已关闭'],
    '〰️': [
        '波形',
        '瓦维·达什文'
    ],
    '💱': ['货币交易'],
    '💲': [
        '重金签名',
        '美元',
        '美元签名'
    ],
    '♻️': [
        '黑色通用回收符号',
        '回收符号',
        '回收标志'
    ],
    '🔱': [
        '三叉戟标志',
        '波切福克',
        '三叉戟'
    ],
    '📛': [
        '姓名徽章',
        '火上的Tofu',
        '名称标签',
        '火焰标签'
    ],
    '🔰': [
        '日本初学者符号',
        'Shoshinsha 标记',
        '黄绿色盾'
    ],
    '➰': [
        '曲线循环',
        '管理循环',
        '循环'
    ],
    '➿': [
        '双曲线循环',
        '双曲线循环',
        '语音邮件'
    ],
    '〽️': [
        '备用标记部分',
        'M',
        '麦克唐纳的'
    ],
    '✳️': ['八个点星星'],
    '✴️': [
        '八个点黑星',
        '橙色星星',
        '八个点星星'
    ],
    '❇️': ['萨帕克尔'],
    'Ⓜ️': [
        'Circled Latin Capital Letter M',
        '圆形M',
        '地铁公司',
        '圆形M'
    ],
    '🈁': [
        'Squared Katakana Koko',
        '日语字标志在这里的含义',
        '在这里',
        '目标'
    ],
    '🈂️': [
        'Squared Katakana Sa',
        '日本标志意义服务或服务充电'
    ],
    '🈷️': [
        'CJK 单一地形平方 6708',
        '偏差 74',
        '月',
        '日本标志意义每月金额'
    ],
    '🈶': [
        'CJK 单一地形平面6709',
        '日本标志意义非免费的',
        '自己的',
        '有'
    ],
    '🈯': [
        '正方形CJK统一地形学-6307',
        '日本标志意义保留',
        '指针',
        '指'
    ],
    '🉐': [
        '圆形意识形态优势',
        '日本标志意义交易',
        '获取',
        '得'
    ],
    '🈹': [
        'CJK单一地形平方',
        '日本标志意义折扣',
        '交易销售',
        '割'
    ],
    '🈚': [
        'CJK单一地形平方',
        '日本标志无需充电',
        '缺失的',
        '無'
    ],
    '🈲': [
        '正方形CJK 单一地形-7981',
        '禁止日本标志',
        'Forbid',
        '禁'
    ],
    '🉑': [
        '圆形意识形态接受',
        '日本标志意义可接受',
        '接受'
    ],
    '🈸': [
        'CJK单一地形平方',
        '日本标志意义应用程序',
        '应用程序表单',
        '猴子',
        '请求',
        '申'
    ],
    '🈴': [
        '正方形CJK 统一地形学-5408',
        '日语标志意义传输(花旗)',
        '协议',
        '合'
    ],
    '🈳': [
        'CJK 单一地形平方-7a7a',
        '日本标志着出缺率',
        '空和可用',
        '空'
    ],
    '㊗️': [
        '圆形创意成员表示祝贺。',
        '日本标志性恭喜。'
    ],
    '㊙️': [
        '圆形思想图密钥',
        '日本标志意义密钥',
        '密文'
    ],
    '🈺': [
        'CJK 单一地形平方 55b6',
        '日语标志“开放供商务”',
        '工作',
        '営'
    ],
    '🈵': [
        '正方形CJK 统一地形学-6e80',
        '日本标志意义已满；无缺性',
        '完整的',
        '満'
    ],
    '🔘': ['单选按钮'],
    '🛑': [
        '停止签名',
        '八角形标志'
    ],
    '⚕️': [
        '医疗符号',
        'Aesculapus',
        'Asklepios',
        '阿斯克利皮乌斯之戒指',
        'Aesculapus 的法杖'
    ],
    '🛗': [
        '电梯器',
        '升起'
    ],
    '⚧️': ['变形符号'],
    '♂️': [
        '男性标志',
        '人符号',
        '火星符号'
    ],
    '♀️': [
        '女性标志',
        '妇女符号',
        'Venus Symbol'
    ]
};
/*food and drinks*/
emojis_language[lang][6] = {
    '🍇': [
        '图形',
        '格瑞克'
    ],
    '🍈': [
        '梅伦文',
        'Cantaloupe',
        '哈尼得德',
        'Muskmelon'
    ],
    '🍉': ['西梅隆州'],
    '🍊': [
        'Tangerine',
        'Mandarin',
        '橙色'
    ],
    '🍋': [
        '莱蒙文',
        '莱蒙纳德'
    ],
    '🍌': [
        '香蕉色',
        '平板'
    ],
    '🍍': ['线性苹果'],
    '🥭': ['Mango'],
    '🍎': [
        '红苹果',
        '红色美丽苹果'
    ],
    '🍏': [
        '绿色苹果',
        '金色美味苹果',
        '格兰尼·史密斯苹果'
    ],
    '🍐': ['宠物'],
    '🍑': [
        '山羊',
        '底部',
        '布特特'
    ],
    '🍒': [
        '切里斯',
        '渡子',
        '野生宝箱'
    ],
    '🍓': ['草莓智能手势'],
    '🥝': [
        'Kiwi 水果',
        '中国山羊浆果',
        '基维文',
        '基维水果'
    ],
    '🍅': ['Tomato'],
    '🥥': [
        '椰子',
        'Cocoanut'
    ],
    '🥑': ['Avocado'],
    '🍆': [
        '鸡蛋',
        'Aubergine',
        '语句',
        '紫色蔬菜：'
    ],
    '🥔': [
        '土豆案',
        '巴克土豆',
        '爱达荷波塔'
    ],
    '🥕': ['胡萝卜师'],
    '🌽': [
        '玉米之耳的耳机',
        '玉米',
        'Corn On the Cob',
        '玉米',
        '玉米之鹰座'
    ],
    '🌶️': [
        '热肽段',
        'Chili Pepper',
        '皮科文'
    ],
    '🥒': [
        '黄瓜座',
        '格尔金文',
        '选取项'
    ],
    '🥬': [
        '叶绿灯',
        '靴子',
        '华人客车',
        'Cos Lettuce',
        'Romaine Lettuce',
        '叶绿人'
    ],
    '🥦': ['Brocoli'],
    '🍄': [
        '马歇尔室',
        '聊天室',
        'Toadstool'
    ],
    '🥜': [
        'Peanuts',
        '努特斯'
    ],
    '🌰': [
        '坚固的胸甲',
        'Acorn',
        '努特文'
    ],
    '🍞': [
        '面包',
        '面包图'
    ],
    '🥐': ['Croissant'],
    '🥖': [
        'Baguette 面包',
        '法语面包',
        '巴吉特'
    ],
    '🥨': ['Pretzel'],
    '🥯': ['巴盖尔'],
    '🥞': [
        '南克',
        '爬行者',
        '热箱'
    ],
    '🧀': [
        '奶酪[等腰斜面]',
        '作弊模式'
    ],
    '🍖': [
        '骨上的肉',
        'BQ',
        'Barbecue',
        '曼加肉'
    ],
    '🍗': [
        'Poultry Leg',
        '鼓棍子',
        '土耳其列克'
    ],
    '🥩': [
        '切割肉',
        '肉',
        '斯泰克'
    ],
    '🥓': [
        '巴昆文',
        'Rashers'
    ],
    '🍔': [
        '汉堡语',
        'Burger',
        '谢斯伯格尔'
    ],
    '🍟': [
        '法国Fries',
        '奇普斯',
        '朋友',
        '麦克唐纳的朋友'
    ],
    '🍕': [
        '比萨文',
        'Peperoni Pizza',
        '比萨的切片'
    ],
    '🌭': [
        '热门',
        '热点',
        '萨沃斯'
    ],
    '🥪': ['桑威奇州'],
    '🌮': ['塔科'],
    '🌯': [
        'Burrito',
        '换行'
    ],
    '🥙': [
        '填充平面包',
        'Doner Kebab',
        'Gyro',
        '沙瓦尔马',
        '皮塔桑威奇州'
    ],
    '🍳': [
        '烹饪中',
        '早餐',
        '好友蛋',
        '碎式平移'
    ],
    '🥘': [
        '浅色的食物平移',
        'Paella',
        '食物平移'
    ],
    '🍲': [
        '食物点',
        '食物之球',
        '灵魂声',
        '剑士'
    ],
    '🥣': [
        '与Spoon一起弓箭手',
        '谷物弓箭手'
    ],
    '🥗': [
        '绿色沙拉德',
        '沙拉德'
    ],
    '🍿': [
        '弹出色',
        '弹出玉米'
    ],
    '🧂': [
        '盐类',
        'Salt Shaker'
    ],
    '🥫': [
        '预制的Ê³ÎïÏûºÄÊ³ÎïÏûºÄÊ³Îï²úÁ¿µÄÊ³Îï²úÁ¿£¬²úÁ¿´ÎïÏûºó£¬²ú²ú²úÁ¿³Îï²úÁ¿£¬²úÁ¿´ó²ú²úÁ¿·£¡',
        '食物罐头',
        'Tin Can',
        '美味的食物：'
    ],
    '🍱': [
        'Bento Box',
        '午餐箱'
    ],
    '🍘': [
        '大米切克尔',
        '破片机'
    ],
    '🍙': [
        '水稻球',
        'Onigiri'
    ],
    '🍚': [
        '煮熟的水稻',
        '水稻水管',
        '水稻',
        '稻谷之球',
        'Steam稻子'
    ],
    '🍛': [
        '宵禁水稻：',
        '库里文',
        '印度粮食公司',
        '柯里和稻米公司'
    ],
    '🍜': [
        'Steam步枪',
        'Noodles',
        '带有聊天标志的噪音',
        '拉姆文'
    ],
    '🍝': [
        'Spaghetti',
        '帕斯塔文'
    ],
    '🍠': [
        '旋转的甜蜜土豆',
        '甜蜜土豆',
        'Yam'
    ],
    '🍢': [
        '奥登省',
        'Kebab',
        '切换器'
    ],
    '🍣': [
        '苏希文',
        'Sashimi',
        '1. 海食'
    ],
    '🍤': [
        '好斗的虾类',
        '弗里德·普拉恩文',
        '虾Tempura'
    ],
    '🍥': [
        '鱼蛋糕与猪肉',
        '鱼蛋糕！',
        'Pink Swirl'
    ],
    '🥮': [
        '月球蛋糕座',
        '月考克'
    ],
    '🍡': [
        'Dango',
        '德斯特·斯克',
        '粉红色白色绿色球'
    ],
    '🥟': [
        '反转',
        'Empanada',
        'Pierogi'
    ],
    '🥠': ['幸运的 Cookie'],
    '🥡': [
        '弹出框',
        '中国食物箱',
        'Oyster Pail'
    ],
    '🍦': [
        '软冰克里姆',
        '惠普先生',
        '软服务'
    ],
    '🍧': [
        'Shaved Ice',
        '雪锥形'
    ],
    '🍨': [
        '冰箱',
        '冰激素之球',
        '德斯特'
    ],
    '🍩': [
        '坚固战利品',
        'Donut'
    ],
    '🍪': [
        'Cookie',
        '比斯库伊特',
        '巧克力Chip Cookie'
    ],
    '🎂': [
        '生日蛋糕。',
        '生日',
        '蛋糕！',
        '蛋糕带糖果。'
    ],
    '🍰': [
        '短蛋糕！',
        '蛋糕！',
        '蛋糕块',
        '草莓短cake'
    ],
    '🧁': [
        '杯子',
        '美丽蛋糕！'
    ],
    '🥧': ['Pie'],
    '🍫': [
        '巧克力条',
        '糖果栏',
        '巧克力者'
    ],
    '🍬': [
        '糖果座',
        'Lolly',
        '甜蜜座'
    ],
    '🍭': [
        'Lollipop',
        '苏克尔'
    ],
    '🍮': [
        '库塔德',
        'Creme Caramel',
        '德斯特',
        '平兰',
        '正在推送'
    ],
    '🍯': [
        '蜂蜜Pot',
        '蜂蜜。',
        '点数'
    ],
    '🍼': [
        '婴儿瓶子',
        '瓶子饲料'
    ],
    '🥛': [
        '牛奶的玻璃子',
        '牛奶座'
    ],
    '☕': [
        '热饮料',
        '咖啡店',
        'Espresso',
        '霍科拉特',
        '茶色'
    ],
    '🍵': [
        '没有处理的Teacup',
        '绿色茶色',
        'Matcha',
        'Matcha Green Tea'
    ],
    '🍶': [
        'Sake',
        '瓶子',
        '大米威尼',
        '萨克瓶和杯子'
    ],
    '🍾': [
        '带有弹出公司的瓶子',
        '庆祝活动',
        'Champagne',
        '雪松葡萄酒座'
    ],
    '🍷': [
        '葡萄糖玻璃子',
        '酒类',
        '红Wine',
        '威尼'
    ],
    '🍸': [
        '鸡尾酒玻璃子',
        '鸡尾鱼',
        '马提尼'
    ],
    '🍹': [
        '热带饮料',
        '水果拳击手',
        'Tiki 饮料'
    ],
    '🍺': [
        '啤酒Mug',
        '比尔',
        '啤酒Stein'
    ],
    '🍻': [
        '闪烁啤酒Mugs',
        '比尔斯',
        '作弊模式'
    ],
    '🥂': [
        '闪烁眼镜',
        '庆祝活动',
        'Champagne Glasses',
        '作弊模式'
    ],
    '🥃': [
        '突变玻璃板',
        '博尔卡',
        '酒类',
        'Rum',
        'Whiskey',
        'Whisky'
    ],
    '🥤': [
        '带草的杯子',
        '密尔克晃动',
        '平滑模式',
        '索达弹头',
        '软饮料'
    ],
    '🥢': ['棍子'],
    '🍽️': [
        '叉和刀带板',
        '餐厅'
    ],
    '🍴': [
        'Fork 和 Knife',
        '切换器',
        '刀和派生工具',
        'Silverware'
    ],
    '🥄': ['Spoon'],
    '🧄': ['大尔文'],
    '🧅': ['奥尼昂州'],
    '🧇': ['Waffle'],
    '🧆': ['Falafel'],
    '🧈': ['布特特'],
    '🦪': ['奥斯特尔'],
    '🧃': [
        '饮料箱',
        'Juice Box'
    ],
    '🧉': [
        '导师饮料',
        '奇马尔拉沃索',
        'Cimarrón',
        '耶尔巴梅特'
    ],
    '🫒': ['橄榄色'],
    '🫐': ['蓝色浆果'],
    '🫑': ['响铃肽段'],
    '🫓': ['平面包'],
    '🫔': [
        '塔马勒语',
        '塔迈尔'
    ],
    '🫕': ['Fondue'],
    '🧋': [
        '泡泡茶色',
        'Boba'
    ],
    '🧊': ['冰立方体']
};
/*flags*/
emojis_language[lang][7] = {
    '🏁': [
        '廉价标志',
        '检查标记',
        '网格Girl',
        '竞赛标志'
    ],
    '🚩': [
        '三角标志',
        '在极地上标记',
        '红色标志',
        '帖子上的三角标志'
    ],
    '🎌': [
        '交叉标志',
        '两个标志'
    ],
    '🏴': [
        '黑色标志',
        '挥舞黑标志'
    ],
    '🏳️': [
        '白标志',
        '擦除白色标志'
    ],
    '🏳️‍🌈': [
        '彩虹标志',
        'Pride Flag'
    ],
    '🏳️‍⚧️': [
        '转发标志',
        '蓝色、粉红色和白旗。',
        'Trans 标志'
    ],
    '🏴‍☠️': [
        '海盗标志',
        'Jolly Roger'
    ],
    '🇺🇳': [
        '联合国的标志',
        '联合国',
        '标志：联合国'
    ],
    '🇪🇺': [
        '欧洲联盟的标志',
        'EU',
        '旗帜：欧洲联盟',
        'EU Flag'
    ],
    '🇦🇨': [
        '阿森松岛标志',
        'AC'
    ],
    '🇦🇩': [
        '安道尔标志',
        'AD',
        'Andorran Flag'
    ],
    '🇦🇪': [
        '阿拉伯联合酋长国国旗a',
        'AE',
        'Emirati Flag',
        'UAE 标志'
    ],
    '🇦🇫': [
        '阿富汗标志',
        'AF',
        'Afghan Flag'
    ],
    '🇦🇬': [
        '安提瓜和巴布达的标志',
        'AG'
    ],
    '🇦🇮': [
        '二. 安圭拉标志',
        'AI',
        '安圭拉标志'
    ],
    '🇦🇱': [
        '阿尔巴尼亚标志',
        '附 件',
        '阿尔巴尼亚标志'
    ],
    '🇦🇲': [
        '亚美尼亚标志',
        '凌晨5时',
        '🇦🇲'
    ],
    '🇦🇴': [
        '安哥拉标志',
        'AO',
        '安哥拉标志'
    ],
    '🇦🇶': [
        '南极海生委的标志',
        'AQ',
        '南极标志'
    ],
    '🇦🇷': [
        '阿根廷标志',
        'AR',
        '阿根廷标志'
    ],
    '🇦🇸': [
        '美属萨摩亚国旗。',
        'AS',
        'American Samoan Flag'
    ],
    '🇦🇹': [
        '奥地利标志',
        '英雄座',
        'Austrian Flag'
    ],
    '🇦🇺': [
        '澳大利亚的标志',
        'AU',
        'Aussie 标志',
        '澳大利亚标志'
    ],
    '🇦🇼': [
        '阿鲁巴的标志',
        'AW',
        '阿鲁巴标志'
    ],
    '🇦🇽': [
        '阿特兰群岛标志',
        'AX',
        '阿塞特兰标志'
    ],
    '🇦🇿': [
        '阿塞拜疆国旗案',
        'AZ',
        '阿塞拜疆标志'
    ],
    '🇧🇦': [
        '波斯尼亚和黑塞哥维那标志',
        'BA'
    ],
    '🇧🇧': [
        '巴巴多斯标志',
        'BB',
        '巴巴多斯标志',
        'Bajan 标志'
    ],
    '🇧🇩': [
        '孟加拉国的标志',
        'BD',
        'Bangladeshi Flag'
    ],
    '🇧🇪': [
        '比利时标志',
        'BE',
        '比利时标志'
    ],
    '🇧🇫': [
        '布基纳法索的标志',
        '高帧率',
        '布基纳法索标志'
    ],
    '🇧🇬': [
        'Bulgaria',
        '蓝图',
        '保加利亚标志'
    ],
    '🇧🇭': [
        '巴林标志',
        'BH',
        '巴赫拉尼标志',
        '巴林标志'
    ],
    '🇧🇮': [
        '布隆迪标志',
        'BI',
        'Burundian Flag'
    ],
    '🇧🇯': [
        '贝宁标志',
        'BJ',
        '贝宁标志'
    ],
    '🇧🇱': [
        '圣巴特莱米的标志',
        'BL',
        '旗帜：圣巴泰勒米'
    ],
    '🇧🇲': [
        '百慕大国旗a',
        '蓝图',
        'Bermudan Flag'
    ],
    '🇧🇳': [
        '文莱的标志',
        'BN',
        '布鲁尼安标志'
    ],
    '🇧🇴': [
        '玻利维亚标志',
        'BO',
        'Bolivian Flag'
    ],
    '🇧🇶': [
        '加勒比荷兰旗帜。',
        '字节',
        'Bonaire'
    ],
    '🇧🇷': [
        '巴西标志',
        'BR',
        '巴西标志'
    ],
    '🇧🇸': [
        '巴哈马标志',
        '巴哈马标志',
        '蓝图'
    ],
    '🇧🇹': [
        '不丹的标志',
        '蓝图',
        '不丹标志'
    ],
    '🇧🇻': [
        '布维特岛国旗图',
        'BV',
        '旗帜：布维特岛'
    ],
    '🇧🇼': [
        '博茨瓦纳标志',
        'BW',
        'Batswana Flag'
    ],
    '🇧🇾': [
        '白俄罗斯国旗：',
        '作者',
        '白俄罗斯标志'
    ],
    '🇧🇿': [
        '伯利兹标志',
        'BZ',
        '伯利兹标志'
    ],
    '🇨🇦': [
        '加拿大标志',
        '加拿大标志',
        'CA'
    ],
    '🇨🇨': [
        '可可(基林)群岛',
        'CC'
    ],
    '🇨🇩': [
        'Flag of Congo - Kinshasa',
        'CD'
    ],
    '🇨🇫': [
        '中非共和国的标志',
        'CF',
        '中部非洲标志'
    ],
    '🇨🇬': [
        '刚果国旗-布拉柴维尔',
        'CG'
    ],
    '🇨🇭': [
        '瑞士标志',
        'CH',
        'Red Cross',
        '瑞士标志'
    ],
    '🇨🇮': [
        '象牙海岸标志',
        'CI',
        'Flag: Côte d’Ivoire'
    ],
    '🇨🇰': [
        '库克群岛的标志',
        '卡克',
        '库克群岛岛民标志'
    ],
    '🇨🇱': [
        '智利标志',
        'CL',
        '智利标志'
    ],
    '🇨🇲': [
        '喀麦隆标志',
        'CM',
        '喀麦隆标志'
    ],
    '🇨🇳': [
        '中国标志',
        'CN',
        '中文标志'
    ],
    '🇨🇴': [
        '哥伦比亚标志',
        '炼钢厂公司',
        '哥伦比亚标志'
    ],
    '🇨🇵': [
        '克利珀顿岛的标志',
        'CP',
        '旗帜： 克利珀顿岛'
    ],
    '🇨🇷': [
        '哥斯达黎加标志',
        'CR',
        '哥斯达黎加标志'
    ],
    '🇨🇺': [
        '古巴旗帜：',
        'CU',
        '古巴标志'
    ],
    '🇨🇻': [
        '佛得角标志',
        'CV',
        '佛得角标志'
    ],
    '🇨🇼': [
        '库拉索岛标志',
        'CW',
        'Curaçaoan Flag'
    ],
    '🇨🇽': [
        '圣诞岛标志',
        'CX',
        '圣诞岛标志'
    ],
    '🇨🇾': [
        '塞浦路斯标志',
        'CY',
        '塞浦路斯标志'
    ],
    '🇨🇿': [
        '捷克徽章',
        'CZ',
        '捷克标志'
    ],
    '🇩🇪': [
        '德国标志',
        '度',
        'Deutsch 标志',
        '德国标志'
    ],
    '🇩🇬': [
        'Diego Garcia的标志',
        'DG',
        '旗帜： Diego Garcia'
    ],
    '🇩🇯': [
        '吉布提标志',
        'DJ',
        'Djibouti Flag',
        'Djiboutian Flag'
    ],
    '🇩🇰': [
        '丹麦标志',
        'DK',
        '丹麦标志'
    ],
    '🇩🇲': [
        '多米尼克的标志',
        '私信'
    ],
    '🇩🇴': [
        '多米尼加共和国的标志',
        '待定',
        'Tom Rep 标志',
        '多米尼加标志'
    ],
    '🇩🇿': [
        '阿尔及利亚的标志',
        'DZ',
        'Algerian Flag'
    ],
    '🇪🇦': [
        '休达和梅利利亚标志',
        '梅利利亚的标志',
        '休达的标志',
        'EA',
        'Flag: Ceuta & Melilla'
    ],
    '🇪🇨': [
        '厄瓜多尔标志',
        'EC',
        'Ecuadorian Flag'
    ],
    '🇪🇪': [
        '爱沙尼亚标志',
        'EE',
        '爱沙尼亚标志'
    ],
    '🇪🇬': [
        '埃及标志',
        'EG',
        '埃及标志'
    ],
    '🇪🇭': [
        '2. 西撒哈拉旗帜。',
        'EH',
        '西撒哈拉标志'
    ],
    '🇪🇷': [
        '厄立特里亚的标志',
        '东区',
        'Eritrean Flag'
    ],
    '🇪🇹': [
        '埃塞俄比亚标志',
        'ET',
        'Ethiopian Flag'
    ],
    '🇪🇸': [
        '西班牙标志',
        '秒',
        '西班牙标志'
    ],
    '🇫🇮': [
        '芬兰标志',
        'FI',
        '芬兰标志'
    ],
    '🇫🇯': [
        '斐济标志',
        'FJ',
        'Fijian Flag'
    ],
    '🇫🇰': [
        '福克兰群岛的标志',
        'FK',
        'Falklander 标志'
    ],
    '🇫🇲': [
        '密克罗尼西亚标志',
        'FM',
        '密克罗尼西亚标志'
    ],
    '🇫🇴': [
        '法罗群岛标志',
        'FO',
        'Faroe Islander Flag'
    ],
    '🇫🇷': [
        '法国标志',
        '方程式',
        '法国标志'
    ],
    '🇬🇦': [
        '加蓬标志',
        'GA',
        '加蓬标志'
    ],
    '🇬🇧': [
        '大不列颠标志',
        'GB',
        '英国标志',
        '联合王国',
        '联合杰克',
        '联合王国'
    ],
    //"🏴󠁧󠁢󠁥󠁮󠁧󠁿": ["Flag of England", "St George's Cross", "English Flag"],
    //"🏴󠁧󠁢󠁷󠁬󠁳󠁿": ["Flag of Wales", "Welsh Flag", "Red Dragon", "Baner Cymru", "Y Ddraig Goch"],
    //"🏴󠁧󠁢󠁳󠁣󠁴󠁿": ["Flag of Scotland", "Scottish Flag", "St Andrew's Cross", "Saltire"],
    //"🏴󠁧󠁢󠁮󠁩󠁲󠁿": ["Flag of Northern Ireland"],
    '🇬🇩': [
        '格林纳达的标志',
        'GD',
        '手榴弹标志'
    ],
    '🇬🇪': [
        '格鲁吉亚标志',
        'GE',
        '格鲁吉亚标志'
    ],
    '🇬🇫': [
        '法属圭亚那标志',
        'GF',
        '法国几内亚标志'
    ],
    '🇬🇬': [
        '格恩西岛的标志',
        'GG',
        'Guernsey Flag'
    ],
    '🇬🇭': [
        '加纳标志',
        'GH',
        '加纳标志'
    ],
    '🇬🇮': [
        '直布罗陀旗帜',
        'GI',
        '直布罗陀标志'
    ],
    '🇬🇱': [
        '格陵兰的标志',
        'GL',
        'Greenlandic Flag'
    ],
    '🇬🇲': [
        '冈比亚标志',
        'GM',
        'Gambian Flag'
    ],
    '🇬🇳': [
        '几内亚标志',
        'GN',
        'Guinean Flag'
    ],
    '🇬🇵': [
        '瓜德罗普的标志',
        'GP',
        '瓜德罗普恩标志'
    ],
    '🇬🇶': [
        '赤道几内亚的标志',
        'GQ',
        'Equatorial Guinean Flag',
        '赤道仪标志'
    ],
    '🇬🇷': [
        '希腊标志',
        'GR',
        '希腊标志'
    ],
    '🇬🇸': [
        '南乔治亚岛和南桑威奇群岛',
        '一般事务人员'
    ],
    '🇬🇹': [
        '危地马拉标志',
        'GT',
        'Guatemalan Flag'
    ],
    '🇬🇺': [
        '关岛标志',
        'GU',
        '关岛标志',
        '查莫罗标志'
    ],
    '🇬🇼': [
        '几内亚比绍的标志',
        'GW',
        'Guinea-Bissau Flag'
    ],
    '🇬🇾': [
        '圭亚那的标志',
        'GY',
        '圭亚那标志'
    ],
    '🇭🇰': [
        '中国香港特别行政区标志',
        'HK',
        '香港标志'
    ],
    '🇭🇲': [
        '赫德和麦克唐纳群岛',
        'HM',
        '旗帜：赫德和麦克唐纳群岛'
    ],
    '🇭🇳': [
        '洪都拉斯国旗a',
        'HN',
        '洪都拉斯标志'
    ],
    '🇭🇷': [
        '克罗地亚标志',
        'B. 人力资源',
        '克罗地亚标志'
    ],
    '🇭🇹': [
        '海地国旗组织',
        'HT',
        'Haitian Flag'
    ],
    '🇭🇺': [
        '匈牙利标志',
        '冲锋枪',
        '匈牙利标志'
    ],
    '🇮🇨': [
        '加那利群岛的标志',
        'IC'
    ],
    '🇮🇩': [
        '印度尼西亚标志',
        'ID',
        '印度尼西亚标志'
    ],
    '🇮🇪': [
        '爱尔兰标志',
        '我的',
        '爱尔兰标志'
    ],
    '🇮🇱': [
        '以色列标志',
        'IL',
        '以色列标志'
    ],
    '🇮🇲': [
        '马恩岛标志',
        'IM',
        'Manx Flag'
    ],
    '🇮🇳': [
        '印度标志',
        '在',
        '印度标志'
    ],
    '🇮🇴': [
        '英属印度洋领土的标志',
        'IO',
        '英属印度洋领土标志'
    ],
    '🇮🇶': [
        '2. 伊拉克标志',
        'IQ',
        'Iraqi Flag'
    ],
    '🇮🇷': [
        '伊朗标志',
        'IR',
        '伊朗标志'
    ],
    '🇮🇸': [
        '冰岛标志',
        '礼包',
        '冰岛标志'
    ],
    '🇮🇹': [
        '意大利国旗：',
        '信息和通信',
        '意大利标志'
    ],
    '🇯🇪': [
        '泽西的标志',
        'JE',
        '泽西岛标志'
    ],
    '🇯🇲': [
        '牙买加标志',
        'JM',
        '牙买加标志'
    ],
    '🇯🇴': [
        '约旦标志',
        'JO',
        '约旦标志'
    ],
    '🇯🇵': [
        '日本标志',
        'JP',
        '日本标志'
    ],
    '🇰🇪': [
        '肯尼亚标志',
        'KE',
        '肯尼亚标志'
    ],
    '🇰🇬': [
        '吉尔吉斯斯坦的标志',
        'KG',
        'Kyrgyzstani Flag'
    ],
    '🇰🇭': [
        '柬埔寨标志',
        'KH',
        '柬埔寨标志'
    ],
    '🇰🇮': [
        '基里巴斯的标志',
        'KI',
        'I-Kiribati 标志'
    ],
    '🇰🇲': [
        '科摩罗旗帜：',
        'KM',
        '科摩罗标志'
    ],
    '🇰🇳': [
        '圣基茨和尼维斯的标志',
        'KN'
    ],
    '🇰🇵': [
        '北朝鲜的标志',
        'KP',
        '北朝鲜标志'
    ],
    '🇰🇷': [
        '南朝鲜的标志',
        'KR',
        '南朝鲜标志'
    ],
    '🇰🇼': [
        '科威特国旗a',
        'KW',
        'Kuwaiti Flag'
    ],
    '🇰🇾': [
        '开曼群岛的标志',
        'KY',
        '开曼标志'
    ],
    '🇰🇿': [
        '哈萨克斯坦标志',
        'KZ',
        'Kazakhstani Flag',
        'Kazakh Flag'
    ],
    '🇱🇦': [
        '老挝的标志',
        'LA',
        '老挝标志',
        '老挝标志'
    ],
    '🇱🇧': [
        '黎巴嫩标志',
        'LB',
        '黎巴嫩标志'
    ],
    '🇱🇨': [
        '圣卢西亚标志',
        'LC'
    ],
    '🇱🇮': [
        '列支敦士登标志',
        'LI',
        'Liechtensteiner 标志'
    ],
    '🇱🇰': [
        '斯里兰卡标志',
        'LK',
        '斯里兰卡标志'
    ],
    '🇱🇷': [
        '利比里亚国旗（利比里亚）',
        'LR',
        '利比里亚标志'
    ],
    '🇱🇸': [
        'Flag of Lesotho',
        'LS',
        'Basotho Flag'
    ],
    '🇱🇹': [
        '立陶宛的标志',
        '直线',
        '立陶宛标志'
    ],
    '🇱🇺': [
        '卢森堡标志',
        'LU',
        '卢森堡标志'
    ],
    '🇱🇻': [
        '拉脱维亚旗帜：',
        'LV',
        '拉脱维亚标志'
    ],
    '🇱🇾': [
        '利比亚标志',
        'LY',
        '利比亚标志'
    ],
    '🇲🇦': [
        '摩洛哥国旗案',
        'MA',
        '摩洛哥标志'
    ],
    '🇲🇨': [
        '摩纳哥标志',
        'MC',
        '摩纳哥公国标志'
    ],
    '🇲🇩': [
        '摩尔多瓦标志',
        'MD',
        '摩尔多瓦标志'
    ],
    '🇲🇪': [
        '黑山的标志',
        '我的',
        '黑山标志'
    ],
    '🇲🇫': [
        '圣马丁的标志',
        'MF',
        'Flag: St. Martin'
    ],
    '🇲🇬': [
        '马达加斯加的国旗：',
        'MG',
        'Madagascan Flag'
    ],
    '🇲🇭': [
        '马绍尔群岛的标志',
        'MH',
        '马歇尔标志'
    ],
    '🇲🇰': [
        '马其顿标志',
        'MK',
        '马其顿标志'
    ],
    '🇲🇱': [
        '马里标志',
        'ML',
        '马里标志'
    ],
    '🇲🇲': [
        '缅甸国旗（缅甸）',
        'MM',
        '缅甸标志',
        '缅甸的标志',
        '缅甸标志'
    ],
    '🇲🇳': [
        '蒙古国标志',
        'MN',
        '蒙古标志'
    ],
    '🇲🇴': [
        '中国澳门标志',
        '我的',
        'Macanese 标志'
    ],
    '🇲🇵': [
        '北马里亚纳群岛标志',
        'MP',
        '密克罗尼西亚标志'
    ],
    '🇲🇶': [
        '马提尼克标志',
        'MQ',
        '马提尼克斯国旗的蛇座',
        '马提尼克斯标志'
    ],
    '🇲🇷': [
        '毛里塔尼亚国旗a',
        'MR',
        '毛里塔尼亚标志'
    ],
    '🇲🇸': [
        'Flag of Montserrat',
        'MS',
        'Montserratian Flag'
    ],
    '🇲🇹': [
        '马耳他标志',
        'MT',
        'Maltese Flag'
    ],
    '🇲🇺': [
        'Flag of Mauritius',
        'MU',
        '毛里求斯标志'
    ],
    '🇲🇻': [
        '马尔代夫的标志',
        'MV',
        '马尔代夫标志'
    ],
    '🇲🇼': [
        '马拉维的标志',
        'MW',
        'Malawian Flag'
    ],
    '🇲🇽': [
        '墨西哥标志',
        'MX',
        '墨西哥标志'
    ],
    '🇲🇾': [
        '马来西亚标志',
        '我的',
        'Malaysian Flag'
    ],
    '🇲🇿': [
        '莫桑比克的标志',
        'MZ',
        '莫桑比克标志'
    ],
    '🇳🇦': [
        '纳米比亚标志',
        'NA',
        'Namibian Flag'
    ],
    '🇳🇨': [
        '新喀里多尼亚的标志',
        'NC',
        '新喀里多尼亚标志'
    ],
    '🇳🇪': [
        '尼日尔标志',
        '西区',
        'Nigeren 标志'
    ],
    '🇳🇫': [
        '诺福尔克岛的标志',
        'NF',
        '诺福尔克岛标志'
    ],
    '🇳🇬': [
        '尼日利亚国旗a',
        'NG',
        '尼日利亚标志'
    ],
    '🇳🇮': [
        'Flag of Nicaragua',
        'NI',
        'Nicaraguan Flag'
    ],
    '🇳🇱': [
        '荷兰标志',
        'NL',
        '荷兰标志',
        '霍兰'
    ],
    '🇳🇴': [
        '挪威标志',
        '无',
        '挪威标志'
    ],
    '🇳🇵': [
        '尼泊尔国旗a',
        'NP',
        '尼泊尔标志'
    ],
    '🇳🇷': [
        '瑙鲁的标志',
        '北偏角',
        'Nauruan Flag'
    ],
    '🇳🇺': [
        '纽埃标志',
        'NU',
        'Niuean Flag'
    ],
    '🇳🇿': [
        '新西兰的标志',
        '南区',
        'Kiwi 标志'
    ],
    '🇴🇲': [
        '阿曼标志',
        'OM',
        '阿曼标志'
    ],
    '🇵🇦': [
        '巴拿马标志',
        'PA',
        '巴拿马标志'
    ],
    '🇵🇪': [
        '秘鲁标志',
        'PE',
        '秘鲁标志'
    ],
    '🇵🇫': [
        '法属波利尼西亚旗标',
        'PF',
        '法属波利尼西亚标志'
    ],
    '🇵🇬': [
        '巴布亚新几内亚的国旗：',
        'PG',
        'PNG 标志',
        'Papua New Guinean Flag'
    ],
    '🇵🇭': [
        '菲律宾标志',
        'PH'
    ],
    '🇵🇰': [
        '巴基斯坦国旗（国旗）',
        'PK',
        '巴基斯坦标志'
    ],
    '🇵🇱': [
        '波兰标志',
        'PL',
        '波兰标志'
    ],
    '🇵🇲': [
        '圣皮埃尔和密克隆的标志',
        '私信'
    ],
    '🇵🇳': [
        '皮特凯恩国旗案',
        'PN'
    ],
    '🇵🇷': [
        '波多黎各旗帜',
        'PR',
        '波多黎各标志'
    ],
    '🇵🇸': [
        '巴勒斯坦领土的标志',
        'PS',
        'Palestine'
    ],
    '🇵🇹': [
        '葡萄牙的标志',
        'PT',
        '葡萄牙标志'
    ],
    '🇵🇼': [
        '帕劳的标志',
        'PW',
        '帕劳标志'
    ],
    '🇵🇾': [
        '巴拉圭标志',
        'PY',
        'Paraguayan Flag'
    ],
    '🇶🇦': [
        '1. 卡塔尔标志',
        'QA',
        'Qatari 标志'
    ],
    '🇷🇪': [
        '留尼旺的标志',
        '可选的',
        'Reunionnais 标志'
    ],
    '🇷🇴': [
        '罗马尼亚标志',
        'RO',
        '罗马尼亚标志'
    ],
    '🇷🇸': [
        '塞尔维亚的标志',
        '斯普斯卡文',
        '塞尔维亚标志'
    ],
    '🇷🇺': [
        '俄罗斯标志',
        'RU',
        '俄国标志'
    ],
    '🇷🇼': [
        'Flag of Rwanda',
        'RW',
        'Rwandan Flag'
    ],
    '🇸🇦': [
        '沙特阿拉伯国旗a',
        'SA',
        '沙特阿拉伯标志'
    ],
    '🇸🇧': [
        '所罗门群岛的标志',
        'SB',
        'Solomon Islander flags'
    ],
    '🇸🇨': [
        '塞舌尔国旗案',
        'SC',
        'Seychellois Flag'
    ],
    '🇸🇩': [
        '苏丹标志',
        'SD',
        'Sudanese Flag'
    ],
    '🇸🇪': [
        '瑞典的标志',
        '西区',
        '瑞典标志'
    ],
    '🇸🇬': [
        '新加坡的标志',
        '烧结厂公司',
        '新加坡标志'
    ],
    '🇸🇭': [
        '3. 圣赫勒拿的旗子',
        '高亮'
    ],
    '🇸🇮': [
        '斯洛文尼亚的标志',
        '烧结厂公司',
        '斯洛文尼亚标志'
    ],
    '🇸🇯': [
        '斯瓦尔巴和扬马延的标志',
        '斯克'
    ],
    '🇸🇰': [
        '斯洛伐克的国旗：',
        'SK',
        '斯洛伐克标志',
        'Slovakian Flag'
    ],
    '🇸🇱': [
        '塞拉利昂标志',
        'SL',
        'Sierra Leonean Flag'
    ],
    '🇸🇲': [
        '圣马力诺标志',
        '送文函',
        'Sammarinese 标志'
    ],
    '🇸🇳': [
        '塞内加尔标志',
        'SN',
        'Sengalese标志'
    ],
    '🇸🇴': [
        '索马里的标志',
        '合办公司',
        'Somalian Flag'
    ],
    '🇸🇷': [
        '苏里南标志',
        '存储库',
        '苏里南标志'
    ],
    '🇸🇸': [
        '苏丹南部的标志',
        'SS',
        '南苏丹标志'
    ],
    '🇸🇹': [
        'Saato Tomeconnectic & Principe 的标志',
        '炼钢厂'
    ],
    '🇸🇻': [
        '萨尔瓦多标志',
        'SV',
        '萨尔瓦多标志'
    ],
    '🇸🇽': [
        '圣马丁的标志',
        'SX'
    ],
    '🇸🇾': [
        '叙利亚标志',
        'SY',
        '叙利亚标志'
    ],
    '🇸🇿': [
        '斯威士兰国旗号',
        'SZ',
        'Eswatini 标志'
    ],
    '🇹🇦': [
        'Flag of Tristan Da Cunha',
        '助教'
    ],
    '🇹🇨': [
        '特克斯和凯科斯群岛',
        'TC'
    ],
    '🇹🇩': [
        '乍得标志',
        '音调',
        '乍得标志'
    ],
    '🇹🇫': [
        '法属南方领土的标志',
        'TF',
        '法国南方土地标志'
    ],
    '🇹🇬': [
        '多哥标志',
        'TG',
        'Togolese Flag'
    ],
    '🇹🇭': [
        '泰国标志',
        '四',
        '泰国标志'
    ],
    '🇹🇯': [
        '塔吉克斯坦的标志',
        'TJ',
        '塔吉克标志'
    ],
    '🇹🇰': [
        '托克劳国旗（托克劳）',
        'TK',
        '托克劳标志'
    ],
    '🇹🇱': [
        '东帝汶的标志',
        'TL',
        '东帝汶标志',
        '东帝汶标志'
    ],
    '🇹🇲': [
        '土库曼斯坦的标志',
        '四月',
        'Turkmen Flag'
    ],
    '🇹🇳': [
        '突尼斯标志',
        'TN',
        '突尼斯标志'
    ],
    '🇹🇴': [
        '汤加的标志',
        '到',
        'Tongan Flag'
    ],
    '🇹🇷': [
        '土耳其国旗案',
        '四月',
        '土耳其标志'
    ],
    '🇹🇹': [
        '特立尼达和多巴哥的国旗：',
        'TT'
    ],
    '🇹🇻': [
        '图瓦卢的标志',
        '电视机',
        '图瓦卢标志'
    ],
    '🇹🇼': [
        '台湾标志',
        'TW',
        '台湾标志'
    ],
    '🇹🇿': [
        '坦桑尼亚标志',
        'TZ',
        'Tanzanian Flag'
    ],
    '🇺🇦': [
        '乌克兰标志',
        'UA',
        '乌克兰标志'
    ],
    '🇺🇬': [
        '乌干达标志',
        'UG',
        '乌干达标志'
    ],
    '🇺🇲': [
        '旗帜：美国外围群岛',
        'UM'
    ],
    '🇺🇸': [
        '美国标志',
        '美国',
        '美国标志',
        '美国标志'
    ],
    '🇺🇾': [
        'Flag of Uruguay',
        'UY',
        'Uruguayan Flag'
    ],
    '🇺🇿': [
        'Flag of Uzbekistan',
        'UZ',
        'Uzbekistani Flag',
        'Uzbek Flag'
    ],
    '🇻🇦': [
        '罗马教廷的标志',
        'VA',
        'Vanticanien 标志'
    ],
    '🇻🇨': [
        '圣文森特和格林纳丁斯',
        '虚拟机'
    ],
    '🇻🇪': [
        '委内瑞拉标志',
        '五',
        '委内瑞拉标志'
    ],
    '🇻🇬': [
        '四. 英属维尔京群岛的标志',
        '虚拟机',
        '四. 英属维尔京群岛的标志'
    ],
    '🇻🇮': [
        '美属维尔京群岛标志',
        '六',
        '美属维尔京群岛旗帜'
    ],
    '🇻🇳': [
        '越南标志',
        'VN',
        '越南标志'
    ],
    '🇻🇺': [
        'Flag of Vanuatu',
        'VU',
        'Ni-Vanuatu Flag'
    ],
    '🇼🇫': [
        '瓦利斯和富图纳的标志',
        'WF'
    ],
    '🇼🇸': [
        '萨摩亚国旗：',
        '周一',
        'Samoan Flag'
    ],
    '🇽🇰': [
        '科索沃标志',
        'XK',
        'Kosovar Flag'
    ],
    '🇾🇪': [
        '也门标志',
        'YE',
        '也门标志'
    ],
    '🇾🇹': [
        '马约特的标志',
        'YT',
        '马约特标志'
    ],
    '🇿🇦': [
        '南非标志',
        'ZA',
        '南非标志'
    ],
    '🇿🇲': [
        '赞比亚标志',
        'ZM',
        'Zambian Flag'
    ],
    '🇿🇼': [
        '津巴布韦标志',
        'ZW',
        '津巴布韦标志',
        'Zim 标志'
    ]
};
/*sports*/
emojis_language[lang][8] = {
    '🧗{{skin_tone}}‍‍♂️': [
        '男人爬上',
        '男性岩石爬行',
        '人类爬行者'
    ],
    '🧗{{skin_tone}}‍‍♀️': [
        '妇女爬上',
        '女岩石爬行者',
        '妇女爬行'
    ],
    '🏇{{skin_tone}}‍': [
        '马赛克',
        '马比赛',
        'Jockey'
    ],
    '⛷{{skin_tone}}‍️': ['斯基尔'],
    '🏂{{skin_tone}}‍': ['Snowboarder'],
    '🏌️{{skin_tone}}‍♂️': ['Man Golfer'],
    '🏌️{{skin_tone}}‍♀️': ['妇女戈尔夫'],
    '🏄{{skin_tone}}‍♂️': ['Man Surfer'],
    '🏄{{skin_tone}}‍♀️': ['妇女冲浪者'],
    '🚣{{skin_tone}}‍‍♂️': ['男人降落船'],
    '🚣{{skin_tone}}‍‍♀️': ['妇女发波船'],
    '🏊{{skin_tone}}‍‍♂️': [
        '人游泳中',
        '人游泳者'
    ],
    '🏊{{skin_tone}}‍‍♀️': [
        '妇女游泳。',
        '妇女游泳者'
    ],
    '⛹{{skin_tone}}‍️‍♂️': [
        '男人弹出球',
        'Man 篮球玩家'
    ],
    '⛹️{{skin_tone}}‍♀️': [
        '妇女弹出球',
        '妇女篮球玩家'
    ],
    '🏋️{{skin_tone}}‍♂️': [
        '人提升权重',
        '重量器'
    ],
    '🏋️{{skin_tone}}‍♀️': [
        '妇女提升权重',
        '妇女重力'
    ],
    '🚴{{skin_tone}}‍♂️': [
        '人自行车',
        '摩托车手',
        '男性骑士'
    ],
    '🚴{{skin_tone}}‍♀️': [
        '妇女自行车',
        '妇女骑自行车者',
        '女骑士'
    ],
    '🚵{{skin_tone}}‍♂️': [
        '人山地自行车',
        'Man Mountain Biker'
    ],
    '🚵{{skin_tone}}‍♀️': [
        '妇女山地自行车',
        '妇女山地比克'
    ],
    '🤸{{skin_tone}}‍♂️': [
        'Man Cartwheeling',
        '人做购物车车'
    ],
    '🤸{{skin_tone}}‍♀️': [
        '妇女购物车中',
        '妇女做购物车车'
    ],
    '🤼': [
        '人的衣服',
        '衣服',
        '勇士座'
    ],
    '🤽{{skin_tone}}‍♂️': ['人类正在玩水极管'],
    '🤽{{skin_tone}}‍♀️': ['妇女正在玩水Polo'],
    '🤾{{skin_tone}}‍♂️': ['人类正在玩手球'],
    '🤾{{skin_tone}}‍♀️': ['妇女玩手球'],
    '🤹{{skin_tone}}‍♂️': [
        '男人拼凑的',
        '男Juggler'
    ],
    '🤹{{skin_tone}}‍♀️': [
        '妇女拼凑的工作',
        '女玩具'
    ],
    '🧘{{skin_tone}}‍♂️': ['Lotus 位置中的人'],
    '🧘{{skin_tone}}‍♀️': ['Lotus 位置上的妇女'],
    '🏃{{skin_tone}}‍♂️': ['男人正在运行'],
    '🏃{{skin_tone}}‍♀️': ['妇女正在运行'],
    '🕺{{skin_tone}}‍': ['人舞蹈组织'],
    '💃{{skin_tone}}‍': ['妇女舞蹈组织'],
    '🤺': [
        '人员栅栏',
        '花园师'
    ],
    '🏆': [
        '奖品',
        '冠军',
        '获胜者'
    ],
    '🏅': ['体育勋章'],
    '🥇': [
        '一等勋章',
        '首地勋章',
        '金质勋章'
    ],
    '🥈': [
        '第二个地方勋章',
        '二等勋章',
        '银质勋章'
    ],
    '🥉': [
        '第三地勋章',
        '第三地勋章',
        '青铜勋章'
    ],
    '⚽': [
        '足球员',
        '足球'
    ],
    '⚾': [
        '棒球',
        '软球',
        '白色的'
    ],
    '🥎': [
        '软球',
        '黄色'
    ],
    '🏀': [
        '篮球',
        '橙色',
        '篮球和钩子'
    ],
    '🏐': ['排球'],
    '🏈': [
        '美国足球',
        '足球',
        'Gridiron',
        '超级机器人'
    ],
    '🏉': [
        '橄榄球足球',
        '足球',
        '联赛',
        '橄榄球',
        '联盟'
    ],
    '🎾': [
        '特尼斯',
        '球',
        '棋盘',
        '雷克'
    ],
    '🥏': [
        '飞行磁盘',
        '弗里斯波文'
    ],
    '🎳': [
        '波林省',
        'Pins',
        'Skittles',
        '十个Pin Bowling'
    ],
    '🏏': [
        '板块',
        '巴特',
        '球'
    ],
    '🏑': [
        '字段曲目',
        '球',
        '棍子'
    ],
    '🏒': [
        '冰箱',
        '球',
        '棍子'
    ],
    '🥍': [
        '拉克鲁塞文',
        '球',
        '棍子'
    ],
    '🏓': [
        'Ping Pong',
        'Tennis',
        '球',
        'Paddle'
    ],
    '🏸': [
        'Badminton',
        '交错锁',
        '雷克'
    ],
    '🥊': ['盒式手套'],
    '🥋': [
        '武术是统一的',
        '犹太语',
        '卡莱特',
        '昆福文'
    ],
    '⛳': [
        '在洞里的标志',
        '高尔夫标志'
    ],
    '⛸️': [
        '冰皮肤',
        '跳过'
    ],
    '🎣': [
        '钓鱼',
        '极形',
        '鱼类',
        '钓鱼Rod'
    ],
    '🎽': [
        '正在运行衬irt',
        '单声道',
        '散列'
    ],
    '🎿': [
        '皮肤',
        '滑雪',
        '启动'
    ],
    '🛷': ['已删除'],
    '🥌': ['曲线石头'],
    '🎯': [
        '直接命中',
        '弓箭手',
        'Bullseye',
        '暗色'
    ],
    '🎱': [
        '池8球',
        'Cue 球',
        'Snooker',
        '十亿人'
    ],
    '🎮': [
        '视频游戏控制器',
        '播放站',
        'Xbox',
        '游戏键盘',
        'Wii U'
    ],
    '♟️': ['黑色国际象棋Pawn'],
    '🏹': [
        '弓箭头',
        'Arch'
    ],
    '🥅': ['目标网络'],
    '🀄': [
        'Mahjong Red Dragon',
        '马赫永文',
        'Mahjong Tile',
        '中',
        'Mahjong Tile Red Dragon'
    ],
    '🎴': [
        '花卉播放卡',
        '牌组',
        'Hanafuda',
        'Hwatu',
        '播放卡片'
    ]
};
/*travel and places*/
emojis_language[lang][9] = {
    '🚂': [
        '蒸汽机车',
        '蒸汽火车',
        '铁路机车'
    ],
    '🚃': [
        '铁路车',
        '铁路车',
        '铁路车',
        '铁路运输',
        '火车道'
    ],
    '🚄': ['高速火车'],
    '🚅': [
        '子弹火车',
        'Shinkansen',
        '高速列车带有子弹鼻子'
    ],
    '🚆': ['火车'],
    '🚇': [
        '地下系统',
        '管线',
        '地铁公司',
        '地板'
    ],
    '🚈': [
        '轻路车',
        '火车'
    ],
    '🚊': ['火车'],
    '🚝': [
        '单车',
        '火车'
    ],
    '🚞': [
        '山地铁道',
        'Funicular',
        '火车和山区'
    ],
    '🚋': ['火车车'],
    '🚌': [
        '公交车',
        '教练员'
    ],
    '🚍': [
        '正在上传的总线',
        '公交车前'
    ],
    '🚎': [
        '托莱布斯',
        '电子总线'
    ],
    '🚐': [
        'Minibus',
        'Minivan',
        '人民-Mover'
    ],
    '🚑': ['救护车'],
    '🚒': [
        '火焰引擎',
        '消防局',
        '火车车'
    ],
    '🚓': [
        '警车',
        '编程车',
        '警察车辆的侧面'
    ],
    '🚔': [
        '即将到来的警车',
        '警察汽车前部',
        '编程车'
    ],
    '🚕': [
        '出租车',
        '纽约出租车',
        '出租车方面'
    ],
    '🚖': [
        '出租车',
        '待机出租车',
        '出租车前'
    ],
    '🚗': [
        '自行车',
        '红车',
        '汽车的侧面'
    ],
    '🚘': [
        '正在开机车',
        '红车',
        '汽车前'
    ],
    '🚚': [
        '送货车',
        '劳里'
    ],
    '🚛': [
        '虚构的彩色',
        '绿色卡车'
    ],
    '🚜': [
        '拖拉机',
        '农场'
    ],
    '🛻': ['拾取卡车'],
    '🏎️': [
        '赛车',
        'F1',
        '公式一',
        '竞赛车'
    ],
    '🏍️': [
        '摩托车',
        '摩托车'
    ],
    '🛵': [
        '摩托计分器',
        'Vespa',
        '摩托车',
        '摩托车'
    ],
    '🛺': [
        '自动Rickshaw',
        'Tuk Tuk'
    ],
    '🚲': [
        '自行车',
        '自行车'
    ],
    '🛴': ['踢得分'],
    '⛵': [
        '帆船',
        '丁希文',
        '雅赫特'
    ],
    '🚤': [
        'Speedboat',
        '摩托船',
        '电源船'
    ],
    '🛳️': ['客船'],
    '⛴️': ['轮渡模式'],
    '🛥️': ['摩托车'],
    '🚢': ['游轮船'],
    '✈️': [
        '飞行器',
        'Aeroplane'
    ],
    '🛩️': [
        '小型飞行器',
        '小气球座'
    ],
    '🚁': ['直升机'],
    '🚟': ['暂停火车'],
    '🚠': ['山地铁道'],
    '🚡': [
        '空中轨迹',
        '电缆车',
        'Gondola',
        '路德路'
    ],
    '🛰️': ['卫星'],
    '🚀': [
        '火箭座',
        '航天飞机：'
    ],
    '🛸': [
        '飞行撒克尔',
        'UFO'
    ],
    '🚉': [
        '火车站',
        '火车平台'
    ],
    '🚏': ['公交车站'],
    '🛣️': [
        '高速路',
        '道路',
        '高速道路',
        '州际关系'
    ],
    '🛤️': ['铁路轨迹'],
    '🛫': [
        '飞行退出',
        '关闭'
    ],
    '🛬': [
        '飞机抵达时',
        '飞机抵达中',
        '着陆中'
    ],
    '🗾': ['日本地图'],
    '⛰️': ['山区'],
    '🏔️': ['雪盖的山区'],
    '🌋': ['Volcano'],
    '🗻': [
        '福吉神座骑士',
        '富吉桑文'
    ],
    '🏕️': [
        '露营模式',
        '露营区'
    ],
    '🏖️': ['带有伞形状的包围模式'],
    '🏜️': ['Desert'],
    '🏝️': ['沙漠岛'],
    '🏞️': ['National Park'],
    '🏟️': [
        '体育场',
        '格朗德斯地',
        '体育场'
    ],
    '🏛️': [
        '古典建筑',
        '希腊语',
        '罗马'
    ],
    '🏗️': [
        '建筑工程',
        '克兰语'
    ],
    '🏘️': [
        '住房建筑',
        '房子组'
    ],
    '🏚️': [
        '废弃房屋建筑',
        '被遗弃的屋子',
        '旧屋子',
        '哈恩德屋子'
    ],
    '🏠': [
        '主页',
        '住房建筑'
    ],
    '🏡': [
        '有花园的屋子',
        '房子和树'
    ],
    '🏢': [
        'Office Building',
        '城市建筑',
        '高升华建筑'
    ],
    '🏣': [
        '日本邮局',
        '日本邮政标记'
    ],
    '🏤': [
        '邮局',
        '欧洲邮局'
    ],
    '🏥': [
        '1 P-5, 1 P-4, 1 P-3,',
        '东区',
        'A&E',
        '急救室',
        '意外事故和紧急情况',
        'Red Cross',
        '医疗服务'
    ],
    '🏦': [
        '银行',
        'BK',
        'Bakkureru',
        '银行分支',
        'Bakkureru'
    ],
    '🏨': [
        '酒店：',
        '住宿',
        'H Building'
    ],
    '🏩': [
        '热门饭店',
        '爱心饭店'
    ],
    '🏪': [
        '便捷商店',
        '24小时商店',
        '7-11',
        '角店',
        'Kwik-E-Mart'
    ],
    '🏫': [
        '学校',
        '时钟塔',
        '中小学高'
    ],
    '🏬': [
        '百货店',
        '购物中心',
        '商店'
    ],
    '🏭': [
        '出厂商',
        '工业区',
        '工业',
        '污染',
        '烟雾'
    ],
    '🏯': [
        '日本城堡',
        '堡垒：'
    ],
    '🏰': [
        '欧洲城堡',
        'Turrets'
    ],
    '💒': [
        '教堂心',
        '教会婚礼：',
        '婚姻状况'
    ],
    '🗼': [
        '东京塔',
        '埃菲尔塔',
        '红塔'
    ],
    '🗽': [
        '自由雕像',
        '纽约'
    ],
    '⛪': [
        '教堂建筑',
        '十字线'
    ],
    '🕌': [
        '清真寺：',
        'Domed屋顶',
        'Minaret'
    ],
    '🛕': ['印度教寺庙：'],
    '🕍': [
        '犹太教士会',
        '犹太人',
        'Synagog',
        '圣殿：'
    ],
    '⛩️': [
        '暗影神器',
        'Kami-nomichi'
    ],
    '🕋': [
        'Kaaba',
        'Mecca'
    ],
    '🏙️': ['Cityscape'],
    '⛱️': [
        '地面上的伞状图',
        '海滩伞状组织'
    ],
    '🌄': [
        '日升高山上',
        '上午',
        '日出模式'
    ],
    '🌅': [
        '日出模式',
        '日落模式'
    ],
    '🌆': [
        '杜斯克的Cityscape',
        '橙色天空城',
        '杜斯克城'
    ],
    '🌇': [
        '日落在建筑物上',
        '城市日记'
    ],
    '🌃': [
        '夜晚和星星',
        '城市晚间',
        '星座晚间'
    ],
    '🗿': [
        'Moai',
        '复活节岛雕像',
        '人类摇滚雕像',
        '莫耶雕像'
    ],
    '🌠': [
        '射星',
        '当你想要一星时',
        '流星体'
    ],
    '🌌': [
        '银河路',
        '星系',
        '夜间天空',
        '空间',
        '星星',
        '宇宙模式'
    ],
    '🎑': [
        '月球视觉节',
        'Grass, Dumplings and Moon',
        '收获月',
        '秋中节',
        'Tsukimi'
    ],
    '🛖': ['小区'],
    '🎢': [
        '火花板',
        '滚刀车',
        '主题Park'
    ]
};
/*technologies (smartphones, laptops, etc.) and office*/
emojis_language[lang][10] = {
    '⌚': [
        '观察',
        '计时器',
        '苹果Watch'
    ],
    '⏰': ['闹钟时钟'],
    '⏱️': ['秒表'],
    '⏲️': ['计时器时钟'],
    '🕰️': ['手工时钟'],
    '🧭': ['指南针'],
    '🕹️': ['操纵杆座'],
    '🎙️': ['工作室麦克风'],
    '🎚️': ['水平滑块'],
    '🎛️': ['控制 Knobs'],
    '📻': [
        '收音机',
        '数字广播',
        '无线网络'
    ],
    '📱': [
        '手机号码',
        '智能手机',
        'iPhone',
        '手机号码'
    ],
    '📲': [
        '向左带右箭头的移动电话',
        '电话',
        '指向电话'
    ],
    '☎️': [
        '黑色电话',
        'Rotary 电话',
        '红色的'
    ],
    '📞': [
        '电话接收器',
        'Handset',
        '电话',
        '黑色'
    ],
    '📟': [
        '分页',
        '蜂鸣器',
        '睡眠者'
    ],
    '📠': [
        '传真机',
        'Facsimile',
        '传真'
    ],
    '🔋': [
        '电量：',
        'AA电池',
        '手机电池'
    ],
    '🔌': [
        '电源插图',
        'AC Adaptor',
        '电源线',
        '电源插头'
    ],
    '💻': [
        '笔记本',
        '笔记本',
        '个人计算机',
        'PC',
        'MacBook',
        '表面'
    ],
    '🖥️': [
        '桌面电脑',
        'iMac',
        'PC'
    ],
    '🖨️': ['打印机'],
    '⌨️': ['Keyboard'],
    '🖱️': [
        '电脑鼠标：',
        '三个鼠标按钮'
    ],
    '🖲️': ['曲奇球'],
    '💽': [
        '电脑磁盘',
        'Minidisc',
        'CD',
        'DVD',
        '蓝光线',
        'BD'
    ],
    '💾': [
        '软盘',
        '距离磁盘3.5分',
        '磁盘'
    ],
    '💿': [
        '光学磁盘',
        'CD',
        'CD-ROM',
        '紧凑盘片'
    ],
    '📀': [
        'DVD',
        'DVD-ROM',
        'DVD 视频'
    ],
    '🎥': [
        '电影相机',
        '影片相机',
        '好莱伍德',
        '电影'
    ],
    '🎞️': ['电影帧'],
    '📽️': ['电影投影器'],
    '📺': [
        '电视机',
        '电视机'
    ],
    '📷': ['数字相机'],
    '📸': ['带闪光灯的相机'],
    '📹': [
        '视频相机',
        '摄像机'
    ],
    '📼': [
        '视频素材',
        'VHS',
        'VCR',
        '视频冲压器',
        '视频素材'
    ],
    '💳': [
        '信用卡',
        '借记卡',
        'AmEX',
        'Diners Club',
        '美国运势',
        '万事达卡',
        'VISA 卡'
    ],
    '📧': [
        '电子邮箱',
        '电子邮件地址'
    ],
    '📨': [
        '传入信封',
        '带线的信封',
        '快速信封'
    ],
    '📩': [
        '上方带下箭头的信封',
        '下箭头信封',
        '插入信封'
    ],
    '📤': ['发件箱托盘'],
    '📥': ['收件箱托盘'],
    '📮': ['邮箱地址'],
    '📁': [
        '文件文件夹',
        '文件夹',
        '目录',
        '关闭文件文件夹'
    ],
    '📂': [
        '打开文件文件夹',
        '目录'
    ],
    '🗂️': ['卡片索引分隔符'],
    '📅': [
        '日程表',
        '7 月 17 日',
        '世界表情日'
    ],
    '🗓️': ['螺旋日历板'],
    '📆': [
        '关机日历',
        '日期日历',
        '桌面日历'
    ],
    '📈': [
        '图表增加',
        '正曲图',
        '向上点图',
        '向上趋势图'
    ],
    '📉': [
        '图表减少',
        '负图',
        '下点数图',
        '向下趋势图'
    ],
    '📊': [
        '条形图',
        '条形图'
    ],
    '📌': [
        'Pushpin',
        'Thumb Tack'
    ],
    '📋': ['剪切板'],
    '📍': [
        '圆形推送',
        '丢弃Pin',
        '地图密码',
        '置顶',
        '红色Pin'
    ],
    '📎': [
        '纸片剪辑',
        '剪辑'
    ],
    '📏': ['直角标标'],
    '📐': [
        '三角坐标标尺器',
        '三角形标尺器'
    ],
    '✂️': [
        '扫描器',
        '剪切中'
    ],
    '✏️': [
        '铅笔数',
        '铅笔：'
    ],
    '✒️': [
        'Black Nib',
        'Pen Nib',
        '喷出笔数'
    ],
    '🖋️': [
        '喷出笔数',
        '降低左翼喷雾器 Pen'
    ],
    '🖊️': [
        '彭文',
        '降低左侧停靠点 Pen',
        'Ballpoint Pen'
    ],
    '🖌️': [
        '绘画笔图',
        '画笔数',
        '降低左侧绘画笔数'
    ],
    '🖍️': [
        'Crayon',
        '左下角时钟'
    ],
    '📝': [
        '备注',
        'Memorandum',
        '说明',
        '铅笔和纸'
    ],
    '🗑️': [
        '废纸篮子',
        '垃圾罐头',
        '橡树箱',
        '回收站'
    ],
    '📡': ['卫星天线'],
    '🔭': [
        '望远镜座',
        'Stargazing'
    ],
    '🔬': [
        '微瞄准镜',
        'Magnify',
        '科学'
    ],
    '📭': ['使用已放置的标志打开邮箱'],
    '📬': [
        '使用提升标志打开邮箱',
        '打开邮箱'
    ],
    '📪': ['带有已放置标志的封闭邮箱'],
    '📫': ['带有提升标志的封闭邮箱'],
    '📰': ['报社'],
    '🗞️': [
        '已滚动的新闻稿',
        '报纸发货'
    ],
    '📄': [
        '页面正在向上',
        '打印页面'
    ],
    '📜': [
        '滚动',
        '度',
        'Parchment'
    ],
    '📃': [
        '带曲线的页面',
        'Curled Page',
        'Curly Page'
    ],
    '📓': [
        '笔记本',
        '黑白书'
    ],
    '📔': ['带装饰封面的笔记本'],
    '📕': [
        '已关闭的书',
        '红书',
        '红文本'
    ],
    '📖': [
        '打开书',
        '书',
        '新体'
    ],
    '📗': [
        '绿书',
        '绿色文本'
    ],
    '📘': [
        '蓝书',
        '蓝色文本'
    ],
    '📙': [
        '橙皮书',
        '橙色文本'
    ],
    '📚': [
        '书籍：',
        '书库',
        '书店'
    ],
    '🗳️': [
        '带选票的选票箱',
        '投票框',
        '表 决'
    ],
    '🗄️': [
        '文件机箱',
        '备案机箱'
    ],
    '🗃️': ['卡片文件框'],
    '🖇️': ['链接纸片素材']
};
/*clothes and accessories*/
emojis_language[lang][11] = {
    '👣': [
        '足迹',
        '英尺：',
        '足迹'
    ],
    '👓': [
        '眼镜',
        '埃维眼镜头'
    ],
    '🕶️': ['阳光镜头'],
    '🥽': ['Goggles'],
    '🥼': ['实验室帽子'],
    '👔': [
        'Necktie',
        '商业衬衫：',
        '衬衫和Tie'
    ],
    '👕': [
        'T-Shirt',
        'Tee Shirt',
        'Polo Shirt'
    ],
    '👖': [
        '犹太人',
        '德尼姆',
        '裤子',
        '裤子'
    ],
    '🧣': ['Scarf'],
    '🧤': ['手套'],
    '🧥': ['金币'],
    '🧦': ['Socks'],
    '👗': [
        '衣服',
        '滑雪',
        '发光'
    ],
    '👘': [
        'Kimono',
        '磨损渐变',
        '日语装饰'
    ],
    '👙': [
        '比基尼',
        '浴器',
        '套装'
    ],
    '🩱': ['一块方块套装'],
    '👚': [
        '妇女衣服',
        'Blouse',
        '粉红色衬衫。',
        'Blouse'
    ],
    '👛': [
        '紫色',
        '钱包'
    ],
    '👜': ['手提包'],
    '👝': [
        'Clutch 包',
        '剪辑',
        '小包',
        'Pouch'
    ],
    '🎒': [
        '背包',
        '袋子',
        '学校包',
        '学校萨切尔学校',
        'Rucksack'
    ],
    '👞': [
        'Mans Shoe',
        '鞋子',
        '棕色显示',
        '衣服显示'
    ],
    '👟': [
        '雅典鞋子',
        '正在运行鞋子',
        'Sneaker',
        '运行器',
        '教练员',
        '网球鞋子'
    ],
    '🥾': ['步行启动'],
    '🥿': ['平面鞋子'],
    '👠': [
        '高加热鞋子',
        '圣蒂莱托文',
        '高热点'
    ],
    '👡': [
        '妇女沙尔',
        '加热沙尔',
        'Saldals'
    ],
    '👢': [
        '妇女靴子',
        '奶牛靴子',
        '膝上型高靴子',
        '加热靴子'
    ],
    '👑': [
        '英雄座',
        '金头',
        '女王座',
        '亲王座',
        '皇家公司',
        '公主'
    ],
    '👒': [
        '帽子',
        '妇女帽子',
        '带弓的帽子',
        '女士帽子'
    ],
    '🎩': [
        '顶部帽子',
        '正式的穿甲',
        'Groom'
    ],
    '🎓': [
        '脱离帽子',
        '学院',
        '毕业生：',
        '化石板',
        '大学',
        '正方形学术帽子'
    ],
    '🧢': [
        '账单帽子',
        '棒球帽子'
    ],
    '⛑️': [
        '带白十字头盔',
        '救援人员头盔'
    ],
    '💼': [
        '公事包',
        '套装'
    ],
    '🎖️': [
        '军事勋章',
        '勋章',
        '梅达利昂州',
        '军事装饰'
    ],
    '📿': [
        '祈祷戴斯',
        'Dhikr Beads',
        'Rosary Beads'
    ],
    '🎗️': ['提醒Ribbo'],
    '🤿': ['潜水面具'],
    '🦺': ['安全箱'],
    '🥻': [
        '萨里文',
        '沙雷文',
        '沙里文'
    ],
    '🩲': ['简介'],
    '🩳': ['短路'],
    '🛼': [
        '滚刀皮肤',
        '内置滑块',
        '滚刀减速'
    ],
    '🩴': [
        '翻转浮点数',
        'Thong Sandal'
    ],
    '🪖': ['军用头盔'],
    '🩰': [
        '芭蕾舞鞋子',
        '有点鞋子'
    ]
};
/*hands and parts of body*/
emojis_language[lang][12] = {
    '👋{{skin_tone}}': [
        '手动签名',
        '再见',
        '手波波浪：',
        '您好',
        'Hi'
    ],
    '🖐️{{skin_tone}}': [
        '指针播放的手势',
        '五手',
        '玩家之手',
        '使用指纹升起手'
    ],
    '🤚{{skin_tone}}‍': [
        '提升背部',
        '背手'
    ],
    '✋{{skin_tone}}‍': [
        '升起手',
        '高 5',
        '停止'
    ],
    '🖖{{skin_tone}}‍': [
        'Vulcan Salute',
        'Spock',
        '星树座',
        '带着中间指针和指针之间部分提升的手'
    ],
    '👌{{skin_tone}}‍': [
        '好的手签名',
        '好的',
        '完美的',
        '否'
    ],
    '✌️{{skin_tone}}‍': [
        '胜利之手',
        '空运报价',
        '和平标志',
        'V 标志'
    ],
    '🤞{{skin_tone}}‍': [
        '跨越指针',
        '指纹人横线',
        '祝你好运！',
        '使用索引和中间指针跨出'
    ],
    '🤟{{skin_tone}}‍': [
        '爱你的手势',
        '我喜欢你的手签名'
    ],
    '🤘{{skin_tone}}‍': [
        '马座',
        '恶魔手指',
        '重型金属：',
        '摇滚开启'
    ],
    '🤙{{skin_tone}}‍': [
        '呼叫我的手签名',
        '电话',
        '沙卡'
    ],
    '🤏{{skin_tone}}‍': ['粉红色的手'],
    '👈{{skin_tone}}‍': [
        '背手索引左侧',
        '白色左指针背手索引'
    ],
    '👉{{skin_tone}}‍': [
        '背手索引右侧',
        '白色右点背手索引'
    ],
    '👆{{skin_tone}}‍': [
        '背手索引点数',
        '白上路点背手索引',
        '中间指针'
    ],
    '👇{{skin_tone}}‍': [
        '背手索引向下',
        '白下指针背手索引',
        '向下点数'
    ],
    '☝{{skin_tone}}‍️': [
        '索引指针上移',
        '白升分索引',
        '密文'
    ],
    '🖕{{skin_tone}}‍': [
        '中间指针',
        '翻转鸟类',
        '粗指针',
        '反向手，中间指甲扩展'
    ],
    '👍{{skin_tone}}‍': [
        '缩略图注册',
        '赞',
        '否'
    ],
    '👎{{skin_tone}}‍': [
        '缩略图向下标志',
        '坏的',
        'Dislike',
        '否'
    ],
    '✊{{skin_tone}}‍': [
        '提升拳头',
        'Fist 水管'
    ],
    '👊{{skin_tone}}‍': [
        '即将到来的拳头',
        'Bro Fist',
        'Brofist',
        'Fist Bump',
        '拳击中',
        '关闭Fist',
        '人手签名'
    ],
    '🤛{{skin_tone}}‍': ['左转跳转'],
    '🤜{{skin_tone}}‍': ['右Fist Bump'],
    '🤌{{skin_tone}}‍': [
        '粉红色指针',
        'Ma Che Vuoi',
        '指针净化'
    ],
    '👏{{skin_tone}}‍': [
        '克隆手签名',
        'Applause',
        'Clap',
        '类名',
        '高尔夫拉普省',
        '一轮Applause'
    ],
    '🙌{{skin_tone}}‍': [
        '庆祝活动中的人提升双手',
        '提升手',
        'Air in The Air',
        'Banzai',
        '节奏奇迹色',
        'Hallelujah',
        '赞美助手',
        '双手'
    ],
    '👐{{skin_tone}}‍': [
        '打开手签名',
        '色度',
        'Jazz助手'
    ],
    '🤲{{skin_tone}}‍': [
        '一起上面的手表',
        'Dua'
    ],
    '🤝{{skin_tone}}‍': [
        'Handshake',
        '摇动手'
    ],
    '🙏{{skin_tone}}‍': [
        '折叠手',
        'Namaste',
        '请稍后再试',
        '祈祷者',
        '谢谢您！',
        '被折叠的人'
    ],
    '✍{{skin_tone}}‍️': ['写入手'],
    '💪{{skin_tone}}‍': [
        '弹性的 Biceps',
        '弹性臂骨',
        'Musle',
        '强度'
    ],
    '🦵{{skin_tone}}‍': ['腿部'],
    '🦶{{skin_tone}}‍': ['英尺'],
    '👂{{skin_tone}}‍': [
        '耳机',
        '耳机',
        '听讯',
        '正在监听'
    ],
    '👃{{skin_tone}}‍': [
        '鼻子',
        '熔化',
        '狙击手',
        'Stinky'
    ],
    '🧠': ['脑图'],
    '🦷': ['牙色'],
    '👀': [
        '眼镜',
        '埃伊博斯',
        'Shiftyes',
        'Wise 眼镜'
    ],
    '👁️': [
        '眼镜',
        '单眼镜'
    ],
    '👅': ['Tongue Out'],
    '👄': [
        '鼠标：',
        '按键利数',
        '精选'
    ],
    '🫀': ['神经心'],
    '🫁': ['经度'],
    '🦾': ['机械臂部'],
    '🦿': ['机械护腿']
};
/*other*/
emojis_language[lang][13] = {
    '💩': [
        'Pile of Poo',
        '狗泥土',
        '微笑药水'
    ],
    '💋': [
        '吉斯标记',
        '按键利数'
    ],
    '💅': [
        '尼尔·波兰文',
        '指针',
        'Manicure',
        'Nonchalant'
    ],
    '🤳': [
        '自拍照',
        '手机相机',
        '自拍手'
    ],
    '🦴': ['骨头'],
    '🧳': [
        '行李费',
        '套装'
    ],
    '🌂': [
        '封闭的伞状组织',
        '折叠伞状组织',
        '粉红色的伞子'
    ],
    '☂️': ['伞状组织'],
    '☔': [
        '带雨滴的伞状图',
        '降雨量',
        'Rainy'
    ],
    '🧵': ['共享线程'],
    '🧶': ['Yarn 的球'],
    '💄': [
        'Lipstick',
        '翻转',
        '弹夹'
    ],
    '💍': [
        '铃声',
        '钻石戒指',
        '参与之铃声'
    ],
    '💎': [
        'Gem stone',
        'Diamond',
        'Gem',
        'Gemstone',
        'Jewel'
    ],
    '💥': [
        '碰撞符号',
        '班克',
        '爆炸模式',
        '影响',
        '红色Spark',
        '爆炸模式'
    ],
    '💫': [
        'izzy 符号',
        '圆和星星'
    ],
    '💦': [
        '散射血红符号',
        '普莱德',
        '拆分水',
        '滴水'
    ],
    '💨': [
        '正在退出',
        '快速的',
        'Steam',
        '减速',
        '向导',
        '破折号符号',
        '风雪'
    ],
    '🌬️': [
        '风扇面',
        'Blowing Wind',
        '母亲性质',
        '风吹面具'
    ],
    '🐾': [
        '绘制打印',
        '猫之Paw打印',
        '狗Paw打印',
        '拳头打印',
        '小狗Paw打印'
    ],
    '🕸️': [
        '蜘蛛网络',
        'Cobweb',
        'Web',
        'Spiderweb'
    ],
    '🦠': [
        'Microbe',
        '单元格',
        '科罗纳维鲁斯',
        'COVID-19',
        '格姆',
        '微有机体',
        '病毒：'
    ],
    '💐': ['花花板'],
    '🌍': [
        '欧洲-非洲全球展示组织',
        '大地：',
        '环球座',
        '行星图',
        '世界',
        '全球展示欧洲和非洲'
    ],
    '🌎': [
        '全球展示美洲组织',
        '大地：',
        '环球座',
        '行星图',
        '世界'
    ],
    '🌏': [
        '环球展示亚洲—澳大利亚',
        '大地：',
        '环球座',
        '行星图',
        '世界',
        '全球展示亚洲和澳大利亚'
    ],
    '🌐': [
        '与Meridian一起使用的球体',
        'B. Internet',
        '万维网',
        'WWW'
    ],
    '🌑': [
        '新月份符号',
        '暗月',
        '阴影月',
        '太阳影像'
    ],
    '🌒': ['Waxing Crescent Moon 符号'],
    '🌓': ['第一季度月符号'],
    '🌔': ['Waxing Gibbous Moon 符号'],
    '🌕': ['满月符号'],
    '🌖': ['Waning Gibbous Moon 符号'],
    '🌗': ['最后一季月符号'],
    '🌘': ['行星月亮符号'],
    '🌙': ['月月'],
    '🌚': [
        '带面部的新月光',
        '爬行月',
        '暗月面',
        '摩列斯特月'
    ],
    '🌝': [
        '全月球面面',
        'Moonface',
        '表情模式',
        '微笑月'
    ],
    '🌛': ['第一个月的月球面面'],
    '🌜': ['最后四分之一的月球有面'],
    '🌞': [
        '太阳有面',
        '微笑阳光',
        'Sunface',
        '微笑的阳光'
    ],
    '☀️': [
        '周日',
        '阳光'
    ],
    '⭐': [
        '星标',
        '白中星星'
    ],
    '🌟': [
        '发光星',
        '光辉星星'
    ],
    '☁️': [
        '云端',
        '多云',
        '阴极化'
    ],
    '⛅': ['云端后面的太阳线'],
    '⛈️': [
        '带有闪电和降雨的云',
        '薄云雨量'
    ],
    '🌤️': ['带小云的白天'],
    '🌥️': [
        '云端后面的太阳线',
        '白太阳背部云端'
    ],
    '🌦️': ['白太阳背后云有雨'],
    '🌧️': ['带雨的云'],
    '🌨️': ['带雪的云'],
    '🌩️': ['有闪电的云'],
    '🌪️': [
        '龙卷风',
        '带旋风的云'
    ],
    '🌫️': ['Fog'],
    '🌈': [
        '彩虹灯',
        'Gay 骄傲的',
        '主彩虹头'
    ],
    '❄️': [
        '雪花',
        '雪',
        '下雪'
    ],
    '🌀': [
        '摩托车',
        'B. 飓风情况',
        '螺旋线',
        '旋转图',
        '龙卷风'
    ],
    '⚡': [
        '高电压标志',
        '闪电箭头',
        '雷波尔特',
        '高电压'
    ],
    '☃️': [
        '雪人',
        '带雪花的雪人'
    ],
    '⛄': [
        '雪人没有雪',
        '冰雪人',
        'Olaf',
        '雪人'
    ],
    '☄️': ['彗星'],
    '🔥': [
        '火力',
        '火焰模式',
        '热点',
        'Lit',
        '斯纳普雷克'
    ],
    '💧': [
        'Droplet',
        '水',
        '滴水'
    ],
    '✨': [
        '撒克尔斯',
        'Glitter',
        'Shiny',
        '新的'
    ],
    '🌊': [
        '水波浪量',
        '海滩座',
        '海洋波浪量',
        'B. 海'
    ],
    '🎄': [
        '圣诞树',
        '圣诞岛',
        '圣诞树'
    ],
    '🎃': [
        'Jack-O-Lantern',
        'Halloween',
        '南瓜文'
    ],
    '🌻': [
        '阳光花子',
        '黄色流'
    ],
    '🌼': [
        'Blossom',
        '鲜花花花板',
        'Daisy',
        '黄色流'
    ],
    '🌷': ['Tulip'],
    '🌹': [
        '玫瑰花子',
        '红色玫瑰。'
    ],
    '☘️': [
        'Shamrock',
        'Clover',
        '特雷菲尔'
    ],
    '🍀': [
        '四叶衣服',
        'Clover',
        '爱尔兰',
        '幸运的',
        '幸运的'
    ],
    '🌸': [
        'Cherry Blossom',
        '粉红色花子',
        'Sakura'
    ],
    '💮': [
        '白色花子',
        'Cherry Blossom',
        'Daily 纸',
        '干得好的印章'
    ],
    '🌺': ['Hibiscus'],
    '🏵️': ['罗塞特'],
    '🌱': [
        '种子管理',
        '春色',
        'Sprout',
        '剪切中'
    ],
    '🌲': [
        '高绿色树',
        '菲尔树',
        'Pine 树'
    ],
    '🌳': [
        '腐化树',
        '圆形树'
    ],
    '🌴': [
        '棕榈树',
        '椰子树'
    ],
    '🎋': [
        '塔纳巴塔树',
        'Tanabata',
        '愿望树'
    ],
    '🎍': [
        'Pine 装饰',
        '巴博文',
        '卡多马图文',
        '新年装饰'
    ],
    '🌵': [
        'Cactus',
        'Desert'
    ],
    '🌾': [
        '稻草人',
        '裁剪：',
        '耕作中',
        '小米',
        '稻米之心'
    ],
    '🌿': [
        '草地',
        '裁剪：',
        '种植物'
    ],
    '🍁': [
        '木制叶子',
        '加拿大',
        '加拿大',
        '马普尔'
    ],
    '🍂': [
        '亡灵叶子',
        '自动导航叶子',
        '自动休眠',
        '棕色叶子',
        '深空树子',
        '亡灵叶子'
    ],
    '🍃': [
        '风力中的叶尘化',
        '绿色叶子',
        '春色'
    ],
    '🪴': ['净化厂'],
    '🔑': [
        '关键字',
        '黄金密钥'
    ],
    '🗝️': ['旧密钥'],
    '🔨': [
        '锤子',
        'Claw Hammer',
        'Handyman',
        '工具'
    ],
    '⛏️': [
        '选择',
        '皮卡轴'
    ],
    '🪓': ['斧子'],
    '🪚': ['木匠锯子'],
    '🪛': ['屏幕驱动程序'],
    '🪝': ['钩子'],
    '🪠': ['Plunger'],
    '🪣': ['桶数'],
    '🔩': [
        '努特和箭头',
        '箭头',
        '螺丝条'
    ],
    '🗜️': [
        '闪光灯',
        'Table Vice',
        'WinZip',
        '压缩'
    ],
    '🔒': [
        '已锁定',
        '关闭锁定',
        'Padlock'
    ],
    '🔓': [
        '已解锁',
        '打开帕德锁',
        '打开锁定'
    ],
    '🔏': [
        '使用笔锁定',
        '锁定和笔数',
        '用喷雾器锁定密码',
        '使用 Ink Pen 锁定'
    ],
    '🔐': [
        '使用密钥锁定',
        '使用密钥关闭锁定'
    ],
    '🗡️': [
        'Dagger',
        '刀武器'
    ],
    '⚔️': ['十字剑'],
    '🔫': [
        'Pistol',
        '枪',
        '转手器',
        'Squirt 枪',
        '水枪',
        '水手枪'
    ],
    '🧰': ['工具箱'],
    '🧲': ['磁力网'],
    '⛓️': ['链条'],
    '💉': [
        'Syringe',
        '捐血活动',
        '血液测试',
        '针头',
        '接种情况'
    ],
    '🧬': [
        'DNA',
        'DNA 双头盔'
    ],
    '🧪': ['测试管'],
    '🛏️': [
        '床位',
        '卧室'
    ],
    '🛋️': [
        '套餐和灯',
        '休息室',
        '设置者',
        '索法文'
    ],
    '🪑': ['主席'],
    '🚪': [
        '门',
        '门路',
        '前门'
    ],
    '🪟': ['窗口'],
    '🪜': ['梯子'],
    '🪞': ['镜像'],
    '🚽': [
        '厕所',
        '浴室',
        '洛奥文',
        '重试',
        '西北地区'
    ],
    '🚿': [
        '阵雨',
        '显示头'
    ],
    '🛁': [
        '巴塔图',
        '泡泡泡球'
    ],
    '🧴': ['搬运瓶子'],
    '🧷': ['安全密码'],
    '🧺': ['篮子'],
    '🧻': [
        '纸卷',
        '厕所纸'
    ],
    '🧼': ['肥皂栏'],
    '🧽': ['Sponge'],
    '🧯': ['灭火器'],
    '🚬': [
        '香料',
        '烟雾符号'
    ],
    '⚰️': [
        '科芬文',
        'Casket',
        '葬礼：'
    ],
    '⚱️': [
        '丧葬Urn',
        '花店'
    ],
    '🛡️': ['盾牌'],
    '⚙️': [
        '宝箱',
        '设置',
        '备选方案'
    ],
    '⚖️': [
        '平衡比例',
        '司法比例'
    ],
    '🔗': [
        '链接',
        '链条',
        '超链接',
        '链接的链接'
    ],
    '💀': [
        '头骨',
        '亡语',
        '灰色头骨',
        '斯凯莱顿'
    ],
    '☠️': ['头骨和骨头'],
    '🦻': ['用助听器耳机'],
    '🎡': [
        '铁丝轮',
        '大轮子',
        'Fairgroundl',
        '观察轮子'
    ],
    '⛽': [
        '燃料泵站',
        'D. 石油资源',
        'Petrol',
        '气体：'
    ],
    '🚨': [
        '警察车环光灯',
        '紧急情况光',
        '闪光灯',
        'Siren'
    ],
    '🚥': ['水平流量灯'],
    '🚦': ['垂直流光线'],
    '⚓': [
        'Admiralty 模式锚点',
        '渔夫人'
    ],
    '🚧': [
        '建筑标志',
        '黑色黄色条纹标志'
    ],
    '🪂': ['Parachute'],
    '💺': [
        '头像',
        '总线飞行器Aeroplane'
    ],
    '🪐': ['土星'],
    '🎆': [
        '烟花',
        '爆炸模式'
    ],
    '🎇': [
        'Senko Hanabi',
        '烟花火焰人'
    ],
    '💷': [
        '磅Banknote',
        '£¬»ñµÃ20便笺',
        '20个Quid 便笺',
        '带有磅标志的钞票'
    ],
    '💶': [
        'Euro Banknote',
        '100 欧元',
        '带有欧元标志的钞票'
    ],
    '💵': [
        '班克尔特元',
        '$1 注释',
        '用美元标志来记作钞票',
        '美元账单',
        '美国元'
    ],
    '💴': [
        'Yen Banknote',
        '日记 1000个日记',
        'Yen 笔记',
        '带有Yen标志的钞票'
    ],
    '⛺': ['露营帐单'],
    '⛲': [
        '喷雾器',
        '水特征',
        '水喷雾器',
        '公园区'
    ],
    '💰': [
        'Money Bag',
        'Moneybags',
        '丰富的',
        '$'
    ],
    '💸': [
        '带花边的钱',
        '飞行钱',
        ' 失去资金'
    ],
    '🏷️': ['标签标签'],
    '🔖': [
        '书签',
        '价格标签',
        '标签'
    ],
    '📑': ['书签标签'],
    '📯': [
        'Postal Horn',
        'Bugle',
        '法属霍恩州'
    ],
    '🪁': ['基特文'],
    '🪀': ['Yo-Yo'],
    '🎊': [
        'Confetti Ball',
        'Confetti'
    ],
    '🎉': [
        '组队弹出器',
        '庆祝活动',
        '派对帽子'
    ],
    '🎈': [
        '气球',
        '派对',
        '红色气球'
    ],
    '🌡️': [
        '温度计',
        '热温度',
        '温度'
    ],
    '🛢️': ['油鼓座'],
    '💣': ['炸弹数'],
    '🔪': [
        '厨师刀',
        '刀具',
        '编织者小刀',
        'Hocho'
    ],
    '🏺': [
        'Amphora',
        '杰尔',
        '花店'
    ],
    '🗺️': ['世界地图'],
    '🎼': [
        '音乐得分',
        '乐谱音乐',
        'Treble Clef'
    ],
    '🎬': [
        '板甲板',
        '剪辑',
        '行 动',
        'Director',
        '电影片段'
    ],
    '🎻': [
        '暴力的',
        'String Tests',
        '世界范围内最小的侵犯行为'
    ],
    '🎺': [
        '触发器',
        '角',
        '亚兹文'
    ],
    '🎸': [
        '吉他尔',
        '音响吉塔',
        '低音吉他文',
        '电吉他的'
    ],
    '🎷': [
        '萨克斯语',
        '亚兹文',
        '萨克斯'
    ],
    '🥁': [
        '鼓座',
        '带鼓棍子'
    ],
    '🎹': [
        '钢琴座',
        '音乐键盘'
    ],
    '🪕': ['班霍文'],
    '🪗': ['Accordion'],
    '🪘': ['长鼓座'],
    '🎨': [
        '艺术家色板',
        'art',
        '绘画'
    ],
    '🧩': [
        '拼图块',
        '拼图拼图'
    ],
    '🎲': [
        '游戏死了',
        '爱好'
    ],
    '🎭': [
        '表演艺术：',
        '剧场',
        '剧集',
        '戏剧面具',
        '希腊剧院面具',
        '悲惨和巧妙的面具',
        '威尼斯州'
    ],
    '🔍': [
        '放大玻璃向左倾斜。',
        'Magnifier',
        '搜索图标',
        '左指针放大镜',
        '查找'
    ],
    '🔎': [
        '放大玻璃倾斜右侧',
        'Magnifier',
        '搜索图标',
        '右点放大玻璃板',
        '查找'
    ],
    '⌛': [
        '小时已完成',
        '小时数'
    ],
    '⏳': [
        '小时玻璃未完成',
        '带花子的小时玻璃板'
    ],
    '🕐': [
        '一个O\'Clock',
        '时钟一人O\'Clock'
    ],
    '🕜': ['一条时钟面'],
    '🕑': [
        '两个O\'Clock',
        '时钟两面O\'Clock'
    ],
    '🕝': ['时钟脸二十'],
    '🕒': [
        '三个O\'Clock',
        '时钟三个O\'时钟'
    ],
    '🕞': ['时钟三面'],
    '🕓': [
        '四个O\'Clock',
        '时钟四面O\'Clock'
    ],
    '🕟': ['时钟面 Four-30'],
    '🕔': [
        '五个O\'Clock',
        '五号时钟时钟'
    ],
    '🕠': ['时钟脸五-三十天'],
    '🕕': [
        '6个O\'Clock',
        '时钟六人O\'Clock'
    ],
    '🕡': ['时钟面'],
    '🕖': [
        '七个O\'Clock',
        '七个O\'时钟时钟'
    ],
    '🕢': ['七十三个时钟'],
    '🕗': [
        '8 O\'Clock',
        '时钟八号O\'Clock'
    ],
    '🕣': ['时钟脸八十'],
    '🕘': [
        '九个O\'Clock',
        '时钟九个O\'Clock'
    ],
    '🕤': ['时钟面部九至三十点'],
    '🕙': [
        '十个O\'Clock',
        '时钟前十\' O\'Clock'
    ],
    '🕥': ['时钟脸部-三十度'],
    '🕚': [
        '十一个O\'Clock',
        '时钟风格11型O\'Clock'
    ],
    '🕦': ['时钟脸十一'],
    '🕛': [
        '12 O\'Clock',
        '时钟脸T12O\'Clock'
    ],
    '🕧': ['时钟脸T12-30号'],
    '♨️': [
        '热泉子',
        'Onsen',
        'Steam'
    ],
    '💈': [
        'Barber Pole',
        '酒吧商店',
        'Barber的条数',
        '快餐店'
    ],
    '🎪': [
        '电路帐单',
        '大顶部',
        '圆形'
    ],
    '💢': [
        '角符号',
        '随机标志',
        'Vin Poop'
    ],
    '🗯️': [
        '右角球队',
        'Zig Zag Bubble',
        '愤怒的语音泡器'
    ],
    '💊': [
        'Pill',
        '胶片',
        '平板电脑',
        'B. 药物'
    ],
    '🎎': [
        'Dolls',
        'Hinamatsuri',
        '帝国元',
        '日元数'
    ],
    '🎏': [
        '卡普流器',
        '鱼标志',
        'Koinobori',
        '风速时钟'
    ],
    '🎐': [
        '风雪',
        'Furin',
        '杰利鱼',
        '风铃声'
    ],
    '🎀': [
        '操作区弓箭手',
        '粉红色靴子',
        '弓箭手'
    ],
    '🎁': [
        '包装礼物',
        '生日存在',
        '圣诞节礼物',
        '礼物',
        '礼品箱',
        '现职',
        '包装过的礼物'
    ],
    '🎫': [
        '服务单',
        '工单图案',
        '世界旅游票'
    ],
    '🃏': [
        'Joker',
        'Joker 卡',
        '播放卡片黑色Joker'
    ],
    '💡': [
        '淡出散装物',
        '意见',
        '电灯Bulb'
    ],
    '🔦': [
        '闪光灯',
        '火灯',
        '电火炮'
    ],
    '🏮': [
        '红纸灯',
        'Asian Lantern',
        '日语Lantern',
        '红灯',
        'Izakaya Lantern'
    ],
    '📦': [
        '包',
        '框',
        '包子'
    ],
    '📇': [
        '索引卡',
        '罗洛代克',
        '系统卡',
        '卡片索引'
    ],
    '🕳️': ['孔子'],
    '👁️‍🗨️': [
        '我是一名证人',
        '语音中的眼镜'
    ],
    '⚜️': [
        'Fleur-de-lis',
        '童子军',
        '新Orleans Saints'
    ],
    '⚗️': ['Alembic'],
    '🕯️': ['康德尔'],
    '🖼️': [
        '帧图片',
        '绘画',
        '图片帧',
        '带图片的帧'
    ],
    '🛍️': ['购物箱'],
    '🎟️': ['接纳工单'],
    '🛎️': ['Bellhop Bell'],
    '🧾': ['收款人'],
    '🧮': ['Abacus'],
    '🧫': ['Petri Dish'],
    '🧹': [
        'Bloom',
        '画笔数',
        '扫描'
    ],
    '🎰': [
        '插槽机',
        '赌场',
        '水果机',
        '赌场',
        '诗歌机机'
    ],
    '🦽': ['手工轮椅子'],
    '🦼': ['摩托化轮椅子'],
    '🪔': ['Diya Lamp'],
    '🦯': ['White Cane'],
    '🩸': ['滴血量'],
    '🩹': ['粘合片段'],
    '🩺': ['立体运势'],
    '🪶': ['羽化'],
    '🪤': ['鼠标陷动'],
    '🫖': ['Teapot'],
    '🪨': ['摇动'],
    '🪵': ['木头'],
    '🪄': ['魔法Wand'],
    '🔮': [
        '水晶球',
        'Clairvoyant',
        '财富调试器',
        '咨询师',
        '紫色水晶体'
    ],
    '🪅': ['皮纳塔文'],
    '🪆': [
        '嵌套Dolls',
        '马特罗什卡'
    ],
    '🪡': ['缝纫针头'],
    '🪢': ['库诺文'],
    '🪙': ['金币'],
    '🪃': ['Boomerang'],
    '🪥': ['牙刷子'],
    '🪦': ['头石'],
    '🪧': ['Placard'],
    '🪒': ['拉索尔']
};