// descriptions took from Emojipedia.org
lang = 'el';
//use i18n language code of the browser, more details: https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/API/i18n/LanguageCode
titles_language[lang] = {
    '🔍': 'Αποτελέσματα',
    '🕒': 'Τα πιο συνηθισμένα emojis',
    '😀': 'Smileys',
    '🙋': 'Άτομα',
    '🦊': 'Ζώα',
    '🅰️': 'Σύμβολα',
    '🍎': 'Τρόφιμα και ποτά',
    '🏳️‍🌈': 'Σημαίες',
    '🏊': 'Αθλητισμός',
    '✈️': 'Ταξίδια και θέσεις',
    '🖱️': 'Τεχνολογίες και γραφεία',
    '👗': 'Ρούχα και αξεσουάρ',
    '🖐️': 'Χέρια και μέρη του σώματος',
    '🛎️': 'Άλλο'
};
emojis_language[lang] = [];
/*search*/
emojis_language[lang][0] = {};
/*smileys*/
emojis_language[lang][2] = {
    '😀': [
        'Grinning Πρόσωπο',
        ':)',
        'Ευτυχισμένο Πρόσωπο',
        'Χαμογελαστό Πρόσωπο'
    ],
    '😃': [
        'Grinning Πρόσωπο με μεγάλα μάτια',
        ':D',
        'Ευτυχισμένο Πρόσωπο',
        'Χαμογελαστό Πρόσωπο',
        'Χαμογελώντας πρόσωπο με ανοιχτό στόμα'
    ],
    '😄': [
        'Grinning Πρόσωπο με Χαμογελώντας Μάτια',
        'Ευτυχισμένο Πρόσωπο',
        'Χαμογελαστό Πρόσωπο',
        'Grinning Πρόσωπο Με Ματιά Squinting',
        'Χαμογελώντας πρόσωπο με ανοιχτό στόμα και χαμογελώντας μάτια'
    ],
    '😁': [
        'Ομαδοποίηση προσώπου με χαμογελαστά μάτια',
        'Grinning Πρόσωπο με Χαμογελώντας Μάτια'
    ],
    '😆': [
        'Grinning Squinting Πρόσωπο',
        'xD',
        '><',
        'Μεγάλο Grin',
        'Χαμόγελο Κλειστά Μάτια',
        'Γέλεια',
        'Grinning Πρόσωπο Με Στενά Κλειστά Μάτια',
        'Χαμογελαστό πρόσωπο με ανοιχτό στόμα και αισθητά κλειστά μάτια'
    ],
    '😅': [
        'Grinning Πρόσωπο με Sweat',
        'Άσκηση',
        'Ευτυχισμένος Φούρνος',
        'Grinning πρόσωπο με μάτια Squinting και Sweat Drop',
        'Χαμογελαστό πρόσωπο με ανοιχτό στόμα και κρύο ιδρώτα'
    ],
    '🤣': [
        'ROFL',
        'Τροχαίο στο πάτωμα Γέλεια'
    ],
    '😂': [
        'Πρόσωπο με τα δάκρυα της χαράς',
        'Γέλεια',
        'Γέλια Κλάμα',
        'Γέλια Δάκρυα',
        'LOL'
    ],
    '🙂': [
        'Ελαφρώς Χαμογελώντας Πρόσωπο',
        ':)',
        'Ελαφρώς Ευτυχισμένο',
        'Αυτό Είναι Καλό'
    ],
    '🙃': [
        'Ανάποδο Πρόσωπο',
        'Sarcasm',
        'Silly',
        'Ανάποδο Πρόσωπο'
    ],
    '😉': [
        'Winking Πρόσωπο',
        ';)',
        'Ροζ',
        'Ροζ Πρόσωπο',
        'Winky Πρόσωπο'
    ],
    '😊': [
        'Χαμογελώντας πρόσωπο με χαμογελαστά μάτια',
        '^^',
        'Ευτυχισμένο Πρόσωπο',
        'Χαμόγελο',
        'Χαμογελαστό Πρόσωπο'
    ],
    '😇': [
        'Χαμογελαστό πρόσωπο με Halo',
        'Άγγελος',
        'Halo'
    ],
    '🥰': [
        'Χαμογελώντας πρόσωπο με καρδιές',
        'Αγάπη Πρόσωπο',
        'Χαμογελώντας πρόσωπο με χαμογελαστά μάτια και τρεις καρδιές'
    ],
    '😍': [
        'Χαμογελαστό πρόσωπο με τα μάτια καρδιάς',
        '*.*',
        'Μάτια Καρδιάς',
        'Καρδιά Πρόσωπο',
        'Χαμογελώντας πρόσωπο με μάτια σε σχήμα καρδιάς'
    ],
    '🤩': [
        'Αστέρι-Δομή',
        'Ερεθισμένος',
        'Μάτια Με Αστέρια',
        'Έναστρο Eyed',
        'Όμορφο Πρόσωπο',
        'Πρόσωπο Με Τα Μάτια Του Έστρου',
        'Grinning Πρόσωπο με τα μάτια αστέρι'
    ],
    '😘': [
        'Πρόσωπο που ρέει ένα φιλί',
        ':*',
        ':-*',
        'Χτύπημα Ένα Φιλί',
        'Blowing Φιλί',
        'Φιλιά',
        'Πρόσωπο ρίχνοντας ένα φιλί'
    ],
    '😗': [
        'Φιλί Πρόσωπο',
        ':*',
        ':-*',
        'Πάπιες Πρόσωπο',
        'Kissy Face',
        'Σφυρίχτρα'
    ],
    '☺️': [
        'Χαμογελώντας Πρόσωπο',
        'Ευτυχισμένο Πρόσωπο',
        'Χαμογελαστό Πρόσωπο',
        'Χαμογελώντας',
        'Λευκό Χαμογελαστό Πρόσωπο'
    ],
    '😚': [
        'Φιλί πρόσωπο με κλειστά μάτια',
        'Φιλί Πρόσωπο',
        'Kissy Face'
    ],
    '😙': [
        'Φιλί πρόσωπο με χαμογελώντας μάτια',
        'Φιλί Πρόσωπο',
        'Kissy',
        'Σφυρίχτρα',
        'Σφυρίχτρα'
    ],
    '😋': [
        'Face Savoring Food',
        'Goofy',
        'Πεινασμένος',
        'Χαμογελώντας Το Πρόσωπο Γλείφει Χείλη',
        'Προσώπου Σώζοντας Νόστιμα Τρόφιμα',
        'Yum Yum'
    ],
    '😛': [
        'Πρόσωπο με γλώσσα',
        ':P',
        'Τσιχούρι',
        'Πρόσωπο Γλώσσα',
        'Τόνγκου-Out',
        'Πρόσωπο με τη γλώσσα Stuck-Out'
    ],
    '😜': [
        'Winking Πρόσωπο με γλώσσα',
        ';P',
        'Τρελό',
        'Τρελό Πρόσωπο',
        'Winking Πρόσωπο Με Stuck-Out Γλώσσα',
        'Πρόσωπο με Stuck-Out γλώσσα και Winking Μάτι'
    ],
    '🤪': [
        'Zany Face',
        'Τρελά Μάτια',
        'Ερεθισμένος',
        'Άγρια',
        'Goofy Face',
        'Grinning πρόσωπο με ένα μεγάλο και ένα μικρό μάτι'
    ],
    '😝': [
        'Squinting Πρόσωπο με γλώσσα',
        'xP',
        'Έξοδος Γλώσσας',
        'Πρόσωπο με κολλήσει έξω γλώσσα και στριμωγμένα μάτια',
        'Πρόσωπο με Stuck-Out γλώσσα και Tightly-Closed Μάτια'
    ],
    '🤑': [
        'Πρόσωπο Μήνας-Στόματος',
        ':$',
        'Δολάριο Σημάδι Μάτια',
        'Πρόσωπο Χρήματος',
        'Πλούσιο'
    ],
    '🤗': [
        'Σχολιάζοντας Πρόσωπο',
        'Αγκαλιά',
        'Σχολιασμός',
        'Αγκαλιές',
        'Ευτυχισμένο Πρόσωπο Με Χέρια Hugging'
    ],
    '🤭': [
        'Ωχ',
        'Πρόσωπο με το χέρι πάνω από το στόμα',
        'Χαμογελώντας πρόσωπο με χαμογελαστά μάτια και χέρι κάλυψη στόμα'
    ],
    '🤫': [
        'Shh',
        'Shush',
        'Shushing Πρόσωπο',
        'Θάμβος',
        'Ησυχία',
        'Σίγαση',
        'Αθόρυβο',
        'Πρόσωπο με κάλυψη δάχτυλου κλειστά χείλη'
    ],
    '🤔': [
        'Τι',
        '?',
        'Χμμ',
        'Σκέψη Πρόσωπο',
        'Αντίχειρα Κακιού',
        'Σπινθηριστής',
        'Ρίψη Σκιάς'
    ],
    '🤐': [
        'Τ.Κ.',
        'Πρόσωπο Φερμουάρ-Στόματος',
        'Χείλη Σφραγισμένα',
        'Σφραγισμένα Χείλη',
        'Τ.Κ.',
        'Πρόσωπο με στόμιο φερμουάρ'
    ],
    '🤨': [
        'Πρόσωπο με ενισχυμένο φρύδι',
        'Colbert',
        'Ο Βράχος',
        'Πρόσωπο Με Αυξημένο Φρύδι',
        'Πρόσωπο με ένα φρύδι αυξήθηκε'
    ],
    '😐': [
        'Ουδέτερο Πρόσωπο',
        ':|',
        'Πρόσωπο Με Ευθεία Στόμα',
        'Straight Faced'
    ],
    '😑': [
        'Χωρίς Εξπρεσιονίκες Πρόσωπο',
        '-_-',
        'Πρόσωπο Με Ευθεία Στόμα',
        'Ευθεία Πρόσωπο'
    ],
    '😶': [
        'Πρόσωπο Χωρίς Στόμα',
        'Κενό Πρόσωπο',
        'Στόμα',
        'Σίγαση',
        'Αθόρυβο'
    ],
    '😏': [
        'Σμίκρυνση Πρόσωπο',
        'Φλερτ',
        'Σεξουαλική Πρόσωπη',
        'Κούπα Πρόσωπο',
        'Προτεινόμενο Χαμόγελο'
    ],
    '😒': [
        'Unamused Πρόσωπο',
        'Ανικανοποίητος',
        'Meh',
        'Πλευρική Μάτι',
        'Αισθητοποιημένο'
    ],
    '🙄': [
        'Πρόσωπο με τροχαίο μάτια',
        'Μάτι Roll'
    ],
    '😬': [
        'Σύλληψη Πρόσωπο',
        'Awkward',
        'Eek',
        'Πόδι Στο Βουνό',
        'Νευρικό',
        'Snapchat Αμοιβαία #1 Καλύτερος Φίλος'
    ],
    '🤥': [
        'Ψευδές Πρόσωπο',
        'Ψυχρός',
        'Μακρυά Μύτη',
        'Pinocchio'
    ],
    '😌': [
        'Ανακουφισμένο Πρόσωπο',
        'Περιεχόμενο',
        'Ευχαριστημένος'
    ],
    '😔': [
        'Συγνώμη',
        'Pensive Πρόσωπο',
        'Pensive',
        'Λυπημένο',
        'Sadface',
        'Λυπημένος',
        'Λυπημένο Pensive Πρόσωπο'
    ],
    '😪': [
        'Υπνηλία Πρόσωπο',
        'Πλευρά-δάκρυ',
        'Χωρίς Φούσκα'
    ],
    '🤤': [
        'Σάλιο',
        'Drooling Face',
        'Drool'
    ],
    '😴': [
        'Πρόσωπο Ύπνου',
        'Zzz',
        'Πρόσωπο Ύπνου',
        'Ροχαλητό',
        'Zzz Πρόσωπο'
    ],
    '🥱': ['Πρόσωπο Αυγής'],
    '😷': [
        'Πρόσωπο με ιατρική μάσκα',
        'Coronavirus',
        'COVID-19',
        'Μάσκα Πρόσωπο',
        'Χειρουργική Μάσκα'
    ],
    '🤒': [
        'Πρόσωπο με θερμόμετρο',
        'Ill',
        'Άρωστο'
    ],
    '🤕': [
        'Πρόσωπο με Επικεφαλής',
        'Κεφαλή Εξανδρωμένου',
        'Αδέξιος',
        'Λείπει'
    ],
    '🤢': [
        'Ναυτία Πρόσωπο',
        'Αηδία',
        'Πράσινο Πρόσωπο',
        'Έμβος'
    ],
    '🤮': [
        'Πρόσωπο Έμετος',
        'Σήκωσε',
        'Bleah',
        'Bleurgh',
        'Yuk',
        'Γιουκ',
        'EW',
        'Σήκωσε',
        'Πέτα Πάνω',
        'Έμβος',
        'Πρόσωπο με Ανοιχτό Στόμα Έμετος'
    ],
    '🤧': [
        'Φτάρνισμα Πρόσωπο',
        'Gesundheit'
    ],
    '🥵': [
        'Ζεστό Πρόσωπο',
        'Υπερθερμαινόμενο Πρόσωπο'
    ],
    '🥶': [
        'Κρύο Πρόσωπο',
        'Ψυχρό',
        'Ψύξη',
        'Παγωμένο Πρόσωπο'
    ],
    '🥴': [
        'Woozy Πρόσωπο',
        'Μεθυσμένος Πρόσωπο',
        'Πρόσωπο με Uneven Μάτια και Wavy Στόμα'
    ],
    '😵': [
        'Dizzy Face',
        'Διασταυρούμενα Μάτια Πρόσωπο',
        'Σπείρα Μάτια Πρόσωπο'
    ],
    '🤯': [
        'Κεφαλή Εκρήξεως',
        'Μυαλό Φυσητό',
        'Σοκαρισμένο πρόσωπο με εκρηκτική κεφαλή'
    ],
    '🤠': [
        'Cowboy Καπέλο Πρόσωπο',
        'Καουμπόι',
        'Cowboy Πρόσωπο',
        'Πρόσωπο με καουμπόι καπέλο'
    ],
    '🥳': [
        'Πρόσωπο Πάρτυ',
        'Πρόσωπο Πάρτυ',
        'Πρόσωπο με κέρατο πάρτι και καπέλο κόμμα'
    ],
    '😎': [
        'Χαμογελώντας πρόσωπο με γυαλιά ηλίου',
        'Ψυχρό',
        'Αμοιβαία Καλύτεροι Φίλοι (Snapchat)',
        'Γυαλιά ηλίου'
    ],
    '🤓': [
        'Nerd Πρόσωπο',
        'Nerdy'
    ],
    '🧐': ['Πρόσωπο με Monocle'],
    '😕': [
        'Συμπαγής Πρόσωπο',
        ':/',
        ':S',
        'Μη Συμπληρωμένο',
        'Παζλ'
    ],
    '😟': [
        'Ανησυχία Πρόσωπο',
        ':(',
        'Λυπημένο',
        'Sadface'
    ],
    '🙁': [
        'Ελαφρώς Frowning Πρόσωπο',
        ':(',
        'Ελαφρώς Λυπημένος'
    ],
    '☹️': [
        'Frowning Πρόσωπο',
        ':(',
        'Megafrown',
        'Άσπρο Frowning Πρόσωπο'
    ],
    '😮': [
        'Ουάου',
        ':O',
        'Ωχ μου!',
        'Πρόσωπο με Ανοιχτό Στόμα',
        'Άνοιγμα Στόματος',
        'Έκπληκτος Πρόσωπο Με Ανοιχτό Στόμα'
    ],
    '😯': [
        'Προωθημένο Πρόσωπο',
        ':O',
        'Έκπληξη',
        'Έκπληξη Πρόσωπο'
    ],
    '😲': [
        'Σοκαρισμένο Πρόσωπο',
        ':O',
        'Ουάου',
        'Πέτρινο Πρόσωπο',
        'Μεθυσμένος Πρόσωπο',
        'Πρόσωπο Ανάφλεξης'
    ],
    '😳': [
        'Έξαψη Πρόσωπο',
        ':$',
        'Πρόσωπο Blushing',
        'Φθαρμένο',
        'Ντροπή',
        'Πρόσωπο Με Ευρεία Ανοιχτά Μάτια'
    ],
    '🥺': [
        'Δέσμευση Πρόσωπο',
        ':(',
        'Τρέξιμο',
        'Γυαλιστερά Μάτια',
        'Simp',
        'Πρόσωπο με χαραγμένα μάτια'
    ],
    '😦': [
        'Frowning Πρόσωπο με Ανοιχτό Στόμα',
        'Δ:',
        'Ιχθυοκαλλιέργεια'
    ],
    '😨': [
        'Νοσηλευμένο',
        'Δ:',
        'Φοβερό Πρόσωπο',
        'Έκπληξη'
    ],
    '😰': [
        'Άγρια Πρόσωπο με Sweat',
        'Μπλε Πρόσωπο',
        'Ενδιαφερόμενο Πρόσωπο',
        'Νευρικό Πρόσωπο',
        'Πρόσωπο με Ανοιχτό Στόμα και Ψυχρό Ύφασμα'
    ],
    '😥': [
        'Λυπημένο αλλά Ανακουφισμένο Πρόσωπο',
        ':\'(',
        'Φρύδι Sweat',
        'Απογοητευμένος αλλά Ανακουφισμένος Πρόσωπο'
    ],
    '😢': [
        'Κλαίνοντας Πρόσωπο',
        ':\'(',
        'Κλάμα',
        'Δάκρυ'
    ],
    '😭': [
        'Έντονα Κλάμα Πρόσωπο',
        'Bawling',
        'Κλάμα',
        'Λυπημένα Δάκρυα',
        'Sobbing'
    ],
    '😱': [
        'Οδήγηση προσώπου στο φόβο',
        'Οικιακή Μόνο',
        'Scream',
        'Screaming Πρόσωπο'
    ],
    '😖': [
        'Σταθερό Πρόσωπο',
        'Στόμα Quivering',
        'Ανακάτεμα Πρόσωπο'
    ],
    '😣': [
        'Διαρκής Πρόσωπο',
        'Άχρηστο Πρόσωπο',
        'Ανακατεμένα Μάτια'
    ],
    '😞': [
        'Απογοητευμένο Πρόσωπο',
        ':(',
        'Λυπημένο',
        'Sadface'
    ],
    '😓': [
        'Downcast Πρόσωπο με Sweat',
        'Σκληρή Εργασία',
        'Λυπημένο Πρόσωπο Sweat',
        'Πρόσωπο με κρύο Sweat'
    ],
    '😩': [
        'Weary Πρόσωπο',
        'Παραβιασμένη Πρόσωπο',
        'Wailing'
    ],
    '😫': [
        'Κουρασμένο Πρόσωπο',
        'Εξαντλημένο',
        'Fed Επάνω',
        'Παραβιασμένη Πρόσωπο'
    ],
    '😤': [
        'Πρόσωπο με ατμό από μύτη',
        'Αερισμός των Grievances',
        'Απογοητευμένος',
        'Mad Πρόσωπο',
        'Ατμός',
        'Huffing Με Πρόσωπο Θυμός'
    ],
    '😡': [
        'Προωθητικό Πρόσωπο',
        'Θυμωμένος Πρόσωπο',
        'Grumpy Πρόσωπο',
        'Mad Πρόσωπο',
        'Κόκκινο Πρόσωπο'
    ],
    '😠': [
        'Θυμωμένος Πρόσωπο',
        'Θυμωμένος',
        'Grumpy Πρόσωπο'
    ],
    '🤬': [
        'Πουλερικά',
        '@#$%&!',
        'Πρόσωπο με σύμβολα στο στόμα',
        'Cursing',
        'Μείωση',
        'Grawlix',
        'Πρόσωπο Με Σύμβολα Πάνω Από Το Στόμα',
        'Σοβαρό πρόσωπο με σύμβολα που καλύπτουν το στόμα'
    ],
    '🥲': ['Χαμογελώντας πρόσωπο με δάκρυ'],
    '🥸': ['Μεταμφιεσμένο Πρόσωπο'],
    '😈': [
        'Χαμογελώντας πρόσωπο με κέρατα',
        'Διάβολος',
        'Κέρατα Διάβολου',
        'Ευτυχισμένος Διάβολος',
        'Μωβ Διάβολος',
        'Κόκκινος Διάβολος'
    ],
    '👿': [
        'Θυμωμένος πρόσωπο με κέρατα',
        'Διάβολος',
        'Κέρατα Διάβολου',
        'Μωβ Διάβολος',
        'Μωβ Γκομπλιν',
        'Λυπημένος Διάβολος',
        'Imp'
    ],
    '🤡': [
        'Πρόσωπο Κλόουν',
        'Ανατριχιαστικός Κλόουν',
        'Κακό Κλόουν',
        'Τρομακτικό Κλόουν'
    ],
    '👽': [
        'Εξωγήινος',
        'ET'
    ],
    '👾': [
        'Εξωγήινο Τέρας',
        'Διάστημα Invader',
        'Τέρας Παιχνιδιού Βίντεο'
    ],
    '🤖': [
        'Robot',
        'Πρόσωπο Ρομπότ'
    ],
    '👹': [
        'Ogre',
        'Μάσκα Πρόσωπο',
        'Oni',
        'Κόκκινο Τέρας',
        'Ogre Ιαπωνίας'
    ],
    '👻': [
        'Φάντασμα',
        'Halloween'
    ],
    '🗣️': [
        'Μιλώντας Κεφαλή',
        'Mansplaining',
        'Shout',
        'Φωνή',
        'Μιλώντας κεφάλι στη σιλουέτα'
    ],
    '👤': [
        'Προτομή σε σιλουέτα',
        'Σκιά',
        'Silhouette',
        'Χρήστης',
        'Σιλουέτα του ατόμου'
    ],
    '🫂': ['Άτομα Αγκαλιάζει'],
    '👥': [
        'Busts σε Σιλουέτα',
        'Σκιές',
        'Silhouettes',
        'Χρήστες',
        'Σιλουέτα των δύο ατόμων'
    ]
};
/*people*/
emojis_language[lang][3] = {
    '👶[[*skin_tone*]]': [
        'Μωρό',
        'Παιδί',
        'Νήπιο'
    ],
    '🧒[[*skin_tone*]]': [
        'Παιδί',
        'Φύλο Ουδέτερο Παιδί'
    ],
    '👧[[*skin_tone*]]': ['Κορίτσι'],
    '🧑[[*skin_tone*]]': [
        'Πρόσωπο',
        'Φύλο Ουδέτερο Ενήλικες',
        'Ενήλικες'
    ],
    '👱[[*skin_tone*]]': [
        'Πρόσωπο: Blond Μαλλιά',
        'Ξανθό',
        'Ξανθιά',
        'Ξανθός Άνθρωπος',
        'Άτομο με ξανθά μαλλιά',
        'Άνθρωπος Με Ξανθιά Μαλλιά'
    ],
    '👨[[*skin_tone*]]': [
        'Άνθρωπος',
        'Άντρας',
        'Moustache Άνθρωπος'
    ],
    '🧔[[*skin_tone*]]': [
        'Άνθρωπος: Αρκούδα',
        'Αρκούδα',
        'Γενειοφόρος Άνθρωπος',
        'Γενειοφόρος Άτομο'
    ],
    '👨[[*skin_tone*]]‍🦰': [
        'Άνθρωπος: Κόκκινα Μαλλιά',
        'Άνθρωπος Τζίντζερ',
        'Man Redhead',
        'Άνθρωπος Με Κόκκινα Μαλλιά'
    ],
    '👨‍[[*skin_tone*]]‍🦱': [
        'Άνθρωπος: Σγουρά Μαλλιά',
        'Άνθρωπος Με Σγουρά Μαλλιά'
    ],
    '👨‍[[*skin_tone*]]‍🦳': [
        'Άνθρωπος: Λευκό Μαλλιά',
        'Άνθρωπος Με Γκρι Μαλλιά'
    ],
    '👨‍[[*skin_tone*]]‍🦲': [
        'Άνθρωπος: Φαλακρός',
        'Άνθρωπος Χωρίς Μαλλιά'
    ],
    '👩[[*skin_tone*]]': [
        'Γυναίκα',
        'Γυναίκα',
        'Κυρία',
        'Κίτρινη Γυναίκα'
    ],
    '👩‍[[*skin_tone*]]‍🦰': [
        'Γυναίκα: Κόκκινα Μαλλιά',
        'Γυναίκα Τζίντζερ',
        'Woman Redhead',
        'Γυναίκα Με Κόκκινα Μαλλιά'
    ],
    '👩‍[[*skin_tone*]]‍🦱': [
        'Γυναίκα: Σγουρά Μαλλιά',
        'Γυναίκα Με Σγουρά Μαλλιά'
    ],
    '👩‍[[*skin_tone*]]‍🦳': [
        'Γυναίκα: Λευκό Μαλλιά',
        'Γυναίκα Με Γκρι Μαλλιά'
    ],
    '👩‍[[*skin_tone*]]‍🦲': [
        'Γυναίκα: Φαλακρός',
        'Γυναίκα Χωρίς Μαλλιά'
    ],
    '👱[[*skin_tone*]]‍♀️': [
        'Γυναίκα: Ξανθά Μαλλιά',
        'Γυναίκα Με Ξανθιά Μαλλιά'
    ],
    '👱[[*skin_tone*]]‍♂️': [
        'Άνθρωπος: Ξανθά Μαλλιά',
        'Άνθρωπος Με Ξανθιά Μαλλιά'
    ],
    '🧓[[*skin_tone*]]‍': [
        'Παλαιότερο Άτομο',
        'Φύλο Ουδέτερο Παλαιότερο Ενήλικο'
    ],
    '👴[[*skin_tone*]]‍': [
        'Παλιός Άνθρωπος',
        'Ηλικιωμένος Άνθρωπος',
        'Grandpa',
        'Παλαιότερος Άνθρωπος'
    ],
    '👵[[*skin_tone*]]‍': [
        'Παλιά Γυναίκα',
        'Ηλικιωμένη Γυναίκα',
        'Γιαγιά',
        'Nanna',
        'Παλιά Κυρία',
        'Ηλικιωμένη Γυναίκα'
    ],
    '👼[[*skin_tone*]]‍': [
        'Βρεφικός Άγγελος',
        'Άγγελος',
        'Cherub',
        'Έρωτας',
        'Πούτο'
    ],
    '🎅[[*skin_tone*]]‍': [
        'Άγιος Βασίλης',
        'Άγιος Νικόλαος',
        'Sinterklaas',
        'Πατέρας Χριστούγεννα'
    ],
    '🤶[[*skin_tone*]]‍': [
        'Κυρία Claus',
        'Μητέρα Χριστούγεννα'
    ],
    '🤴[[*skin_tone*]]‍': ['Πρίγκιπας'],
    '👸[[*skin_tone*]]‍': [
        'Πριγκίπισσα',
        'Ξανθό Κορίτσι',
        'Κορίτσι Με Κορώνα',
        'Κορίτσι Με Τιάρα'
    ],
    '👳‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Που Φοράει Turban'],
    '👳‍[[*skin_tone*]]‍♀️': ['Γυναίκα Που Φοράει Turban'],
    '👲[[*skin_tone*]]‍': [
        'Άτομο Με Skullcap',
        'Ασιατικός Άνθρωπος',
        'Άνθρωπος Με Κινεζικό Καπέλο',
        'Άνθρωπος με τον Gua Pi Mao'
    ],
    '🧕[[*skin_tone*]]‍': [
        'Γυναίκα με μαντίλα',
        'Hijab',
        'Πρόσωπο με μαντίλα'
    ],
    '🤵[[*skin_tone*]]‍': [
        'Πρόσωπο στο Tuxedo',
        'Groom',
        'Άνθρωπος Σε Κοστούμι',
        'Άνθρωπος στο Tuxedo'
    ],
    '👰[[*skin_tone*]]‍': [
        'Άτομο Με Veil',
        'Νύφη',
        'Νύφη με λαχανικό'
    ],
    '👰‍[[*skin_tone*]]‍♂️': ['Άνθρωπος με Veil'],
    '👰‍[[*skin_tone*]]‍♀️': ['Γυναίκα με λαχανικό'],
    '👩‍[[*skin_tone*]]‍🍼': ['Γυναίκα Διατροφή Μωρού'],
    '👨‍[[*skin_tone*]]‍🍼': ['Ο Άνθρωπος Διατροφή Μωρού'],
    '🥷': ['Νίντζα'],
    '🤰[[*skin_tone*]]‍': [
        'Έγκυος Γυναίκα',
        'Κύηση',
        'Έγκυος Κυρία'
    ],
    '🤱[[*skin_tone*]]‍': [
        'Θηλασμός',
        'Θηλασμός'
    ],
    '🦸‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Superhero'],
    '🦸[[*skin_tone*]]‍‍♀️': ['Γυναίκα Superhero'],
    '🦹[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Supervillain'],
    '🦹[[*skin_tone*]]‍‍♀️': ['Γυναίκα Supervillain'],
    '🧙[[*skin_tone*]]‍': [
        'Μασάζ',
        'Sorcerer',
        'Sorceress',
        'Μάγισσα',
        'Μάγος'
    ],
    '🧙[[*skin_tone*]]‍‍♀️': [
        'Μάγος Γυναίκας',
        'Μάγισσα',
        'Sorceress'
    ],
    '🧚[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Νεράιδα'],
    '🧚‍[[*skin_tone*]]‍♀️': ['Γαλακτοκομικά Γυναίκα'],
    '🧛‍[[*skin_tone*]]‍♂️': [
        'Άνθρωπος Βαμπίρ',
        'Δράκουλας'
    ],
    '🧛[[*skin_tone*]]‍‍♀️': ['Vampire Γυναίκας'],
    '🧜‍[[*skin_tone*]]‍♂️': ['Μέρμαν'],
    '🧜‍[[*skin_tone*]]‍♀️': ['Γοργόνα'],
    '🧝‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Elf'],
    '🧝‍[[*skin_tone*]]‍♀️': ['Elf Γυναίκας'],
    '🧞‍♂️': ['Man Genie'],
    '🧞‍♀️': ['Woman Genie'],
    '🕵️‍[[*skin_tone*]]‍♂️': [
        'Ανιχνευτής Ανθρώπου',
        'Ιδιωτικό Μάτι',
        'Sleuth',
        'Κατασκόπων',
        'Man Sleuth',
        'Ύπνος ή κατάσκοπος',
        '007',
        'Επιθεωρητής'
    ],
    '🕵️‍[[*skin_tone*]]‍♀️': ['Ανιχνευτής Γυναίκας'],
    '💂[[*skin_tone*]]‍': [
        'Φρουρός',
        'Βρετανός Φρουρός',
        'Φρουρά Πόδι'
    ],
    '💂[[*skin_tone*]]‍‍♀️': ['Φρουρά Γυναίκας'],
    '👮[[*skin_tone*]]‍': [
        'Αστυνομικός Λειτουργός',
        'Cop',
        'Αστυνομία',
        'Πολιτικός',
        'Αστυνομική'
    ],
    '👮[[*skin_tone*]]‍‍♀️': ['Γυναίκα Αστυνομικός Αξιωματικός'],
    '👨‍[[*skin_tone*]]‍🚒': ['Πυροσβέστης Του Ανθρώπου'],
    '👩[[*skin_tone*]]‍‍🚒': ['Γυναικείο Πυροσβέστη'],
    '👨[[*skin_tone*]]‍‍✈️': ['Άνθρωπος Πιλότος'],
    '👩[[*skin_tone*]]‍‍✈️': ['Γυναίκα Πιλότος'],
    '👨‍[[*skin_tone*]]‍💻': [
        'Άνθρωπος Τεχνολόγος',
        'Άνθρωπος Τεχνολόγος'
    ],
    '👩‍[[*skin_tone*]]‍💻': ['Γυναίκα Τεχνολόγος'],
    '👨‍[[*skin_tone*]]‍🎤': [
        'Τραγουδιστής Του Ανθρώπου',
        'Bowie',
        'Aladdin Sane'
    ],
    '👩‍[[*skin_tone*]]‍🎤': ['Γυναίκα Τραγουδιστής'],
    '👨‍[[*skin_tone*]]‍🎨': ['Άνθρωπος Καλλιτέχνης'],
    '👩‍[[*skin_tone*]]‍🎨': ['Καλλιτέχνης Γυναίκας'],
    '👷[[*skin_tone*]]‍‍♂️': ['Εργάτης Κατασκευής Ανθρώπων'],
    '👷[[*skin_tone*]]‍‍♀️': ['Γυναίκα Εργάτης Κατασκευής'],
    '👨[[*skin_tone*]]‍‍🚀': [
        'Άνθρωπος Αστροναύτης',
        'Άνθρωπος Κοσμοναύτης'
    ],
    '👩[[*skin_tone*]]‍‍🚀': [
        'Αστροναύτης Γυναίκας',
        'Γυναίκα Cosmonaut'
    ],
    '👨[[*skin_tone*]]‍‍🔬': ['Άνθρωπος Επιστήμονας'],
    '👩[[*skin_tone*]]‍‍🔬': ['Γυναίκα Επιστήμονας'],
    '👨‍[[*skin_tone*]]‍💼': [
        'Υπάλληλος Του Man',
        'Διευθύνων Σύμβουλος',
        'Επιχειρηματίας'
    ],
    '👩‍[[*skin_tone*]]‍💼': [
        'Γυναικεία Εργάτης Γραφείου',
        'Επιχειρηματίας',
        'Διευθύνων Σύμβουλος'
    ],
    '👨‍[[*skin_tone*]]‍🏭': ['Εργαζόμενος Εργαζόμενος Άνθρωπος'],
    '👩[[*skin_tone*]]‍‍🏭': ['Γυναίκα Εργαζόμενος'],
    '👨[[*skin_tone*]]‍‍🔧': ['Άνθρωπος Μηχανικός'],
    '👩[[*skin_tone*]]‍‍🔧': ['Γυναικεία Μηχανική'],
    '👨[[*skin_tone*]]‍‍🍳': [
        'Άνθρωπος Cook',
        'Άνθρωπος Σεφ',
        'Αρσενικός Σεφ'
    ],
    '👩[[*skin_tone*]]‍‍🍳': [
        'Μαγειρική Γυναίκας',
        'Σεφ Γυναίκας',
        'Θηλυκός Σεφ'
    ],
    '👨[[*skin_tone*]]‍‍🌾': ['Άνθρωπος Αγρότης'],
    '👩[[*skin_tone*]]‍‍🌾': ['Αγρότης Γυναίκας'],
    '👨[[*skin_tone*]]‍‍⚖️': ['Άνθρωπος Δικαστής'],
    '👩[[*skin_tone*]]‍‍⚖️': ['Δικαστής Γυναίκας'],
    '👨[[*skin_tone*]]‍‍🏫': ['Δάσκαλος Του Ανθρώπου'],
    '👩[[*skin_tone*]]‍‍🏫': ['Δάσκαλος Γυναίκας'],
    '👨‍[[*skin_tone*]]‍🎓': ['Μαθητής Άνθρωπος'],
    '👩‍[[*skin_tone*]]‍🎓': ['Γυναίκα Μαθητής'],
    '👨[[*skin_tone*]]‍‍⚕️': [
        'Εργαζόμενος Στην Υγεία Του Ανθρώπου',
        'Αρσενικό Γιατρός',
        'Αρσενικό Νοσοκόμα'
    ],
    '👩‍[[*skin_tone*]]‍⚕️': [
        'Γυναίκα Εργαζόμενος Υγείας',
        'Θηλυκός Γιατρός',
        'Γυναίκα Νοσοκόμα'
    ],
    '🤷‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Shrugging'],
    '🤷‍[[*skin_tone*]]‍♀️': ['Γυναίκα Shrugging'],
    '🤦‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Facepalming'],
    '🤦‍[[*skin_tone*]]‍♀️': ['Γυναίκα Facepalming'],
    '🙇[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Μπόουινγκ'],
    '🙇[[*skin_tone*]]‍‍♀️': ['Γυναίκα Bowing'],
    '🧏‍[[*skin_tone*]]‍♂️': ['Κωφός Άνθρωπος'],
    '🧏[[*skin_tone*]]‍‍♀️': ['Κωφών Γυναίκας'],
    '🙋[[*skin_tone*]]‍‍♂️': [
        'Άνθρωπος Αύξηση Χεριών',
        'Happy Man Raising Ένα Χέρι'
    ],
    '🙋‍[[*skin_tone*]]‍♀️': [
        'Γυναικεία Ανύψωση Χέρι',
        'Ευτυχισμένη Γυναίκα Αυξάνει Ένα Χέρι'
    ],
    '💁‍[[*skin_tone*]]‍♂️': [
        'Άνθρωπος Χέρι Συμβουλών',
        'Άνθρωπος Γραφείου Πληροφοριών'
    ],
    '💁‍[[*skin_tone*]]‍♀️': [
        'Χέρι Συμβουλής Γυναίκας',
        'Γυναίκα Γραφείου Πληροφοριών'
    ],
    '🙆‍[[*skin_tone*]]‍♂️': ['Man Gesturing OK'],
    '🙆‍[[*skin_tone*]]‍♀️': ['Απαγόρευση Γυναίκας Εντάξει'],
    '🙅‍[[*skin_tone*]]‍♂️': ['Αριθ. Χειρονομίας Του Ανθρώπου'],
    '🙅‍[[*skin_tone*]]‍♀️': ['Χειρισμός Γυναίκας Αριθ.'],
    '🙎‍[[*skin_tone*]]‍♂️': ['Ο Άνθρωπος Pouting'],
    '🙎[[*skin_tone*]]‍‍♀️': ['Pouting Γυναίκας'],
    '🙍[[*skin_tone*]]‍‍♂️': ['Man Frowning'],
    '🙍[[*skin_tone*]]‍‍♀️': ['Γυναίκα Frowning'],
    '🧟‍‍♂️': ['Ο Άνθρωπος Ζόμπι'],
    '🧟‍‍♀️': ['Ζόμπι Γυναίκας'],
    '🚶‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Περπάτημα'],
    '🚶‍[[*skin_tone*]]‍♀️': ['Γυναίκα Περπάτημα'],
    '🧍[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Στέκεται'],
    '🧍[[*skin_tone*]]‍‍♀️': ['Γυναίκα Μόνιμη'],
    '🧎‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Γονιμοποίηση'],
    '🧎[[*skin_tone*]]‍‍♀️': ['Γονάτωση Γυναίκας'],
    '👨‍[[*skin_tone*]]‍🦯': ['Άνθρωπος με λευκό ζαχαροκάλαμο'],
    '👩‍[[*skin_tone*]]‍🦯': ['Γυναίκα με λευκό ζαχαροκάλαμο'],
    '👨‍[[*skin_tone*]]‍🦼': ['Άνθρωπος σε μηχανοκίνητη αναπηρική καρέκλα'],
    '👩‍[[*skin_tone*]]‍🦼': ['Γυναίκα σε Μηχανοκίνητη Αναπηρική Καρέκλα'],
    '👨‍[[*skin_tone*]]‍🦽': ['Ο άνθρωπος σε χειρωνακτική αναπηρική καρέκλα'],
    '👩‍[[*skin_tone*]]‍🦽': ['Γυναίκα σε χειρωνακτική αναπηρική καρέκλα'],
    '👯‍♂️': ['Άνδρες με αυτιά Bunny'],
    '👯‍♀️': ['Γυναίκες με Bunny αυτιά'],
    '🕴️‍[[*skin_tone*]]‍': [
        'Πρόσωπο σε επίπεδο κοστούμι',
        'Hovering Man',
        'Rude Boy',
        'Walt Jabsco',
        'Άνθρωπος σε Business Κοστούμι'
    ],
    '🧖‍‍[[*skin_tone*]]‍♂️': [
        'Άνθρωπος στο Steamy Room',
        'Άνθρωπος στη Σάουνα'
    ],
    '🧖‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα στο Steamy Room',
        'Γυναίκα στη Σάουνα'
    ],
    '👫‍[[*skin_tone*]]‍': [
        'Γυναίκα και άνθρωπος κρατώντας χέρια',
        'Ετεροεξουαλικό Ζευγάρι',
        'Ευθεία Ζευγάρι',
        'Άνθρωπος και γυναίκα κρατώντας χέρια'
    ],
    '👭‍[[*skin_tone*]]‍': [
        'Λεσβιακό Ζευγάρι',
        'Γυναικεία Χέρια Κρατώντας',
        'Δύο Γυναίκες Κρατώντας Τα Χέρια'
    ],
    '👬‍[[*skin_tone*]]‍': [
        'Ανδρικά Χέρια Εκμετάλλευσης',
        'Gay Ζευγάρι',
        'Δύο Άνδρες Κρατώντας Χέρια'
    ],
    '👨‍👩‍👦': [
        'Οικογένεια με τη μητέρα, τον πατέρα και τον γιο',
        'Οικογένεια: Άνθρωπος, Γυναίκα, Αγόρι'
    ],
    '👨‍👩‍👧': [
        'Οικογένεια με μητέρα, πατέρα και κόρη',
        'Οικογένεια: Άνθρωπος, Γυναίκα, Κορίτσι'
    ],
    '👨‍👩‍👧‍👦': [
        'Οικογένεια με τη μητέρα, τον πατέρα, τον γιο και την κόρη',
        'Οικογένεια: Άνδρα, Γυναίκα, Κορίτσι, Αγόρι'
    ],
    '👨‍👩‍👦‍👦': [
        'Οικογένεια με τη μητέρα, τον πατέρα και δύο γιους',
        'Οικογένεια: Άνθρωπος, Γυναίκα, Αγόρι, Αγόρι'
    ],
    '👨‍👩‍👧‍👧': [
        'Οικογένεια με τη μητέρα, τον πατέρα και δύο κόρες',
        'Οικογένεια: Άνθρωπος, Γυναίκα, Κορίτσι, Κορίτσι'
    ],
    '👨‍👨‍👦': [
        'Οικογένεια με δύο πατέρες και γιο',
        'Οικογένεια: Άνθρωπος, Άνθρωπος, Αγόρι'
    ],
    '👨‍👨‍👧': [
        'Οικογένεια με δύο πατέρες και κόρη',
        'Οικογένεια: Άνθρωπος, Άνθρωπος, Κορίτσι'
    ],
    '👨‍👨‍👧‍👦': [
        'Οικογένεια με δύο πατέρες, τον γιο και την κόρη',
        'Οικογένεια: Άνθρωπος, Άνθρωπος, Κορίτσι, Αγόρι'
    ],
    '👨‍👨‍👦‍👦': [
        'Οικογένεια με δύο πατέρες και δύο γιους',
        'Οικογένεια: Άνθρωπος, Άνθρωπος, Αγόρι, Αγόρι'
    ],
    '👨‍👨‍👧‍👧': [
        'Οικογένεια με δύο πατέρες και δύο κόρες',
        'Οικογένεια: Άνθρωπος, Άνθρωπος, Κορίτσι, Κορίτσι'
    ],
    '👩‍👩‍👦': [
        'Οικογένεια με δύο μητέρες και γιο',
        'Οικογένεια: Γυναίκα, Γυναίκα, Αγόρι'
    ],
    '👩‍👩‍👧': [
        'Οικογένεια με δύο μητέρες και κόρη',
        'Οικογένεια: Γυναίκα, Γυναίκα, Κορίτσι'
    ],
    '👩‍👩‍👧‍👦': [
        'Οικογένεια με δύο μητέρες, Υιός και κόρη',
        'Οικογένεια: Γυναίκα, Γυναίκα, Κορίτσι, Αγόρι'
    ],
    '👩‍👩‍👦‍👦': [
        'Οικογένεια με δύο μητέρες και δύο γιους',
        'Οικογένεια: Γυναίκα, Γυναίκα, Αγόρι, Αγόρι'
    ],
    '👩‍👩‍👧‍👧': [
        'Οικογένεια με δύο μητέρες και δύο κόρες',
        'Οικογένεια: Γυναίκα, Γυναίκα, Κορίτσι, Κορίτσι'
    ],
    '👨‍👦': [
        'Οικογένεια με τον πατέρα και τον γιο',
        'Οικογένεια: Άνθρωπος, Αγόρι'
    ],
    '👨‍👦‍👦': [
        'Οικογένεια: Άνθρωπος, Αγόρι, Αγόρι',
        'Οικογένεια με τον πατέρα και δύο γιους'
    ],
    '👨‍👧': [
        'Οικογένεια με τον πατέρα και την κόρη',
        'Οικογένεια: Άνθρωπος, Κορίτσι'
    ],
    '👨‍👧‍👦': [
        'Οικογένεια με τον πατέρα, τον γιο και την κόρη',
        'Οικογένεια: Άνθρωπος, Κορίτσι, Αγόρι'
    ],
    '👨‍👧‍👧': [
        'Οικογένεια με τον πατέρα και δύο κόρες',
        'Οικογένεια: Άνθρωπος, Κορίτσι, Κορίτσι'
    ],
    '👩‍👦': [
        'Οικογένεια με τη μητέρα και τον γιο',
        'Οικογένεια: Γυναίκα, Αγόρι'
    ],
    '👩‍👦‍👦': [
        'Οικογένεια με τη μητέρα και δύο γιους',
        'Οικογένεια: Γυναίκα, Αγόρι, Αγόρι'
    ],
    '👩‍👧': [
        'Οικογένεια με τη μητέρα και την κόρη',
        'Οικογένεια: Γυναίκα, Κορίτσι'
    ],
    '👩‍👧‍👦': [
        'Οικογένεια με μητέρα, Υιός και κόρη',
        'Οικογένεια: Γυναίκα, Κορίτσι, Αγόρι'
    ],
    '👩‍👧‍👧': [
        'Οικογένεια με τη μητέρα και δύο κόρες',
        'Οικογένεια: Γυναίκα, Κορίτσι, Κορίτσι'
    ],
    '💑': [
        'Ζευγάρι με καρδιά',
        'Ζευγάρι Στην Αγάπη',
        'Ζευγάρι Αγάπης',
        'Άνθρωπος και γυναίκα με καρδιά'
    ],
    '👨‍❤️‍👨': [
        'Δύο Άνδρες Με Καρδιά',
        'Ζευγάρι με την καρδιά: Άνθρωπος, Άνθρωπος'
    ],
    '👩‍❤️‍👩': [
        'Δύο Γυναίκες Με Καρδιά',
        'Ζευγάρι με καρδιά: Γυναίκα, Γυναίκα'
    ],
    '💆[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Να πάρει Μασάζ Κεφάλι'],
    '💆‍[[*skin_tone*]]‍♀️': ['Γυναίκα Να πάρει Μασάζ Κεφάλι'],
    '💇[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Getting Haircut'],
    '💇[[*skin_tone*]]‍‍♀️': ['Γυναίκα Getting Haircut'],
    '🛌[[*skin_tone*]]‍': [
        'Καταλύματα Ύπνου',
        'Πρόσωπο σε κρεβάτι',
        'Υπνηλία Άτομου'
    ]
};
/*animals*/
emojis_language[lang][4] = {
    '😺': [
        'Grinning Cat',
        ':)',
        'Χαρούμενη Γάτα',
        'Χαμογελώντας Γάτα',
        'Καλή Γάτα Πρόσωπο',
        'Χαμογελαστό πρόσωπο γάτα με ανοιχτό στόμα'
    ],
    '😸': [
        'Grinning γάτα με χαμογελαστά μάτια',
        ':D',
        'Grinning Cat',
        'Χαρούμενη Γάτα',
        'Grinning Πρόσωπο Γάτας'
    ],
    '😹': [
        'Γάτα με τα δάκρυα της χαράς',
        ':\')',
        'Χαρούμενη Δάκρυα Γάτα',
        'Γέλια Γάτα'
    ],
    '😻': [
        'Χαμογελώντας γάτα με Heart-Eyes',
        '*.*',
        'Καρδιά Μάτια Γάτα',
        'Αγάπη Γάτα',
        'Χαμογελαστό πρόσωπο γάτα με μάτια σε σχήμα καρδιάς'
    ],
    '😼': [
        'Γάτα με Wry Smile',
        'Σμίκρυνση Γάτας',
        'Σμίκρυνση Πρόσωπο Γάτας',
        'Πρόσωπο γάτας με Wry Smile'
    ],
    '😽': [
        'Φιλί Γάτα',
        ':*',
        'Φιλί Πρόσωπο Γάτα',
        'Φιλί προσώπου γάτα με κλειστά μάτια'
    ],
    '🙀': [
        'Weary Cat',
        ':O',
        'Στιλβωμένη Γάτα',
        'Γάτα Που Κρατάει',
        'Γάτα προσώπου που κρατάει στο φόβο',
        'Weary Cat Πρόσωπο'
    ],
    '😿': [
        'Κλαίνοντας Γάτα',
        ':\'(',
        'Λυπημένη Γάτα',
        'Κλαίνοντας Πρόσωπο Γάτας'
    ],
    '😾': [
        'Σπουδάζοντας Γάτα',
        'Grumpy Cat',
        'Pouting Πρόσωπο Γάτας'
    ],
    '🙈': [
        'Μαϊμού',
        'See-No-Evil Μαϊμού',
        'Μιζάρου',
        'Μαϊμού Που Καλύπτει Τα Μάτια'
    ],
    '🙉': [
        'Μαϊμού',
        'Καρδιά-Κακό Μαϊμού',
        'Kikazaru',
        'Μαϊμού Που Καλύπτει Αυτιά'
    ],
    '🙊': [
        'Μαϊμού',
        'Χωρίς Ομιλία Μαϊμού',
        'Iwazaru',
        'Στόμα Κάλυψης Μαϊμού',
        'Χωρίς Ομιλία'
    ],
    '🐵': [
        'Μαϊμού',
        'Πρόσωπο Πίθηκου',
        'Μαϊμού Κεφαλή'
    ],
    '🐒': [
        'Μαϊμού',
        'Cheeky Πίθηκος'
    ],
    '🦍': ['Gorilla'],
    '🐶': [
        'Πρόσωπο Σκύλου',
        'Σκύλος',
        'Κουτάβι'
    ],
    '🐕': [
        'Σκύλος',
        'Doggo',
        'Akita Inu'
    ],
    '🦮': [
        'Βλέποντας Τον Σκύλο Των Ματιών',
        'Οδηγός Σκύλος'
    ],
    '🐕‍🦺': ['Σκύλος Υπηρεσίας'],
    '🐩': [
        'Poodle',
        'Σκύλος',
        'Μινιατούρα Poodle',
        'Τυπικό Poodle',
        'Poodle Παιχνιδιών'
    ],
    '🐺': [
        'Λύκος',
        'Πρόσωπο Λύκου'
    ],
    '🦊': [
        'Αλεπού',
        'Πρόσωπο Αλεπού'
    ],
    '🦝': ['Ρακούν'],
    '🐱': [
        'Πρόσωπο Γάτας',
        ':3',
        'Γατάκι',
        'Γατάκι'
    ],
    '🐈': [
        'Γάτα',
        'Εγχώρια Γάτα',
        'Αγριόχοιρος',
        'Χιούσεσατ'
    ],
    '🐈‍⬛': ['Μαύρη Γάτα'],
    '🦁': [
        'Λιοντάρι',
        'Πρόσωπο Λιονταριών'
    ],
    '🐯': [
        'Πρόσωπο Tiger',
        'Χαριτωμένος Τίγρης'
    ],
    '🐅': [
        'Τίγρης',
        'Τίγρης Της Βεγγάλης'
    ],
    '🐆': [
        'Leopard',
        'Αφρικανική Λεοπάρδαλη',
        'Jaguar'
    ],
    '🐴': [
        'Πρόσωπο Άλογα',
        'Κεφαλή Άλογα'
    ],
    '🐎': [
        'Άλογα',
        'Άλογο Galloping',
        'Ιππόδρομος'
    ],
    '🦄': [
        'Μονόκερος',
        'Μονόκερο Πρόσωπο'
    ],
    '🦓': [
        'Zebra',
        'Ζέβρα Πρόσωπο'
    ],
    '🦌': [
        'Ελάφια',
        'Buck',
        'Τάρανδος',
        'Stag'
    ],
    '🐮': [
        'Πρόσωπο Αγελάδας',
        'Αγελάδα',
        'Ευτυχισμένη Αγελάδα'
    ],
    '🐂': [
        'Ox',
        'Ταύρος',
        'Bullock',
        'Oxen',
        'Τιμόνι'
    ],
    '🐃': [
        'Μπουφάν Νερού',
        'Βουβάλι',
        'Μπουφάν Για Κατοικίδια Νερό'
    ],
    '🐄': [
        'Αγελάδα',
        'Γαλακτοκομική Αγελάδα'
    ],
    '🐷': [
        'Πρόσωπο Χοιρινό',
        'Χοίροι',
        'Κεφαλή Χοίρου'
    ],
    '🐖': [
        'Χοίροι',
        'Χοκ',
        'Sow'
    ],
    '🐗': [
        'Κάπρου',
        'Warthog',
        'Αγριογούρουνο',
        'Άγρια Χοιροειδή'
    ],
    '🐽': ['Χοιρινό Μύτη'],
    '🐏': [
        'Ram',
        'Πρόβατα'
    ],
    '🐑': [
        'Ewe',
        'Lamb',
        'Πρόβατα'
    ],
    '🐐': ['Αίγες'],
    '🐪': [
        'Κάμελ',
        'Αραβική Καμέλ',
        'Καμήλα Του Χρυσού',
        'Κάμερα Με Ένα Χτύπημα'
    ],
    '🐫': [
        'Κάμελ Δύο Χυμών',
        'Ασιατική Καμήλα',
        'Καμήλα Bactrian'
    ],
    '🦙': [
        'Llama',
        'Alpaca'
    ],
    '🦒': [
        'Giraffe',
        'Giraffe Face'
    ],
    '🐘': ['Ελέφαντας'],
    '🦏': [
        'Rhinoceros',
        'Rhino'
    ],
    '🦛': [
        'Hippopotamus',
        'Hippo'
    ],
    '🐭': [
        'Πρόσωπο Ποντικιού',
        'Ποντίκι'
    ],
    '🐁': [
        'Ποντίκι',
        'Δορμούζ',
        'Ποδόσφαιρο',
        'Ποντίκια'
    ],
    '🐀': [
        'Επίσπερμο',
        'Ποδόσφαιρο'
    ],
    '🐹': [
        'Χάμστερ',
        'Πρόσωπο Χάμστερ'
    ],
    '🐰': [
        'Πρόσωπο Κουνέλι',
        'Λαγουδάκι Του Πάσχα'
    ],
    '🐇': [
        'Κουνέλι',
        'Bunny',
        'Κουνέλι Λαγού'
    ],
    '🐿️': [
        'Chipmunk',
        'Σκίουρος'
    ],
    '🦔': ['Σκαντζόχοιρος'],
    '🦇': [
        'Νυχτερίδα',
        'Batman'
    ],
    '🐻': [
        'Αρκούδα',
        'Όψη Αρκούδας',
        'Αρκουδάκι'
    ],
    '🐨': [
        'Κοάλα',
        'Πρόσωπο Koala'
    ],
    '🐼': [
        'Πάντα',
        'Πάντα Πρόσωπο'
    ],
    '🦘': [
        'Καγκουρό',
        'Ρόο'
    ],
    '🦡': ['Έμβλημα'],
    '🦃': [
        'Τουρκία',
        'Τουρκία Των Ευχαριστιών',
        'Άγρια Τουρκία'
    ],
    '🐔': [
        'Κοτόπουλα',
        'Hen'
    ],
    '🐓': [
        'Κοκκινίλα',
        'Rooster',
        'Κοκκινορέλη'
    ],
    '🐣': [
        'Τσεκούρι Εκκόλαψης',
        'Παιδικό Κοτόπουλο',
        'Επεκκόλαψη Γκόμενα'
    ],
    '🐤': [
        'Μωρό Γκόμενα',
        'Κίτρινο Πουλί'
    ],
    '🐥': [
        'Μπροστινό Μωρό Γκόμενα',
        'Μωρό Γκόμενα',
        'Μόνιμο Γκόμενα'
    ],
    '🐦': ['Πουλί'],
    '🐧': ['Penguin'],
    '🕊️': [
        'Περιστέρι',
        'Περιστέρι της ειρήνης'
    ],
    '🦅': [
        'Αετός',
        'Φαλακρός Αετός'
    ],
    '🦆': ['Πάπιες'],
    '🦢': ['Κύκνος'],
    '🦉': ['Κουκουβάγια'],
    '🦚': ['Παγόψαρο'],
    '🦜': ['Παπαγάλος'],
    '🐸': [
        'Βάτραχος',
        'Φρύνος',
        'Πρόσωπο Βάτραχος'
    ],
    '🐊': [
        'Κροκόδειλος',
        'Αλιγάτορας',
        'Κροκόδειλος'
    ],
    '🐢': [
        'Χελώνα',
        'Tortoise'
    ],
    '🦎': [
        'Μάγος',
        'Gecko'
    ],
    '🐍': [
        'Φίδι',
        'Serpent'
    ],
    '🐲': [
        'Πρόσωπο Δράκου',
        'Δράκος Κεφαλής'
    ],
    '🐉': ['Δράκος'],
    '🦕': [
        'Σαυρόποδα',
        'Brachiosaurus',
        'Brontosaurus',
        'Dinosaur'
    ],
    '🦖': [
        'T-Rex',
        'Tyrannosaurus Rex'
    ],
    '🐳': [
        'Σπασμένος Φάλαινα',
        'Χαριτωμένη Φάλαινα'
    ],
    '🐋': ['Φάλαινα'],
    '🐬': ['Δελφίνι'],
    '🐟': [
        'Ψάρια',
        'Ψάρια Γλυκού Νερού'
    ],
    '🐠': [
        'Τροπικά Ψάρια',
        'Ψάρια',
        'Κίτρινο Μπλε Ψάρι'
    ],
    '🐡': [
        'Φυσηψίες',
        'Fugu',
        'Pufferfish'
    ],
    '🦈': [
        'Καρχαρίας',
        'Μεγάλος Λευκός Καρχαρίας'
    ],
    '🐙': ['Χταπόδι'],
    '🐚': [
        'Σπειροειδές Κέλυφος',
        'Seashell',
        'Κέλυφος'
    ],
    '🐌': [
        'Σαλιγκάρι',
        'Slug',
        'Κήπος Σαλιγκάρι'
    ],
    '🦋': ['Πεταλούδα'],
    '🐛': [
        'Σφάλμα',
        'Caterpillar',
        'Έντομο'
    ],
    '🐜': [
        'Ant',
        'Σφάλμα',
        'Έντομο'
    ],
    '🐝': [
        'Μέλισσα',
        'Μέλισσα',
        'Bumblebee'
    ],
    '🐞': [
        'Lady Beetle',
        'Ladybird',
        'Ladybug',
        'Σφάλμα'
    ],
    '🦗': [
        'Κρίκετ',
        'Grasshopper'
    ],
    '🕷️': ['Αράχνη'],
    '🦂': ['Σκορπιός'],
    '🦟': ['Κουνούπι'],
    '🦀': ['Κάβουρας'],
    '🦞': ['Αστακός'],
    '🦐': [
        'Γαρίδα',
        'Prawn'
    ],
    '🦑': ['Καλαμάρι'],
    '🦧': ['Orangutan'],
    '🦥': ['Sloth'],
    '🦦': ['Otter'],
    '🦨': ['Skunk'],
    '🦬': ['Βίσος'],
    '🦣': ['Μαμούθ'],
    '🦫': ['Κάστορας'],
    '🐻‍❄️': ['Πολική Αρκούδα'],
    '🦤': ['Dodo'],
    '🦭': ['Σφραγίδα'],
    '🪲': ['Σκαθάρι'],
    '🪳': ['Κατσαρίδα'],
    '🪰': ['Πτήση'],
    '🪱': ['Σκουλήκι'],
    '🦩': ['Flamingo']
};
/*symbols*/
emojis_language[lang][5] = {
    '💘': [
        'Καρδιά με βέλος',
        'Βέλος Cupid',
        'Lovestruck'
    ],
    '💝': [
        'Καρδιά με κορδέλα',
        'Κουτί Σοκολάτας',
        'Κουτί Δώρου',
        'Καρδιά Δώρου'
    ],
    '💖': [
        'Sparkling Heart',
        'Καρδιά Σπινθήρα',
        'Σπινθηρή Καρδιά',
        'Καρδιά Αστέρων'
    ],
    '💗': [
        'Αυξανόμενη Καρδιά',
        'Πολλαπλή Καρδιά',
        'Τριπλή Καρδιά'
    ],
    '💓': [
        'Καρδιά Του Ξυλοδαρμού',
        'Συναγερμός Καρδιάς',
        'Heartbeat',
        'Καρδιά Wi-Fi'
    ],
    '💞': [
        'Περιστρεφόμενες Καρδιές',
        'Δύο Καρδιές'
    ],
    '💕': [
        'Δύο Καρδιές',
        'Μικρές Καρδιές',
        'Δύο Ροζ Καρδιές'
    ],
    '💟': ['Διακόσμηση Καρδιών'],
    '❣️': [
        'Φωνή Καρδιάς',
        'Καρδιά Πάνω Από Την Τελεία',
        'Κόκκινη καρδιά ως ένδειξη θαυμασμού',
        'Βαριά Καρδιά Διακήρυξη Μαρκ Στολίδι'
    ],
    '💔': [
        'Σπασμένη Καρδιά',
        'Σπάζοντας Καρδιά',
        'Brokenhearted',
        'Καρδιά Σπασμένη'
    ],
    '❤️': [
        'Σας Αγαπώ',
        'Κόκκινη Καρδιά',
        'Καρδιά',
        'Καρδιά Αγάπης',
        'Κόκκινη Καρδιά'
    ],
    '🧡': [
        'Πορτοκαλί Καρδιά',
        'Σας Αγαπώ'
    ],
    '💛': [
        'Κίτρινη Καρδιά',
        '#1 BF Snapchat',
        'Καρδιά Χρυσού',
        'Σας Αγαπώ'
    ],
    '💚': [
        'Πράσινη Καρδιά',
        'Ζωντανή Καρδιά',
        'Σας Αγαπώ'
    ],
    '💙': [
        'Μπλε Καρδιά',
        'Σας Αγαπώ'
    ],
    '💜': [
        'Μωβ Καρδιά',
        'Σας Αγαπώ'
    ],
    '🖤': [
        'Μαύρη Καρδιά',
        'Σκούρα Καρδιά',
        'Σας Αγαπώ'
    ],
    '🤍': [
        'Λευκή Καρδιά',
        'Σας Αγαπώ'
    ],
    '🤎': [
        'Καφέ Καρδιά',
        'Σας Αγαπώ'
    ],
    '💯': [
        'Βαθμοί Εκατοντάδες',
        '100',
        '%',
        'Κρατήστε Το 100',
        'Τέλεια Βαθμολογία',
        'Σύμβολο Εκατό Σημείων'
    ],
    '💬': [
        'Μπαλόνι Ομιλίας',
        'Φούσκα Συνομιλίας',
        'Φούσκα Ομιλίας'
    ],
    '💭': [
        'Μπαλόνι Σκέψης',
        'Σκέψης Φούσκα',
        'Φούσκα Σκέψης'
    ],
    '💤': [
        'Zzz',
        'Υπνοώρα',
        'Βόραγο',
        'Αναστολή',
        'Υπογραφή Ύπνου',
        'Σύμβολο Ύπνου'
    ],
    '♠️': [
        'Κοστούμι Μπαστούνι',
        'Spades',
        'Black Spade Suit'
    ],
    '♥️': [
        'Φυλή Καρδιάς',
        'Κάρτα Με Καρδιά',
        'Καρδιές',
        'Μαύρη Καρδιά Κοστούμι'
    ],
    '♦️': [
        'Διαμάντι Κοστούμι',
        'Διαμάντια',
        'Μαύρο Διαμάντι Κοστούμι'
    ],
    '♣️': [
        'Κοστούμι Club',
        'Κλαμπ',
        'Μαύρο Κοστούμι Club'
    ],
    '🏧': [
        'Σημάδι ATM',
        'ATM',
        'Αυτοματοποιημένη Μηχανή Τηλεειδοποίησης'
    ],
    '🎵': [
        'Μουσική Σημείωση',
        'Beamed Ζευγάρι Της Όγδοης Σημειώσεις',
        'Δοκίμιο Ζευγάρι Quavers',
        'Μουσική Σημείωση'
    ],
    '🎶': [
        'Μουσικές Σημειώσεις',
        'Μουσική',
        'Μουσικές Σημειώσεις',
        'Τραγούδι',
        'Πολλαπλές Μουσικές Σημειώσεις'
    ],
    '🔔': [
        'Κουδούνι',
        'Κουδούνι Ελευθερίας',
        'Ringer',
        'Κουδούνι Γάμου'
    ],
    '🔕': [
        'Κουδούνι με κάθετο',
        'Ειδοποιήσεις',
        'Ειδοποίηση Ήχου Απενεργοποιημένη',
        'Σίγαση Κουδουνιού',
        'Κουδούνι με ακύρωση εγκεφαλικό επεισόδιο'
    ],
    '🔈': [
        'Χαμηλή Ένταση Ηχείου',
        'Όγκος',
        'Ηχείο'
    ],
    '🔉': [
        'Μέσος Όγκος Ηχείου',
        'Μείωση Έντασης',
        'Ηχείο Με Μεσαία Ένταση',
        'Ηχείο με ένα ηχητικό κύμα'
    ],
    '🔊': [
        'Υψηλή Ένταση Ηχείου',
        'Αύξηση Έντασης',
        'Ηχείο με τρία ηχητικά κύματα'
    ],
    '🔇': [
        'Ηχείο Σε Σίγαση',
        'Σίγαση Έντασης',
        'Ηχείο με ακύρωση Stroke'
    ],
    '⛔': ['Καμία Καταχώρηση'],
    '🚫': [
        'Απαγορεύεται',
        'Αποκλεισμένος',
        'Κύκλος Πίσω Κάθετος',
        'Όχι',
        'Κόκκινος Κύκλος Διασχισμένος',
        'Περιορισμένη',
        'Δεν Υπάρχει Υπογραφή Εισόδου'
    ],
    '🚳': [
        'Χωρίς Ποδήλατα',
        'Δεν Υπάρχει Υπογραφή Ποδημάτων'
    ],
    '🚭': [
        'Μη Κάπνισμα',
        'Μη Σύμβολο Καπνίσματος'
    ],
    '🚯': [
        'Χωρίς Λίτρα',
        'Δεν Υπάρχει Σύμβολο Litter'
    ],
    '🚱': [
        'Μη Πόσιμο Νερό',
        'Χωρίς Νερό',
        'Χωρίς Πόσιμο Νερό',
        'Μη Πόσιμο Σύμβολο Νερού'
    ],
    '🚷': [
        'Χωρίς Πεζούς',
        'Χωρίς Άτομα',
        'Χωρίς Περπάτημα'
    ],
    '🔞': [
        'No One Under Eighteen',
        'Ακατάλληλος',
        'Κανένας Κάτω Από Δεκαοκτώ Σύμβολο',
        '18'
    ],
    '📵': [
        'Χωρίς Κινητά Τηλέφωνα',
        'Χωρίς Κινητά Τηλέφωνα',
        'Δεν Υπάρχουν Τηλέφωνα',
        'Χωρίς Smartphones'
    ],
    '☢️': [
        'Radioactive',
        'Σύμβολο Διεθνούς Ακτινοβολίας',
        'Πυρηνικός',
        'Ραδιενεργός Σημάδι'
    ],
    '☣️': [
        'Βιοκίνδυνος',
        'Σημάδι Βιοκινδύνου'
    ],
    '⬆️': [
        'Πάνω Βέλος',
        'Βαθμολογία Βέλους Πάνω',
        'Πάνω Μαύρο Βέλος'
    ],
    '↗️': [
        'Πάνω Δεξί Βέλος',
        'Διαγώνια Πάνω Δεξιά Βέλος',
        'Βέλος Βορειοανατολικά'
    ],
    '➡️': [
        'Δεξί Βέλος',
        'Βαθμολογία Βέλους Δεξιά',
        'Μαύρο Δεξιόστροφο Βέλος'
    ],
    '↘️': [
        'Κάτω Δεξιά Βέλος',
        'Διαγώνια Κάτω Δεξιά Βέλος',
        'Βέλος Νοτιοανατολικής Ανατολής'
    ],
    '⬇️': [
        'Κάτω Βέλος',
        'Βαθμολογία Βέλους Κάτω',
        'Κάτω Μαύρο Βέλος'
    ],
    '↙️': [
        'Κάτω Αριστερά Βέλος',
        'Διαγώνια Κάτω Αριστερά Βέλος',
        'Βέλος Νοτιοδυτικού'
    ],
    '⬅️': [
        'Αριστερό Βέλος',
        'Βαθμολογία Βέλους Αριστερά',
        'Αριστερό Μαύρο Βέλος'
    ],
    '↖️': [
        'Πάνω Αριστερά Βέλος',
        'Διαγώνια Πάνω Αριστερά Βέλος',
        'Βέλος Βόρειας Δύσης'
    ],
    '↕️': [
        'Πάνω Βέλος',
        'Κατακόρυφα Βέλη',
        'Πάνω Κάτω Βέλος'
    ],
    '↔️': [
        'Αριστερό-Δεξιά Βέλος',
        'Οριζόντια Βέλη',
        'Πλευρικά Βέλη',
        'Αριστερό Δεξί Βέλος'
    ],
    '↩️': [
        'Καμπύλη Δεξιού Βέλους Αριστερά',
        'Απάντηση Email',
        'Αριστερό Κυρτό Βέλος',
        'Αριστερό βέλος με γάντζο'
    ],
    '↪️': [
        'Αριστερό Βέλος Καμπύλη Δεξιά',
        'Email Μπροστά',
        'Δεξί Κυρτό Βέλος',
        'Δεξιό βέλος με γάντζο'
    ],
    '⤴️': [
        'Καμπύλη Δεξιού Βέλους Πάνω',
        'Βέλος Που Δένει Δεξιά Μετά Καμπύλη Πάνω'
    ],
    '⤵️': [
        'Καμπύλη Δεξιού Βέλους Κάτω',
        'Κυρτό Κάτω Βέλος',
        'Βέλος Που Δένει Δεξιά Μετά Καμπύλη Προς Τα Κάτω'
    ],
    '🔃': [
        'Δεξιόστροφα Κατακόρυφα Βέλη',
        'Δεξιόστροφα προς τα κάτω και προς τα άνω βέλη ανοικτού κύκλου'
    ],
    '🔄': [
        'Κουμπί Αριστερόστροφα Βέλη',
        'Ανανέωση',
        'Περιστροφή',
        'Εναλλαγή',
        'Αριστερόστροφα Βέλη',
        'Αριστερόστροφα προς τα κάτω και προς τα πάνω ανοιχτά βέλη κύκλου'
    ],
    '🔙': [
        'Πίσω Βέλος',
        'Πίσω',
        'Πίσω με το αριστερό βέλος πάνω από'
    ],
    '🔚': [
        'Τέλος Βέλος',
        'Τέλος',
        'Τέλος με αριστερό βέλος πάνω από'
    ],
    '🔛': [
        'Ενεργό! Βέλος',
        'Ενεργό',
        'Ενεργό με Εξαιρετικό σημάδι με το αριστερό δεξί βέλος πάνω από'
    ],
    '🔜': [
        'Σύντομα Βέλος',
        'Σύντομα',
        'Σύντομα με δεξιό βέλος πάνω από'
    ],
    '🔝': [
        'Πάνω Βέλος',
        'Πάνω',
        'Πάνω με πάνω βέλος πάνω από'
    ],
    '🛐': [
        'Τόπος λατρείας',
        'Θρησκευτικό Κτίριο'
    ],
    '⚛️': ['Σύμβολο Ατόμου'],
    '🕉️': [
        'Σύμβολο OS',
        'Εμ',
        'Aumkara',
        'Omkara',
        'Pranava'
    ],
    '✡️': [
        'Αστέρι του David',
        'Magen David'
    ],
    '☸️': [
        'Τροχός του Dharma',
        'Χελμ'
    ],
    '☯️': ['Yin Yang'],
    '✝️': [
        'Λατινικός Σταυρός',
        'Χριστιανικός Σταυρός'
    ],
    '☦️': ['Ορθόδοξος Σταυρός'],
    '☪️': ['Αστέρι και ημισέληνος'],
    '☮️': [
        'Σύμβολο Ειρήνης',
        'Σημάδι Ειρήνης'
    ],
    '🕎': [
        'Menorah',
        'Candelabrum',
        'Κεριά',
        'Chanukiah',
        'Menorah',
        'Menorah με εννέα υποκαταστήματα'
    ],
    '🔯': [
        'Διάστικτο Αστέρι Με Έξι Σημεία',
        'Έξι Σημεία Αστέρι με Middle Dot'
    ],
    '♈': [
        'Κριός',
        'Zodiac'
    ],
    '♉': [
        'Taurus',
        'Zodiac'
    ],
    '♊': [
        'Gemini',
        'Zodiac'
    ],
    '♋': [
        'Καρκίνος',
        'Zodiac'
    ],
    '♌': [
        'Λέων',
        'Zodiac'
    ],
    '♍': [
        'Παρθένος',
        'Zodiac'
    ],
    '♎': [
        'Ζυγός',
        'Zodiac'
    ],
    '♏': [
        'Σκορπιός',
        'Σκορπιός',
        'Zodiac'
    ],
    '♐': [
        'Sagittarius',
        'Zodiac'
    ],
    '♑': [
        'Αιγόκερως',
        'Zodiac'
    ],
    '♒': [
        'Υδροχόος',
        'Zodiac'
    ],
    '♓': [
        'Pisces',
        'Zodiac'
    ],
    '⛎': [
        'Ophiuchus',
        'Zodiac'
    ],
    '⏭️': [
        'Μαύρο δεξιόστροφο διπλό τρίγωνο με κάθετη μπάρα',
        'Παράκαμψη Μπροστά Σύμβολο',
        'Πλήκτρο Επόμενου Κομματιού'
    ],
    '⏮️': [
        'Μαύρο αριστερό σημείο διπλό τρίγωνο με κάθετη μπάρα',
        'Παράκαμψη Συμβόλου Πίσω',
        'Κουμπί Τελευταίου Κομματιού',
        'Προηγούμενο Κομμάτι'
    ],
    '⏯️': [
        'Μαύρο δεξιόστροφο τρίγωνο με διπλό κατακόρυφο μπαρ',
        'Κουμπί αναπαραγωγής ή παύσης',
        'Σύμβολο Παιχνιδιού',
        'Σύμβολο Παύσης'
    ],
    '🔀': [
        'Κουμπί Τυχαίας Αναπαραγωγής Κομματιών',
        'Twisted Δεξιά Βέλη'
    ],
    '🔁': [
        'Κουμπί Επανάληψης',
        'Σύμβολο Βρόχου',
        'Retweet',
        'Δεξιόστροφα δεξιόστροφα και αριστερά βέλη ανοιχτού κύκλου'
    ],
    '🔂': [
        'Επανάληψη Μενού Κουμπιού',
        'Κύκλος Βέλη Με Αριθμό 1',
        'Κύκλωμα Ένα Σύμβολο',
        'Επανάληψη Συμβόλου Ενιαίου Κομματιού',
        'Δεξιόστροφα Δεξιά και Αριστερά Ανοιχτά Βέλη Κύκλου με Κύκλο Μία Επικάλυψη'
    ],
    '▶️': [
        'Κουμπί Αναπαραγωγής',
        'Δεξί Τρίγωνο',
        'Τρίγωνο Δεξιάς Σημείωσης',
        'Μαύρο Δεξιόστροφο Τρίγωνο'
    ],
    '◀️': [
        'Αντίστροφο Κουμπί',
        'Αριστερό Τρίγωνο',
        'Αριστερό Σημείο Τρίγωνο',
        'Μαύρο Αριστερό Σημείο Τρίγωνο'
    ],
    '🔼': [
        'Κουμπί Πάνω',
        'Πάνω Τρίγωνο',
        'Τριγωνικό Πάνω Σημείωμα',
        'Up-Pointing Μικρό Κόκκινο Τρίγωνο'
    ],
    '🔽': [
        'Κουμπί Προς Τα Κάτω',
        'Κάτω Τρίγωνο',
        'Τρίγωνο Κάτω Σημείων',
        'Κάτω Από Το Μικρό Κόκκινο Τρίγωνο'
    ],
    '⏩': [
        'Κουμπί Γρήγορης Προώθησης',
        'Γρήγορη Μπροστά',
        'Σύμβολο Γρήγορης Προώθησης',
        'Μαύρο Δεξιόστροφο Διπλό Τρίγωνο'
    ],
    '⏪': [
        'Fast Reverse Button',
        'Rewind',
        'Επαναφορά Συμβόλου',
        'Μαύρο Αριστερό Σημείο Διπλό Τρίγωνο'
    ],
    '⏫': [
        'Γρήγορο Κουμπί',
        'Διπλό Τρίγωνο Up-Pointing',
        'Μαύρο Up-Pointing Διπλό Τρίγωνο'
    ],
    '⏬': [
        'Γρήγορο Κάτω Κουμπί',
        'Κάτω Από Το Διπλό Τρίγωνο',
        'Μαύρο Κάθετο Διπλό Τρίγωνο'
    ],
    '⏹️': [
        'Κουμπί Διακοπής',
        'Διακοπή',
        'Σύμβολο Διακοπής',
        'Μαύρο τετράγωνο για Stop'
    ],
    '⏏️': [
        'Κουμπί Εξαγωγής',
        'Eject Symbol'
    ],
    '🎦': [
        'Κινηματογράφος',
        'Οθόνη Κινηματογράφου',
        'Ταινίες',
        'Ταινία',
        'Σύμβολο Κινηματογράφου',
        'Εγγραφή'
    ],
    '📶': [
        'Μπάρες Κεραίας',
        'Μπάρες Υποδοχής',
        'Ισχύς Σήματος',
        'Stairs',
        'Σύμβολο Δύναμης Σήματος',
        'Κεραία με Μπαρ'
    ],
    '✖️': [
        'Πολλαπλασιασμός',
        'Σύμβολο Πολλαπλασιασμού',
        'Βαρύς Πολλαπλασιασμός X'
    ],
    '➕': [
        'Συν',
        'Συν Σύμβολο',
        'Σημάδι Heavy Plus'
    ],
    '➖': [
        'Minus',
        'Minus Symbol',
        'Σημάδι Βαρέων Μικρών'
    ],
    '➗': [
        'Διαίρεση',
        'Σύμβολο Διαίρεσης',
        'Σημάδι Βαρέως Διαίρεσης'
    ],
    '♾️': [
        'Άπειρο',
        'Έγγραφο Μόνιμου Χαρτιού'
    ],
    '‼️': [
        'Διπλό Σήμα Φωνής',
        'Κόκκινο Διπλό Επισήμανση'
    ],
    '⁉️': [
        'Αναγνωριστικό Ερωτηματολογίου',
        'Κόκκινο σημάδι θαυμασμού και ερωτηματικό'
    ],
    '❓': [
        'Σήμανση Ερώτησης',
        'Κόκκινο Επισήμανση Ερωτήσεων',
        'Μαύρο Ερωτηματικό Σήμα Στολίδι'
    ],
    '❔': [
        'Λευκή Ερώτηση Σημείωση',
        'Λευκή Ερώτηση Σημείωση',
        'Λευκό Ερωτηματικό Σήμα Στολίδι'
    ],
    '❗': [
        'Αναγνωριστικό Σημείωση',
        'Κόκκινο Αναγνωριστικό',
        'Σύμβολο Σημαδιού Βαρέως Εκφρασης'
    ],
    '❕': [
        'Λευκό Επισήμανση Αναγνωριστικού',
        'Λευκό Διακήρυξη Μαρκ Στολίδι'
    ],
    '⭕': [
        'Κοίλος Κόκκινος Κύκλος',
        'Κύκλος',
        'Σωστό',
        'Κόκκινος Κύκλος',
        'Σήμα Κύκλου',
        'Βαρύς Μεγάλος Κύκλος'
    ],
    '☑️': [
        'Ελέγξτε το πλαίσιο με έλεγχο',
        'V',
        'Πλαίσιο',
        'Επιλέξτε Σημείωση Στο Πλαίσιο',
        'Κιβώτιο με έλεγχο'
    ],
    '✔️': [
        'Ελέγξτε Σημείωση',
        'V',
        'Έλεγχος',
        'Τικ',
        'Checkmark',
        'Βαρύ Σήμα Ελέγχου'
    ],
    '❌': [
        'Σταυρωτό Μαρκάρισμα',
        'Σταυρός',
        'X'
    ],
    '✅': [
        'Κουμπί Επιλογής',
        'V',
        'Σημείωση Πράσινου Ελέγχου',
        'Πράσινο Τικ',
        'Ελέγξτε Σημείωση',
        'Λευκό Βαρύ Σημάδι Ελέγχου'
    ],
    '❎': [
        'Κουμπί Σταυρού Σημείου',
        'Σταυρός',
        'X',
        'Σημείωση X',
        'Αρνητικό Τετράγωνο Σταυρό Σημάδι'
    ],
    '#️⃣': [
        'Σημάδι Αριθμού Keycap',
        '#',
        'Κλειδί Hash',
        'Ταμπλό',
        'Οκτώβριος',
        'Κλειδί Λίρας',
        'Υπογραφή Αριθμού'
    ],
    '*️⃣': [
        'Keycap Asterisk',
        'Αστέρι Keycap'
    ],
    '0️⃣': [
        'Αριθμός 0',
        'Keycap Digit Zero'
    ],
    '1️⃣': [
        'Αριθμός 1',
        'Keycap Digit One'
    ],
    '2️⃣': [
        'Αριθμός 2',
        'Πληκτρολόγιο Ψηφίο Δύο'
    ],
    '3️⃣': [
        'Αριθμός 3',
        'Πλήκτρο Ψηφίου Τρία'
    ],
    '4️⃣': [
        'Αριθμός 4',
        'Keycap Digit Τέσσερα'
    ],
    '5️⃣': [
        'Αριθμός 5',
        'Keycap Digit Πέντε'
    ],
    '6️⃣': [
        'Αριθμός 6',
        'Keycap Digit Έξι'
    ],
    '7️⃣': [
        'Αριθμός 7',
        'Keycap Digit Seven'
    ],
    '8️⃣': [
        'Αριθμός 8',
        'Keycap Digit Οκτώ'
    ],
    '9️⃣': [
        'Αριθμός 09',
        'Keycap Digit Εννέα'
    ],
    '🔟': [
        'Αριθμός 10',
        'Keycap: 10',
        '10',
        'Keycap Digit Δέκα'
    ],
    '🔠': [
        'Input Latin Uppercase',
        'ABCD',
        'Κεφαλαία',
        'Σύμβολο εισαγωγής για κεφαλαία γράμματα',
        'Σύμβολο εισόδου για γράμματα λατινικής πρωτεύουσας'
    ],
    '🔡': [
        'Input Latin Lowercase',
        'αβγδ',
        'Πεζά',
        'Σύμβολο εισόδου για πεζά γράμματα',
        'Σύμβολο εισόδου για τα λατινικά μικρά γράμματα'
    ],
    '🔢': [
        'Input Numbers',
        '1234',
        'Αριθμοί',
        'Numeric Input',
        'Σύμβολο εισόδου για αριθμούς'
    ],
    '🔣': [
        'Σύμβολο εισόδου για σύμβολα',
        'Σύμβολα',
        'Είσοδος Συμβόλου'
    ],
    '🔤': [
        'Input Latin Letters',
        'αβγ',
        'Αλφάβητο',
        'Γράμματα',
        'Σύμβολο εισόδου για γράμματα',
        'Σύμβολο εισόδου για τα λατινικά γράμματα'
    ],
    '🅰️': [
        'Ένα Κουμπί (Τύπος Blood)',
        'Τύπος Αίματος Α',
        'Γράμμα A',
        'Αρνητική Τετραγωνισμένη Λατινική Πρωτεύουσα Γράμμα A'
    ],
    '🆎': [
        'Κουμπί AB (τύπος πλημμύρας)',
        'Γράμματα AB',
        'Τύπος Αίματος AB',
        'Αρνητική Τετραγωνική ΑΒ'
    ],
    '🅱️': [
        'Κουμπί B (Τύπος Blood)',
        'Γράμμα B',
        'Τύπος Αίματος Β',
        'Αρνητική Τετραγωνισμένη Λατινική Πρωτεύουσα Γράμμα B'
    ],
    '🆑': [
        'Κουμπί CL',
        'Εκκαθάριση',
        'Πλήκτρο Καθαρισμού',
        'Σημάδι CL',
        'Τετράγωνο CL',
        'Γράμματα CL'
    ],
    '🆒': [
        'Κουμπί Ψυχρό',
        'Ψυχρό Τετράγωνο',
        'Πινακίδα Ψυχρής',
        'Τετράγωνο Δροσερό'
    ],
    '🆓': [
        'Πλήκτρο Ελεύθερο',
        'Δωρεάν',
        'Δωρεάν Υπογραφή',
        'Τετράγωνο Ελεύθερο'
    ],
    'ℹ️': [
        'Πληροφορίες',
        'Πληροφορίες',
        'Πεζά Ι',
        'Τουριστικές Πληροφορίες',
        'Πηγή Πληροφοριών'
    ],
    '🆔': [
        'Κουμπί ID',
        'ID',
        'Ταυτοποίηση',
        'Σημάδι Αναγνώρισης',
        'Τετράγωνο Id'
    ],
    '🆕': [
        'Νέο Κουμπί',
        'Νέο',
        'Νέα Πινακίδα',
        'Τετράγωνο Νέο'
    ],
    '🅾️': [
        'Κουμπί O (Τύπος Blood)',
        'Τύπος Αίματος O',
        '0',
        'Αρνητική Τετραγωνισμένη Λατινική Πρωτεύουσα Επιστολή',
        'Γράμμα O'
    ],
    '🆗': [
        'Πλήκτρο OK',
        'Εντάξει',
        'Εντάξει',
        'Τετράγωνο',
        'Σημάδι OK',
        'Τετράγωνο Εντάξει'
    ],
    '🅿️': [
        'Κουμπί P',
        'Σημάδι Στάθμευσης',
        'Αρνητική Τετραγωνισμένη Λατινική Πρωτεύουσα Επιστολή',
        'Γράμμα P'
    ],
    '🆘': [
        'Κουμπί SOS',
        'Σήμα Επίδρασης',
        'Έκτακτη ανάγκη',
        'SOS',
        'Σημάδι SOS',
        'Τετράγωνο SOS',
        'Βοήθεια'
    ],
    '🆙': [
        'Κουμπί Πάνω!',
        'Ανανέωση Επιπέδου',
        'Επάνω',
        'Επάνω Εγγραφή',
        'Τετράγωνο επάνω με ένδειξη θαυμασμού'
    ],
    '🆚': [
        'Κουμπί VS',
        'Τετράγωνο Vs'
    ],
    '🆖': [
        'Πλήκτρο NG',
        'Τετράγωνο NG',
        'Καμία Καλή Σημάδια',
        'Όχι Καλό',
        'NG',
        'Blooper'
    ],
    '🔴': [
        'Κόκκινος Κύκλος',
        'Μεγάλος Κόκκινος Κύκλος'
    ],
    '🟠': [
        'Πορτοκαλί Κύκλος',
        'Μεγάλος Πορτοκαλί Κύκλος'
    ],
    '🟡': [
        'Κίτρινος Κύκλος',
        'Μεγάλος Κίτρινος Κύκλος'
    ],
    '🟢': [
        'Πράσινος Κύκλος',
        'Μεγάλος Πράσινος Κύκλος'
    ],
    '🔵': [
        'Μπλε Κύκλος',
        'Μεγάλος Μπλε Κύκλος'
    ],
    '🟣': [
        'Μωβ Κύκλος',
        'Μεγάλος Μοβ Κύκλος'
    ],
    '🟤': [
        'Καφέ Κύκλος',
        'Μεγάλος Καφέ Κύκλος'
    ],
    '⚫': [
        'Μαύρος Κύκλος',
        'Μεσαίος Μαύρος Κύκλος'
    ],
    '⚪': [
        'Λευκός Κύκλος',
        'Μεσαίος Λευκός Κύκλος'
    ],
    '🟥': [
        'Κόκκινη Τετράγωνη',
        'Μεγάλη Κόκκινη Πλατεία'
    ],
    '🟧': [
        'Πορτοκαλί Τετράγωνο',
        'Μεγάλο Πορτοκαλί Τετράγωνο'
    ],
    '🟨': [
        'Κίτρινο Τετράγωνο',
        'Μεγάλο Κίτρινο Τετράγωνο'
    ],
    '🟩': [
        'Πράσινο Τετράγωνο',
        'Μεγάλο Πράσινο Τετράγωνο'
    ],
    '🟦': [
        'Μπλε Τετράγωνο',
        'Μεγάλο Μπλε Τετράγωνο'
    ],
    '🟪': [
        'Μωβ Τετράγωνο',
        'Μεγάλο Μωβ Τετράγωνο'
    ],
    '🟫': [
        'Καφέ Τετράγωνο',
        'Μεγάλο Καφέ Τετράγωνο'
    ],
    '⬛': ['Μαύρο Μεγάλο Τετράγωνο'],
    '⬜': ['Λευκό Μεγάλο Τετράγωνο'],
    '◼️': ['Μαύρο Μεσαίο Τετράγωνο'],
    '◻️': ['Λευκό Μεσαίο Τετράγωνο'],
    '◾': ['Μαύρο Μεσαίο Μικρό Τετράγωνο'],
    '◽': ['Λευκό Μεσαίο Μικρό Τετράγωνο'],
    '▪️': ['Μαύρο Μικρό Τετράγωνο'],
    '▫️': ['Λευκό Μικρό Τετράγωνο'],
    '💠': [
        'Διαμαντένιο σχήμα με ένα τελείωμα μέσα',
        'Χωρητικότητα',
        'Διαμάντι Λουλούδι',
        'Χαβάη'
    ],
    '🔶': ['Μεγάλο Πορτοκαλί Διαμάντι'],
    '🔷': ['Μεγάλο Μπλε Διαμάντι'],
    '🔸': ['Μικρό Πορτοκαλί Διαμάντι'],
    '🔹': ['Μικρό Μπλε Διαμάντι'],
    '🔺': [
        'Κόκκινο Τρίγωνο Επισήμανση Πάνω',
        'Κόκκινο Τρίγωνο Up-Pointing'
    ],
    '🔻': [
        'Κόκκινο Τρίγωνο Επισήμανση Κάτω',
        'Κόκκινο Τρίγωνο Κατεύθυνσης'
    ],
    '🔳': ['Κουμπί Λευκού Τετράγωνου'],
    '🔲': ['Μαύρο Τετραγωνικό Κουμπί'],
    '©️': [
        'Πνευματικά δικαιώματα',
        'Σημάδι Πνευματικών Δικαιωμάτων'
    ],
    '®️': [
        'Εγγεγραμμένος',
        'Εγγεγραμμένη Πινακίδα'
    ],
    '™️': [
        'Εμπορικό Σήμα',
        'ΜΜ',
        'Εμπορικό Σήμα',
        'Σημάδι Εμπορικού Σημείου'
    ],
    '🛅': [
        'Αριστερές Αποσκευές',
        'Τσάντα Με Κλειδί',
        'Κλειδωμένη Βαλίτσα'
    ],
    '🛄': ['Διεκδίκηση Αποσκευών'],
    '🛃': ['Τελωνεία'],
    '🛂': [
        'Έλεγχος Διαβατηρίου',
        'Έλεγχος Περιγράμματος'
    ],
    '🚰': [
        'Σύμβολο Πόσιμου Νερού',
        'Δίψα',
        'Δίψα',
        'Βρύση Νερού',
        'Στρόφιγγα Νερού'
    ],
    '🇦': [
        'Γράμμα A',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Α'
    ],
    '🇧': [
        'Γράμμα B',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Β'
    ],
    '🇨': [
        'Γράμμα Γ',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Γ'
    ],
    '🇩': [
        'Γράμμα D',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Δ'
    ],
    '🇪': [
        'Γράμμα E',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα E'
    ],
    '🇫': [
        'Γράμμα F',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα F'
    ],
    '🇬': [
        'Γράμμα G',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα G'
    ],
    '🇭': [
        'Γράμμα H',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα H'
    ],
    '🇮': [
        'Γράμμα I',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα I'
    ],
    '🇯': [
        'Γράμμα J',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα J'
    ],
    '🇰': [
        'Γράμμα Κ',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα K'
    ],
    '🇱': [
        'Γράμμα L',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα L'
    ],
    '🇲': [
        'Γράμμα M',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα M'
    ],
    '🇳': [
        'Γράμμα N',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα N'
    ],
    '🇴': [
        'Γράμμα O',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα O'
    ],
    '🇵': [
        'Γράμμα P',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα P'
    ],
    '🇶': [
        'Γράμμα Q',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Q'
    ],
    '🇷': [
        'Γράμμα R',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα R'
    ],
    '🇸': [
        'Γράμμα S',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα S'
    ],
    '🇹': [
        'Γράμμα T',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα T'
    ],
    '🇺': [
        'Γράμμα U',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα U'
    ],
    '🇻': [
        'Γράμμα V',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα V'
    ],
    '🇼': [
        'Γράμμα W',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα W'
    ],
    '🇽': [
        'Γράμμα X',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα X'
    ],
    '🇾': [
        'Γράμμα Y',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Y'
    ],
    '🇿': [
        'Γράμμα Z',
        'Περιφερειακός Δείκτης Σύμβολο Γράμμα Z'
    ],
    '💌': [
        'Γράμμα Αγάπης',
        'Φάκελος Καρδιά',
        'Σημείωση Αγάπης'
    ],
    '🚮': [
        'Βάλτε Litter στο σύμβολο θέση του',
        'Πεταλούδα στο δοχείο',
        'Βάλτε Τον Κάδο Απορριμμάτων',
        'Άτομο Με Κάδο Απορριμμάτων'
    ],
    '♿': [
        'Σύμβολο Αναπηρικής Καρέκλας',
        'Προσβάσιμο Μπάνιο'
    ],
    '🚹': [
        'Σύμβολο Ανδρών',
        'Ανδρικό Σύμβολο',
        'Ανδρική Τουαλέτα',
        'Ανδρική Μετεωρολογία',
        'Αρσενικό WC'
    ],
    '🚺': [
        'Σύμβολο Γυναικών',
        'Σύμβολο Γυναικών',
        'Γυναικεία Τουαλέτα',
        'Γυναικεία Restroom',
        'Famale WC'
    ],
    '🚻': [
        'Restroom',
        'Εγγραφή Μπάνιου',
        'Σημάδι Τουαλέτα',
        'Σημάδι WC'
    ],
    '🚼': [
        'Σύμβολο Μωρού',
        'Μωρό Αλλαγή Σταθμός',
        'Σύμβολο Αλλαγής Μωρού',
        'Φυτώριο'
    ],
    '🚾': [
        'Ντουλάπα Νερού',
        'WC',
        'WC Τουαλέτα'
    ],
    '⚠️': [
        'Προειδοποιητική Σημείωση',
        'Σύμβολο Ειδοποίησης'
    ],
    '🚸': [
        'Παιδιά Διασχίζοντας',
        'Διέλευση Παιδιών',
        'Σχολική Διασταύρωση'
    ],
    '🔅': [
        'Σύμβολο Χαμηλής Φωτεινότητας',
        'Πλήκτρο Dim',
        'Μείωση Φωτεινότητας'
    ],
    '🔆': [
        'Σύμβολο Υψηλής Φωτεινότητας',
        'Αύξηση Φωτεινότητας',
        'Φωτεινό Κουμπί'
    ],
    '📳': [
        'Λειτουργία Δόνησης',
        'Καρδιά Τηλεφώνου',
        'Λειτουργία Αθόρυβου'
    ],
    '📴': ['Κινητό Τηλέφωνο Ανενεργό'],
    '〰️': [
        'Κύμα',
        'Κυματιστή Παύλα'
    ],
    '💱': ['Ανταλλαγή Συναλλάγματος'],
    '💲': [
        'Βαρύ Δολλάριο',
        'Δολάριο',
        'Σύμβολο Δολαρίου'
    ],
    '♻️': [
        'Μαύρο Καθολική Ανακύκλωση Σύμβολο',
        'Σύμβολο Ανακύκλωσης',
        'Λογότυπο Ανακύκλωσης'
    ],
    '🔱': [
        'Εμβλήμα Της Παρέμβασης',
        'Pitchfork',
        'Trident'
    ],
    '📛': [
        'Σήμα Ονόματος',
        'Tofu Στη Φωτιά',
        'Ετικέτα Ονόματος',
        'Ετικέτα Φωτιάς'
    ],
    '🔰': [
        'Ιαπωνικό σύμβολο για αρχάριους',
        'Shoshinsha Mark',
        'Κίτρινη Πράσινη Ασπίδα'
    ],
    '➰': [
        'Σγουρό Κύκλωμα',
        'Κύκλωμα Curling',
        'Επανάληψη'
    ],
    '➿': [
        'Διπλό Σγουρό Βρόχο',
        'Διπλό Κύκλωμα Curling',
        'Τηλεφωνητής'
    ],
    '〽️': [
        'Σημείωση Εναλλακτικού Μέρους',
        'Μ',
        'McDonald\'s'
    ],
    '✳️': ['Οκτώ Spoked Asterisk'],
    '✴️': [
        'Οκτώ Επισημασμένο Μαύρο Αστέρι',
        'Πορτοκαλί Αστέρι',
        'Οκτώ Σημεία Αστέρι'
    ],
    '❇️': ['Σπινθήρας'],
    'Ⓜ️': [
        'Κύκλωμα Λατινικής Πρωτεύουσας Γράμμα M',
        'Κύκλωμα M',
        'Μετρό',
        'Κύκλωμα M'
    ],
    '🈁': [
        'Squared Katakana Koko',
        'Ιαπωνικά Σημείωση Λέξης Εδώ',
        'Εδώ',
        'Προορισμός'
    ],
    '🈂️': [
        'Squared Katakana Sa',
        'Ιαπωνική Υπηρεσία Σημασίας ή Υπηρεσία Χρέωσης'
    ],
    '🈷️': [
        'Τετράγωνη Ενοποιημένη Ιδεογραφία-6708 Cjk',
        'Ριζοσπαστικό 74',
        '月',
        'Ιαπωνική Σημασία Μηνιαίο Ποσό'
    ],
    '🈶': [
        'Τετράγωνη Ενοποιημένη Ιδεογραφία-6709 Cjk',
        'Ιαπωνικό σημάδι σημαίνει δεν είναι δωρεάν',
        'Ίδια',
        '有'
    ],
    '🈯': [
        'Τετράγωνη Ενοποιημένη Ιδεογραφία-6307 Cjk',
        'Ιαπωνική Σημασία Αποκλεισμένος',
        'Σημείο Δακτυλίου',
        '指'
    ],
    '🉐': [
        'Πλεονέκτημα Κυκλικού Ιδεογράφου',
        'Ιαπωνικά Σημασία Συναίνεση',
        'Απόκτηση',
        '得'
    ],
    '🈹': [
        'Τετράγωνο Cjk Ενοποιημένη Ιδεογραφία-5272',
        'Ιαπωνική Νοηματική Έννοια Έκπτωση',
        'Πώληση Οικονομίας',
        '割'
    ],
    '🈚': [
        'Τετράγωνο Cjk Ενοποιημένη Ιδεογραφία-7121',
        'Ιαπωνικό σημάδι σημαίνει χωρίς χρέωση',
        'Έλλειψη',
        '無'
    ],
    '🈲': [
        'Τετράγωνο Cjk Ενοποιημένη Ιδεογραφία-7981',
        'Απαγορεύεται Η Ιάπωνη Σημασία Σηματοδοσίας',
        'Forbid',
        '禁'
    ],
    '🉑': [
        'Αποδοχή Κυκλικού Ιδεογράφου',
        'Ιαπωνικά Σημαίνει Αποδεκτή',
        'Αποδοχή'
    ],
    '🈸': [
        'Τετράγωνη Ενοποιημένη Ιδεογραφία-7533 Cjk',
        'Ιαπωνική Νοηματική Έννοια Εφαρμογή',
        'Φόρμα Εφαρμογής',
        'Μαϊμού',
        'Αίτημα',
        '申'
    ],
    '🈴': [
        'Τετράγωνο Cjk Ενοποιημένη Ιδεογραφία-5408',
        'Ιαπωνική Σημασία Περνώντας (Βαθμός)',
        'Συμφωνία',
        '合'
    ],
    '🈳': [
        'Τετράγωνο CJK Ενοποιημένη Ιδεογραφία-7a7a',
        'Ιαπωνικά Σημαίνει Vacancy',
        'Κενό και διαθέσιμο',
        '空'
    ],
    '㊗️': [
        'Ευθυγράμμιση Κυκλωμένου Ιδεογράφου',
        'Ιαπωνικά Σημασία Συγχαρητήρια'
    ],
    '㊙️': [
        'Μυστικό Κυκλικού Ιδεογράφου',
        'Ιαπωνικά Σημαίνει Μυστικό',
        'Μυστικό'
    ],
    '🈺': [
        'Τετράγωνο Cjk Ενοποιημένη Ιδεογραφία-55b6',
        'Ιαπωνικό σημάδι σημαίνει ανοικτή για επιχειρήσεις',
        'Εργασία',
        '営'
    ],
    '🈵': [
        'Τετράγωνη Ενοποιημένη Ιδεογραφία-6e80 Cjk',
        'Ιαπωνικά Σημαίνει Πλήρης; Όχι Vacancy',
        'Πλήρης',
        '満'
    ],
    '🔘': ['Κουμπί Επιλογής'],
    '🛑': [
        'Διακοπή Υπογραφής',
        'Οκτάγωνη Πινακίδα'
    ],
    '⚕️': [
        'Ιατρικό Σύμβολο',
        'Aesculapius',
        'Asklepios',
        'Ράβδος του Ασκληπιού',
        'Προσωπικό του Aesculapius'
    ],
    '🛗': [
        'Ανελκυστήρας',
        'Ανύψωση'
    ],
    '⚧️': ['Σύμβολο Transgender'],
    '♂️': [
        'Αρσενικό Υπογραφή',
        'Σύμβολο Ανθρώπου',
        'Σύμβολο Άρη'
    ],
    '♀️': [
        'Θηλυκό Πινακίδα',
        'Σύμβολο Γυναίκας',
        'Venus Symbol'
    ]
};
/*food and drinks*/
emojis_language[lang][6] = {
    '🍇': [
        'Σταφύλια',
        'Σταφύλι'
    ],
    '🍈': [
        'Πεπόνι',
        'Cantaloupe',
        'Honeydew',
        'Καρπούζι'
    ],
    '🍉': ['Καρπούζι'],
    '🍊': [
        'Tangerine',
        'Mandarin',
        'Πορτοκαλί'
    ],
    '🍋': [
        'Λεμόνι',
        'Λεμονάδα'
    ],
    '🍌': [
        'Μπανάνα',
        'Πλανήτης'
    ],
    '🍍': ['Ανανάς'],
    '🥭': ['Mango'],
    '🍎': [
        'Κόκκινο Μήλο',
        'Κόκκινο Νόστιμο Μήλο'
    ],
    '🍏': [
        'Πράσινο Μήλο',
        'Χρυσό Νόστιμο Μήλο',
        'Γιαγιά Smith Apple'
    ],
    '🍐': ['Αχλάδι'],
    '🍑': [
        'Ροδάκινο',
        'Κάτω',
        'Πλήκτρο'
    ],
    '🍒': [
        'Κεράσια',
        'Κεράσι',
        'Άγρια Κεράσι'
    ],
    '🍓': ['Φράουλα'],
    '🥝': [
        'Ακτινίδια',
        'Κινέζικο Φραγκοστάφυλο',
        'Ακτινίδια',
        'Ακτινίδια'
    ],
    '🍅': ['Ντομάτα'],
    '🥥': [
        'Καρύδα',
        'Cocoanut'
    ],
    '🥑': ['Αβοκάντο'],
    '🍆': [
        'Μελιτζάνα',
        'Aubergine',
        'Φαλικό',
        'Μωβ Λαχανικά'
    ],
    '🥔': [
        'Πατάτες',
        'Ψημένη Πατάτα',
        'Πατάτα Του Αϊντάχο'
    ],
    '🥕': ['Καρότο'],
    '🌽': [
        'Αυτί καλαμποκιού',
        'Καλαμπόκι',
        'Καλαμπόκι Στο Cob',
        'Καλαμπόκι',
        'Αυτί του αραβοσίτου'
    ],
    '🌶️': [
        'Ζεστό Πιπέρι',
        'Πιπέρι Τσίλι',
        'Πικάντικο'
    ],
    '🥒': [
        'Αγγούρια',
        'Γκερκίνη',
        'Δέσιμο'
    ],
    '🥬': [
        'Φυλλάδιο Πράσινο',
        'Bok Choy',
        'Κινέζικο Λάχανο',
        'Cos Lettuce',
        'Μαρούλι Romaine',
        'Φυλλώδη Πράσινα'
    ],
    '🥦': ['Μπρόκολα'],
    '🍄': [
        'Μανιτάρι',
        'Νεροκάρδαμο',
        'Toadstool'
    ],
    '🥜': [
        'Peanuts',
        'Καρποί'
    ],
    '🌰': [
        'Κάστανα',
        'Βελανίδι',
        'Καρύδα'
    ],
    '🍞': [
        'Ψωμί',
        'Κύπελλο Ψωμιού'
    ],
    '🥐': ['Croissant'],
    '🥖': [
        'Ψωμί Μπαγκέτα',
        'Γαλλικό Ψωμί',
        'Μπαγκέτα'
    ],
    '🥨': ['Pretzel'],
    '🥯': ['Bagel'],
    '🥞': [
        'Τηγανίτες',
        'Crepes',
        'Χοτάκια'
    ],
    '🧀': [
        'Σφήνα Τυριού',
        'Τυρί'
    ],
    '🍖': [
        'Κρέας στα οστά',
        'BBQ',
        'Μπάρμπεκιου',
        'Κρέας Μάνγκα'
    ],
    '🍗': [
        'Poultry Leg',
        'Κρεβάτι',
        'Πόδι Τουρκίας'
    ],
    '🥩': [
        'Κόψτε το κρέας',
        'Κρέας',
        'Μπριζόλα'
    ],
    '🥓': [
        'Μπέικον',
        'Rashers'
    ],
    '🍔': [
        'Χάμπουργκερ',
        'Μπέργκερ',
        'Cheeseburger'
    ],
    '🍟': [
        'Γαλλικές Τηγανίτες',
        'Μάρκες',
        'Τηγανητές',
        'Τηγανίτες McDonald\'s'
    ],
    '🍕': [
        'Πίτσα',
        'Pepperoni Πίτσα',
        'Φέτα πίτσας'
    ],
    '🌭': [
        'Ζεστό Σκύλος',
        'Hotdog',
        'Λουκάνικο'
    ],
    '🥪': ['Σάντουιτς'],
    '🌮': ['Taco'],
    '🌯': [
        'Burrito',
        'Αναδίπλωση'
    ],
    '🥙': [
        'Γεμιστό Flatbread',
        'Doner Kebab',
        'Gyro',
        'Σατσέα',
        'Pita Sandwich'
    ],
    '🍳': [
        'Μαγειρική',
        'Πρωινό',
        'Τηγανητό Αυγό',
        'Τηγάνι Pan'
    ],
    '🥘': [
        'Ακατέργαστο τηγάνι των τροφίμων',
        'Paella',
        'Pan του φαγητού'
    ],
    '🍲': [
        'Δοχείο των τροφίμων',
        'Μπολ Τροφίμων',
        'Σούπα',
        'Στιφάδο'
    ],
    '🥣': [
        'Μπολ με κουτάλι',
        'Μπολ Δημητριακών'
    ],
    '🥗': [
        'Πράσινη Σαλάτα',
        'Σαλάτα'
    ],
    '🍿': [
        'Ποπκόρν',
        'Αναδυόμενο Καλαμπόκι'
    ],
    '🧂': [
        'Αλάτι',
        'Αλάτι Shaker'
    ],
    '🥫': [
        'Κονσερβοποιημένα Τρόφιμα',
        'Μπορεί από τρόφιμα',
        'Κονσέρβα Κασσίτερου',
        'Επικασσιτερωμένα Τρόφιμα'
    ],
    '🍱': [
        'Κιβώτιο Bento',
        'Μεσημεριανό Κουτί'
    ],
    '🍘': [
        'Πυροκροτητής Ρύζι',
        'Ρυθμιστής'
    ],
    '🍙': [
        'Μπάλα Ρύζι',
        'Onigiri'
    ],
    '🍚': [
        'Μαγειρεμένο Ρύζι',
        'Βρασμένο Ρύζι',
        'Ρύζι',
        'Μπολ Ρύζι',
        'Ρύζι Με Ατμό'
    ],
    '🍛': [
        'Ρύζι Curry',
        'Curry',
        'Ινδικά Τρόφιμα',
        'Curry και Ρύζι'
    ],
    '🍜': [
        'Μπολ Ατμού',
        'Νούγιες',
        'Νούγιες Με Μοσχάρια',
        'Ramen'
    ],
    '🍝': [
        'Spaghetti',
        'Ζυμαρικά'
    ],
    '🍠': [
        'Ψητό Γλυκό Πατάτα',
        'Γλυκά Πατάτα',
        'Yam'
    ],
    '🍢': [
        'Oden',
        'Kebab',
        'Σκάβες'
    ],
    '🍣': [
        'Σούσι',
        'Sashimi',
        'Θαλασσινά'
    ],
    '🍤': [
        'Τηγανητές Γαρίδες',
        'Τηγανητή Γαρίδα',
        'Tempura Γαρίδες'
    ],
    '🍥': [
        'Κέικ ψαριών με στροβιλισμό',
        'Πίτα',
        'Pink Swirl'
    ],
    '🥮': [
        'Κέικ Σελήνης',
        'Mooncake'
    ],
    '🍡': [
        'Dango',
        'Επιδόρπιο Ραβδί',
        'Ροζ Λευκό Πράσινο Μπάλες'
    ],
    '🥟': [
        'Dumpling',
        'Empanada',
        'Pierogi'
    ],
    '🥠': ['Fortune Cookie'],
    '🥡': [
        'Πλαίσιο Απογείωσης',
        'Κινεζικό Κουτί Τροφίμων',
        'Oyster Pail'
    ],
    '🍦': [
        'Μαλακό Παγωτό',
        'Whippy',
        'Απαλό Σερβίρισμα'
    ],
    '🍧': [
        'Ξυρισμένος Πάγος',
        'Κόμβος Χιονιού'
    ],
    '🍨': [
        'Παγωτό',
        'Κύπελλο Παγωτού',
        'Επιδόρπιο'
    ],
    '🍩': [
        'Ντόνατ',
        'Donut'
    ],
    '🍪': [
        'Cookie',
        'Μπισκότο',
        'Σοκολάτα Μπισκότα Chip'
    ],
    '🎂': [
        'Κέικ Γενεθλίων',
        'Γενέθλια',
        'Κέικ',
        'Κέικ Με Κεριά'
    ],
    '🍰': [
        'Σκόρδο',
        'Κέικ',
        'Κομμάτι Κέικ',
        'Φράουλα Κέικ'
    ],
    '🧁': [
        'Κύπελλο',
        'Γαλακτοκομικό Κέικ'
    ],
    '🥧': ['Πίτα'],
    '🍫': [
        'Μπάρα Σοκολάτας',
        'Μπάρα Καραμέλας',
        'Σοκολάτα'
    ],
    '🍬': [
        'Καραμέλα',
        'Lolly',
        'Γλυκό'
    ],
    '🍭': [
        'Lollipop',
        'Κορίτσι'
    ],
    '🍮': [
        'Κρέμα',
        'Creme Caramel',
        'Επιδόρπιο',
        'Φλόγα',
        'Πουτίγκα'
    ],
    '🍯': [
        'Μέλι Δοχείο',
        'Μέλι',
        'Δοχείο'
    ],
    '🍼': [
        'Μπουκάλι Μωρό',
        'Διατροφή Φιάλης'
    ],
    '🥛': [
        'Γυαλί από γάλα',
        'Γάλα'
    ],
    '☕': [
        'Ζεστό Ποτό',
        'Καφές',
        'Espresso',
        'Ζεστή Σοκολάτα',
        'Τσάι'
    ],
    '🍵': [
        'Teacup Χωρίς Λαβή',
        'Πράσινο Τσάι',
        'Matcha',
        'Matcha Πράσινο Τσάι'
    ],
    '🍶': [
        'Sake',
        'Φιάλη',
        'Κρασί Ρύζι',
        'Μπουκάλι και κύπελλο Sake'
    ],
    '🍾': [
        'Μπουκάλι με Φελλό Popping',
        'Εορτασμός',
        'Champagne',
        'Αφρώδης Οίνος'
    ],
    '🍷': [
        'Γυαλί Κρασιού',
        'Αλκοόλ',
        'Κόκκινος Οίνος',
        'Οίνος'
    ],
    '🍸': [
        'Κοκτέιλ Γυαλί',
        'Κοκτέιλ',
        'Μαρτίνι'
    ],
    '🍹': [
        'Τροπικό Ποτό',
        'Φρούτα Punch',
        'Tiki Ποτό'
    ],
    '🍺': [
        'Κούπα Μπύρας',
        'Μπύρα',
        'Μπύρα Stein'
    ],
    '🍻': [
        'Καλλυντικές Κούπες Μπύρας',
        'Μπύρες',
        'Επαφές'
    ],
    '🥂': [
        'Γυαλιά Ψεκασμού',
        'Εορτασμός',
        'Γυαλιά Σαμπάνιας',
        'Επαφές'
    ],
    '🥃': [
        'Γυαλί Tumbler',
        'Βουρβώνιο',
        'Υγρός',
        'Rum',
        'Ουίσκι',
        'Whisky'
    ],
    '🥤': [
        'Κύπελλο με Straw',
        'Milkshake',
        'Smoothie',
        'Ποπ Σόδας',
        'Απαλό Ποτό'
    ],
    '🥢': ['Μοσχοκάρυδα'],
    '🍽️': [
        'Πιρούνι και μαχαίρι με πλάκα',
        'Δείπνο'
    ],
    '🍴': [
        'Πηρούνι και μαχαίρι',
        'Μαχαιροπήρουνα',
        'Μαχαίρι Και Πηρούνι',
        'Silverware'
    ],
    '🥄': ['Κουτάλι'],
    '🧄': ['Σκόρδα'],
    '🧅': ['Κρεμμύδι'],
    '🧇': ['Waffle'],
    '🧆': ['Falafel'],
    '🧈': ['Βούτυρο'],
    '🦪': ['Στρείδι'],
    '🧃': [
        'Κιβώτιο Ποτών',
        'Κιβώτιο Χυμού'
    ],
    '🧉': [
        'Ματ Ποτό',
        'Chimarraśo',
        'Cimarrón',
        'Ματ Yerba'
    ],
    '🫒': ['Ελιές'],
    '🫐': ['Μύρτιλλα'],
    '🫑': ['Κουδούνι Πιπέρι'],
    '🫓': ['Πλατύψωμο'],
    '🫔': [
        'Tamale',
        'Tamal'
    ],
    '🫕': ['Fondue'],
    '🧋': [
        'Τσάι Φούσκα',
        'Boba'
    ],
    '🧊': ['Κύβος Πάγου']
};
/*flags*/
emojis_language[lang][7] = {
    '🏁': [
        'Σημαία Chequered',
        'Σημαία Καρό',
        'Κορίτσι Πλέγματος',
        'Αγωνιστική Σημαία'
    ],
    '🚩': [
        'Τριγωνική Σημαία',
        'Σημαία στον Πολωνό',
        'Κόκκινη Σημαία',
        'Τριγωνική σημαία κατά την ανάρτηση'
    ],
    '🎌': [
        'Διασχισμένες Σημαίες',
        'Δύο Σημαίες'
    ],
    '🏴': [
        'Σημαία Μαύρης',
        'Κυματίζει Μαύρη Σημαία'
    ],
    '🏳️': [
        'Σημαία Του Λευκού',
        'Κυματίζει Λευκή Σημαία'
    ],
    '🏳️‍🌈': [
        'Σημαία Ουράνιο Τόξο',
        'Pride Flag'
    ],
    '🏳️‍⚧️': [
        'Σημαία Transgender',
        'Μπλε, ροζ, και άσπρη σημαία',
        'Σημαία Trans'
    ],
    '🏴‍☠️': [
        'Σημαία Πειρατών',
        'Jolly Roger'
    ],
    '🇺🇳': [
        'Σημαία των Ηνωμένων Εθνών',
        'UN',
        'Σημαία: Ηνωμένα Έθνη'
    ],
    '🇪🇺': [
        'Σημαία της Ευρωπαϊκής Ένωσης',
        'EU',
        'Σημαία: Ευρωπαϊκή Ένωση',
        'EU Flag'
    ],
    '🇦🇨': [
        'Σημαία του νησιού',
        'AC'
    ],
    '🇦🇩': [
        'Σημαία της Ανδόρας',
        'AD',
        'Andorran Flag'
    ],
    '🇦🇪': [
        'Σημαία Ηνωμένων Αραβικών Εμιράτων',
        'AE',
        'Emirati Flag',
        'Σημαία Των ΗΑΕ'
    ],
    '🇦🇫': [
        'Σημαία του Αφγανιστάν',
        'AF',
        'Afghan Flag'
    ],
    '🇦🇬': [
        'Σημαία της Αντίγκουα και Μπαρμπούντα',
        'AG'
    ],
    '🇦🇮': [
        'Σημαία της Ανγκουίλα',
        'AI',
        'Σημαία Ανγκουιλάν'
    ],
    '🇦🇱': [
        'Σημαία της Αλβανίας',
        'AL',
        'Σημαία Αλβανίας'
    ],
    '🇦🇲': [
        'Σημαία της Αρμενίας',
        'ΠΜ',
        '🇦🇲'
    ],
    '🇦🇴': [
        'Σημαία της Αγκόλας',
        'AO',
        'Σημαία Αγκόλας'
    ],
    '🇦🇶': [
        'Σημαία της Ανταρκτικής',
        'AQ',
        'Σημαία Ανταρκτικής'
    ],
    '🇦🇷': [
        'Σημαία της Αργεντινής',
        'AR',
        'Σημαία Αργεντινής'
    ],
    '🇦🇸': [
        'Σημαία της Αμερικανικής Σαμόα',
        'AS',
        'American Samoan Flag'
    ],
    '🇦🇹': [
        'Σημαία της Αυστρίας',
        'AT',
        'Austrian Flag'
    ],
    '🇦🇺': [
        'Σημαία της Αυστραλίας',
        'AU',
        'Σημαία Aussie',
        'Σημαία Αυστραλίας'
    ],
    '🇦🇼': [
        'Σημαία της Αρούμπα',
        'AW',
        'Σημαία Αρούμπα'
    ],
    '🇦🇽': [
        'Σημαία των Νήσων Aland',
        'AX',
        'Σημαία Αλονίας'
    ],
    '🇦🇿': [
        'Σημαία του Αζερμπαϊτζάν',
        'AZ',
        'Σημαία Αζερμπαϊτζάν'
    ],
    '🇧🇦': [
        'Σημαία της Βοσνίας-Ερζεγοβίνης',
        'BA'
    ],
    '🇧🇧': [
        'Σημαία του Μπαρμπάντος',
        'BB',
        'Σημαία Μπαρμπάντος',
        'Σημαία Μπαϊάν'
    ],
    '🇧🇩': [
        'Σημαία του Μπαγκλαντές',
        'BD',
        'Bangladeshi Flag'
    ],
    '🇧🇪': [
        'Σημαία του Βελγίου',
        'BE',
        'Σημαία Βελγίου'
    ],
    '🇧🇫': [
        'Σημαία της Μπουρκίνα Φάσο',
        'BF',
        'Σημαία Burkinabe'
    ],
    '🇧🇬': [
        'Σημαία της Βουλγαρίας',
        'BG',
        'Σημαία Βουλγαρίας'
    ],
    '🇧🇭': [
        'Σημαία του Μπαχρέιν',
        'BH',
        'Σημαία Μπαχρέιν',
        'Σημαία Μπαχρέιν'
    ],
    '🇧🇮': [
        'Σημαία του Μπουρούντι',
        'BI',
        'Burundian Flag'
    ],
    '🇧🇯': [
        'Σημαία του Μπενίν',
        'BJ',
        'Σημαία Μπενίνε'
    ],
    '🇧🇱': [
        'Σημαία του Αγίου Βαρθολομαίου',
        'BL',
        'Σημαία: Άγιος Βαρθολομαίος'
    ],
    '🇧🇲': [
        'Σημαία των Βερμούδων',
        'BM',
        'Bermudan Flag'
    ],
    '🇧🇳': [
        'Σημαία του Μπρουνέι',
        'Παρτίδα',
        'Σημαία Μπρουνέι'
    ],
    '🇧🇴': [
        'Σημαία της Βολιβίας',
        'BO',
        'Bolivian Flag'
    ],
    '🇧🇶': [
        'Σημαία της Καραϊβικής',
        'BQ',
        'Bonaire'
    ],
    '🇧🇷': [
        'Σημαία της Βραζιλίας',
        'BR',
        'Σημαία Βραζιλίας'
    ],
    '🇧🇸': [
        'Σημαία του Μπαχάμες',
        'Σημαία Μπαχαμών',
        'BS'
    ],
    '🇧🇹': [
        'Σημαία του Μπουτάν',
        'BT',
        'Σημαία Μπουτάν'
    ],
    '🇧🇻': [
        'Σημαία του Νησιού Μπουβέ',
        'BV',
        'Σημαία: Νήσος Μπουβέ'
    ],
    '🇧🇼': [
        'Σημαία της Μποτσουάνα',
        'BW',
        'Batswana Flag'
    ],
    '🇧🇾': [
        'Σημαία της Λευκορωσίας',
        'ΑΠΟ',
        'Σημαία Λευκορωσίας'
    ],
    '🇧🇿': [
        'Σημαία του Μπελίζε',
        'BZ',
        'Σημαία Μπελίζε'
    ],
    '🇨🇦': [
        'Σημαία του Καναδά',
        'Σημαία Του Καναδά',
        'CA'
    ],
    '🇨🇨': [
        'Σημαία των Νήσων Κόκος (Κίλινγκ)',
        'CC'
    ],
    '🇨🇩': [
        'Flag of Congo - Kinshasa',
        'CD'
    ],
    '🇨🇫': [
        'Σημαία της Κεντροαφρικανικής Δημοκρατίας',
        'CF',
        'Σημαία Κεντρικής Αφρικής'
    ],
    '🇨🇬': [
        'Σημαία του Κονγκό - Μπραζαβίλ',
        'CG'
    ],
    '🇨🇭': [
        'Σημαία της Ελβετίας',
        'CH',
        'Ερυθρός Σταυρός',
        'Σημαία Ελβετίας'
    ],
    '🇨🇮': [
        'Σημαία της Ακτής Ελεφαντοστού',
        'CI',
        'Flag: Côte d’Ivoire'
    ],
    '🇨🇰': [
        'Σημαία των Νήσων Κουκ',
        'CK',
        'Σημαία Νήσων Κουκ'
    ],
    '🇨🇱': [
        'Σημαία της Χιλής',
        'CL',
        'Σημαία Χιλής'
    ],
    '🇨🇲': [
        'Σημαία του Καμερούν',
        'CM',
        'Σημαία Καμερούν'
    ],
    '🇨🇳': [
        'Σημαία της Κίνας',
        'ΣΟ',
        'Σημαία Της Κίνας'
    ],
    '🇨🇴': [
        'Σημαία της Κολομβίας',
        'CO',
        'Σημαία Κολομβίας'
    ],
    '🇨🇵': [
        'Σημαία του Κλίπερτον',
        'CP',
        'Σημαία: Νήσος Κλίπερτον'
    ],
    '🇨🇷': [
        'Σημαία της Κόστα Ρίκα',
        'CR',
        'Σημαία Της Κόστα Ρίκα'
    ],
    '🇨🇺': [
        'Σημαία της Κούβας',
        'CU',
        'Κουβανική Σημαία'
    ],
    '🇨🇻': [
        'Σημαία του Πράσινου Ακρωτηρίου',
        'CV',
        'Σημαία Πράσινου Ακρωτηρίου'
    ],
    '🇨🇼': [
        'Σημαία του Κουρασάο',
        'CW',
        'Curaçaoan Flag'
    ],
    '🇨🇽': [
        'Σημαία του νησιού των Χριστουγέννων',
        'CX',
        'Σημαία Νήσων Των Χριστουγέννων'
    ],
    '🇨🇾': [
        'Σημαία της Κύπρου',
        'CY',
        'Σημαία Κύπρου'
    ],
    '🇨🇿': [
        'Σημαία της Τσεχίας',
        'CZ',
        'Σημαία Τσεχίας'
    ],
    '🇩🇪': [
        'Σημαία της Γερμανίας',
        'DE',
        'Σημαία Γερμανικά',
        'Σημαία Γερμανίας'
    ],
    '🇩🇬': [
        'Σημαία του Diego Garcia',
        'DG',
        'Σημαία: Ντιέγκο Γκαρσία'
    ],
    '🇩🇯': [
        'Σημαία του Τζιμπουτί',
        'DJ',
        'Djibouti Flag',
        'Djiboutian Flag'
    ],
    '🇩🇰': [
        'Σημαία της Δανίας',
        'DK',
        'Σημαία Δανίας'
    ],
    '🇩🇲': [
        'Σημαία του Ντομίνικα',
        'DM'
    ],
    '🇩🇴': [
        'Σημαία της Δομινικανής Δημοκρατίας',
        'DO',
        'Σημαία Dom Rep',
        'Σημαία Δομινικανής'
    ],
    '🇩🇿': [
        'Σημαία της Αλγερίας',
        'DZ',
        'Algerian Flag'
    ],
    '🇪🇦': [
        'Σημαία της Θέουτας και Μελίγια',
        'Σημαία του Μελίγια',
        'Σημαία της Θέουτας',
        'EA',
        'Flag: Ceuta & Melilla'
    ],
    '🇪🇨': [
        'Σημαία του Ισημερινού',
        'EC',
        'Ecuadorian Flag'
    ],
    '🇪🇪': [
        'Σημαία της Εσθονίας',
        'EE',
        'Σημαία Εσθονίας'
    ],
    '🇪🇬': [
        'Σημαία της Αιγύπτου',
        'EG',
        'Σημαία Αιγύπτου'
    ],
    '🇪🇭': [
        'Σημαία της Δυτικής Σαχάρας',
        'EH',
        'Σημαία Δυτικής Σαχάρας'
    ],
    '🇪🇷': [
        'Σημαία της Ερυθραίας',
        'ER',
        'Eritrean Flag'
    ],
    '🇪🇹': [
        'Σημαία της Αιθιοπίας',
        'ET',
        'Ethiopian Flag'
    ],
    '🇪🇸': [
        'Σημαία της Ισπανίας',
        'ES',
        'Σημαία Ισπανίας'
    ],
    '🇫🇮': [
        'Σημαία της Φινλανδίας',
        'FI',
        'Σημαία Φινλανδίας'
    ],
    '🇫🇯': [
        'Σημαία των Φίτζι',
        'FJ',
        'Fijian Flag'
    ],
    '🇫🇰': [
        'Σημαία των Νήσων Φώκλαντ',
        'FK',
        'Σημαία Falklander'
    ],
    '🇫🇲': [
        'Σημαία της Μικρονησίας',
        'FM',
        'Σημαία Μικρονησίας'
    ],
    '🇫🇴': [
        'Σημαία των Νήσων Φερόε',
        'FO',
        'Faroe Islander Flag'
    ],
    '🇫🇷': [
        'Σημαία της Γαλλίας',
        'FR',
        'Σημαία Γαλλίας'
    ],
    '🇬🇦': [
        'Σημαία της Γκαμπόν',
        'GA',
        'Σημαία Γκαμπόν'
    ],
    '🇬🇧': [
        'Σημαία της Μεγάλης Βρετανίας',
        'GB',
        'Βρετανική Σημαία',
        'Ηνωμένο Βασίλειο',
        'Union Jack',
        'UK'
    ],
    //"🏴󠁧󠁢󠁥󠁮󠁧󠁿": ["Flag of England", "St George's Cross", "English Flag"],
    //"🏴󠁧󠁢󠁷󠁬󠁳󠁿": ["Flag of Wales", "Welsh Flag", "Red Dragon", "Baner Cymru", "Y Ddraig Goch"],
    //"🏴󠁧󠁢󠁳󠁣󠁴󠁿": ["Flag of Scotland", "Scottish Flag", "St Andrew's Cross", "Saltire"],
    //"🏴󠁧󠁢󠁮󠁩󠁲󠁿": ["Flag of Northern Ireland"],
    '🇬🇩': [
        'Σημαία της Γρενάδας',
        'GD',
        'Σημαία Γρενάδας'
    ],
    '🇬🇪': [
        'Σημαία της Γεωργίας',
        'GE',
        'Σημαία Γεωργίας'
    ],
    '🇬🇫': [
        'Σημαία της Γαλλικής Γουιάνας',
        'GF',
        'Σημαία Γαλλικής Γουινέας'
    ],
    '🇬🇬': [
        'Σημαία του Γκέρνσεϊ',
        'GG',
        'Guernsey Flag'
    ],
    '🇬🇭': [
        'Σημαία της Γκάνα',
        'GH',
        'Σημαία Γκάνα'
    ],
    '🇬🇮': [
        'Σημαία του Γιβραλτάρ',
        'GI',
        'Σημαία Γιβραλτάρ'
    ],
    '🇬🇱': [
        'Σημαία της Γροιλανδίας',
        'GL',
        'Greenlandic Flag'
    ],
    '🇬🇲': [
        'Σημαία της Γκάμπια',
        'GM',
        'Gambian Flag'
    ],
    '🇬🇳': [
        'Σημαία της Γουινέας',
        'GN',
        'Guinean Flag'
    ],
    '🇬🇵': [
        'Σημαία της Γουαδελούπης',
        'GP',
        'Σημαία Γουαδελούπης'
    ],
    '🇬🇶': [
        'Σημαία της Ισημερινής Γουινέας',
        'GQ',
        'Equatorial Guinean Flag',
        'Σημαία Ισημερινού'
    ],
    '🇬🇷': [
        'Σημαία της Ελλάδας',
        'GR',
        'Σημαία Ελλάδας'
    ],
    '🇬🇸': [
        'Σημαία της Νότιας Γεωργίας και των Νήσων Νότιων Σάντουιτς',
        'GS'
    ],
    '🇬🇹': [
        'Σημαία της Γουατεμάλας',
        'GT',
        'Guatemalan Flag'
    ],
    '🇬🇺': [
        'Σημαία του Γκουάμ',
        'GU',
        'Σημαία Γουαμανίας',
        'Σημαία Τσάμορρο'
    ],
    '🇬🇼': [
        'Σημαία της Γουινέας-Μπισάου',
        'GW',
        'Guinea-Bissau Flag'
    ],
    '🇬🇾': [
        'Σημαία της Γουιάνας',
        'GY',
        'Σημαία Γουιάνας'
    ],
    '🇭🇰': [
        'Σημαία του Χονγκ Κονγκ SAR Κίνα',
        'HK',
        'Σημαία Χονγκ Κονγκ'
    ],
    '🇭🇲': [
        'Σημαία των Νήσων Χερντ και Μακντόναλντ',
        'HM',
        'Σημαία: Νήσοι Χερντ & Μακντόναλντ'
    ],
    '🇭🇳': [
        'Σημαία της Ονδούρας',
        'HN',
        'Σημαία Ονδούρας'
    ],
    '🇭🇷': [
        'Σημαία της Κροατίας',
        'HR',
        'Σημαία Κροατίας'
    ],
    '🇭🇹': [
        'Σημαία της Αϊτής',
        'HT',
        'Haitian Flag'
    ],
    '🇭🇺': [
        'Σημαία της Ουγγαρίας',
        'HU',
        'Σημαία Ουγγαρίας'
    ],
    '🇮🇨': [
        'Σημαία των Καναρίων Νήσων',
        'IC'
    ],
    '🇮🇩': [
        'Σημαία της Ταϊλάνδης',
        'ID',
        'Σημαία Ινδονησίας'
    ],
    '🇮🇪': [
        'Σημαία της Ιρλανδίας',
        'IE',
        'Σημαία Ιρλανδίας'
    ],
    '🇮🇱': [
        'Σημαία του Ισραήλ',
        'IL',
        'Σημαία Ισραήλ'
    ],
    '🇮🇲': [
        'Σημαία της νήσου του Μαν',
        'IM',
        'Manx Flag'
    ],
    '🇮🇳': [
        'Σημαία της Ινδίας',
        'IN',
        'Σημαία Ινδίας'
    ],
    '🇮🇴': [
        'Σημαία του βρετανικού εδάφους του Ινδικού Ωκεανού',
        'IO',
        'Σημαία Βρετανικού Ωκεανού'
    ],
    '🇮🇶': [
        'Σημαία του Ιράκ',
        'IQ',
        'Iraqi Flag'
    ],
    '🇮🇷': [
        'Σημαία του Ιράν',
        'IR',
        'Σημαία Του Ιράν'
    ],
    '🇮🇸': [
        'Σημαία της Ισλανδίας',
        'IS',
        'Σημαία Ισλανδίας'
    ],
    '🇮🇹': [
        'Σημαία της Ιταλίας',
        'IT',
        'Σημαία Ιταλίας'
    ],
    '🇯🇪': [
        'Σημαία του Τζέρσεϊ',
        'JE',
        'Σημαία Τζέρσεϊ'
    ],
    '🇯🇲': [
        'Σημαία της Τζαμάικα',
        'JM',
        'Σημαία Τζαμάικας'
    ],
    '🇯🇴': [
        'Σημαία της Ιορδανίας',
        'JO',
        'Σημαία Ιορδανίας'
    ],
    '🇯🇵': [
        'Σημαία της Ιαπωνίας',
        'JP',
        'Σημαία Ιαπωνίας'
    ],
    '🇰🇪': [
        'Σημαία της Κένυας',
        'KE',
        'Σημαία Κένυας'
    ],
    '🇰🇬': [
        'Σημαία της Κιργιζίας',
        'KG',
        'Kyrgyzstani Flag'
    ],
    '🇰🇭': [
        'Σημαία της Καμπότζης',
        'KH',
        'Σημαία Καμπότζης'
    ],
    '🇰🇮': [
        'Σημαία του Κιριμπάτι',
        'KI',
        'Σημαία Ι-Κιριμπάτι'
    ],
    '🇰🇲': [
        'Σημαία των Κομορών',
        'ΚΜ',
        'Σημαία Κομορών'
    ],
    '🇰🇳': [
        'Σημαία του Αγίου Χριστόφορου και Νέβις',
        'KN'
    ],
    '🇰🇵': [
        'Σημαία της Βόρειας Κορέας',
        'KP',
        'Σημαία Βόρειας Κορέας'
    ],
    '🇰🇷': [
        'Σημαία της Νότιας Κορέας',
        'KR',
        'Σημαία Νότιας Κορέας'
    ],
    '🇰🇼': [
        'Σημαία του Κουβέιτ',
        'KW',
        'Kuwaiti Flag'
    ],
    '🇰🇾': [
        'Σημαία των Νήσων Καϊμάν',
        'KY',
        'Σημαία Καυμανίας'
    ],
    '🇰🇿': [
        'Σημαία του Καζακστάν',
        'KZ',
        'Kazakhstani Flag',
        'Kazakh Flag'
    ],
    '🇱🇦': [
        'Σημαία του Λάος',
        'LA',
        'Σημαία Του Λάος',
        'Σημαία Λάος'
    ],
    '🇱🇧': [
        'Σημαία του Λιβάνου',
        'LB',
        'Σημαία Λιβάνου'
    ],
    '🇱🇨': [
        'Σημαία της Αγίας Λουκίας',
        'LC'
    ],
    '🇱🇮': [
        'Σημαία του Λιχτενστάιν',
        'LI',
        'Σημαία Λιχτενστάιν'
    ],
    '🇱🇰': [
        'Σημαία της Σρι Λάνκα',
        'LK',
        'Σημαία Σρι Λάνκα'
    ],
    '🇱🇷': [
        'Σημαία της Λιβερίας',
        'LR',
        'Σημαία Λιβερίας'
    ],
    '🇱🇸': [
        'Flag of Lesotho',
        'LS',
        'Basotho Flag'
    ],
    '🇱🇹': [
        'Σημαία της Λιθουανίας',
        'LT',
        'Σημαία Λιθουανίας'
    ],
    '🇱🇺': [
        'Σημαία του Λουξεμβούργου',
        'LU',
        'Σημαία Λουξεμβούργου'
    ],
    '🇱🇻': [
        'Σημαία της Λετονίας',
        'LV',
        'Σημαία Λετονίας'
    ],
    '🇱🇾': [
        'Σημαία της Λιβύης',
        'LY',
        'Σημαία Λιβύης'
    ],
    '🇲🇦': [
        'Σημαία του Μαρόκου',
        'MA',
        'Σημαία Μαρόκου'
    ],
    '🇲🇨': [
        'Σημαία του Μονακό',
        'MC',
        'Σημαία Mone\'gasque'
    ],
    '🇲🇩': [
        'Σημαία της Μολδαβίας',
        'MD',
        'Σημαία Μολδαβίας'
    ],
    '🇲🇪': [
        'Σημαία του Μαυροβουνίου',
        'ME',
        'Σημαία Μαυροβουνίου'
    ],
    '🇲🇫': [
        'Σημαία του Αγίου Μαρτίνου',
        'MF',
        'Flag: St. Martin'
    ],
    '🇲🇬': [
        'Σημαία της Μαδαγασκάρης',
        'MG',
        'Madagascan Flag'
    ],
    '🇲🇭': [
        'Σημαία των Νήσων Μάρσαλ',
        'MH',
        'Σημαία Marshallese'
    ],
    '🇲🇰': [
        'Σημαία της Μακεδονίας',
        'MK',
        'Σλαβομακεδονική Σημαία'
    ],
    '🇲🇱': [
        'Σημαία του Μάλι',
        'ML',
        'Σημαία Μάλι'
    ],
    '🇲🇲': [
        'Σημαία του Μιανμάρ (Βιρμανία)',
        'ΜΜ',
        'Σημαία Μιανμάρεσε',
        'Σημαία Για Τη Βιρμανία',
        'Σημαία Βιρμανίας'
    ],
    '🇲🇳': [
        'Σημαία της Μογγολίας',
        'MN',
        'Σημαία Μογγολίας'
    ],
    '🇲🇴': [
        'Σημαία του Μακάο Σαρ Κίνα',
        'ΔΕ',
        'Σημαία Μακάο'
    ],
    '🇲🇵': [
        'Σημαία των Νήσων Βόρειες Μαριάνες',
        'MP',
        'Σημαία Μικρονησίας'
    ],
    '🇲🇶': [
        'Σημαία της Μαρτινίκας',
        'MQ',
        'Σημαία της Μαρτινίκας',
        'Σημαία Μαρτινίκα'
    ],
    '🇲🇷': [
        'Σημαία της Μαυριτανίας',
        'MR',
        'Σημαία Μαυριτανίας'
    ],
    '🇲🇸': [
        'Flag of Montserrat',
        'MS',
        'Montserratian Flag'
    ],
    '🇲🇹': [
        'Σημαία της Μάλτας',
        'MT',
        'Maltese Flag'
    ],
    '🇲🇺': [
        'Flag of Mauritius',
        'MU',
        'Σημαία Μαυρίκιου'
    ],
    '🇲🇻': [
        'Σημαία της Μαλδίβας',
        'MV',
        'Σημαία Μαλδίβας'
    ],
    '🇲🇼': [
        'Σημαία του Μαλάουι',
        'MW',
        'Malawian Flag'
    ],
    '🇲🇽': [
        'Σημαία του Μεξικού',
        'MX',
        'Σημαία Μεξικού'
    ],
    '🇲🇾': [
        'Σημαία της Μαλαισίας',
        'ΜΟΥ',
        'Malaysian Flag'
    ],
    '🇲🇿': [
        'Σημαία της Μοζαμβίκης',
        'MZ',
        'Σημαία Μοζαμβίκης'
    ],
    '🇳🇦': [
        'Σημαία της Ναμίμπια',
        'NA',
        'Namibian Flag'
    ],
    '🇳🇨': [
        'Σημαία της Νέας Καληδονίας',
        'NC',
        'Σημαία Νέας Καληδονίας'
    ],
    '🇳🇪': [
        'Σημαία του Νίγηρα',
        'ΒΑ',
        'Σημαία Νιγηρίας'
    ],
    '🇳🇫': [
        'Σημαία του Νησιού',
        'NF',
        'Σημαία Νησιού Νόρφολκ'
    ],
    '🇳🇬': [
        'Σημαία της Νιγηρίας',
        'NG',
        'Σημαία Νιγηρίας'
    ],
    '🇳🇮': [
        'Flag of Nicaragua',
        'NI',
        'Nicaraguan Flag'
    ],
    '🇳🇱': [
        'Σημαία της Ολλανδίας',
        'NL',
        'Σημαία Ολλανδίας'
    ],
    '🇳🇴': [
        'Σημαία της Νορβηγίας',
        'ΟΧΙ',
        'Σημαία Νορβηγίας'
    ],
    '🇳🇵': [
        'Σημαία του Νεπάλ',
        'NP',
        'Σημαία Νεπάλ'
    ],
    '🇳🇷': [
        'Σημαία του Ναούρου',
        'NR',
        'Nauruan Flag'
    ],
    '🇳🇺': [
        'Σημαία της Νιούε',
        'NU',
        'Niuean Flag'
    ],
    '🇳🇿': [
        'Σημαία της Νέας Ζηλανδίας',
        'NZ',
        'Σημαία Ακτινιδίων'
    ],
    '🇴🇲': [
        'Σημαία του Ομάν',
        'ΟΜ',
        'Σημαία Ομάνι'
    ],
    '🇵🇦': [
        'Σημαία του Παναμά',
        'PA',
        'Σημαία Παναμά'
    ],
    '🇵🇪': [
        'PE',
        'Σημαία του Περού',
        'Σημαία Περού'
    ],
    '🇵🇫': [
        'Σημαία της Γαλλικής Πολυνησίας',
        'PF',
        'Σημαία Γαλλικής Πολυνησίας'
    ],
    '🇵🇬': [
        'Σημαία της Παπουασίας-Νέας Γουινέας',
        'PG',
        'Σημαία PNG',
        'Papua New Guinean Flag'
    ],
    '🇵🇭': [
        'Σημαία των Φιλιππίνων',
        'PH'
    ],
    '🇵🇰': [
        'Σημαία του Πακιστάν',
        'PK',
        'Σημαία Πακιστάν'
    ],
    '🇵🇱': [
        'Σημαία της Πολωνίας',
        'PL',
        'Σημαία Πολωνίας'
    ],
    '🇵🇲': [
        'Σημαία του Σαιν Πιέρ και Μικελόν',
        'ΜΜ'
    ],
    '🇵🇳': [
        'Σημαία του Πίτκαιρν',
        'PN'
    ],
    '🇵🇷': [
        'Σημαία του Πουέρτο Ρίκο',
        'PR',
        'Σημαία Πουέρτο Ρίκο'
    ],
    '🇵🇸': [
        'Σημαία των Παλαιστινιακών Εδαφών',
        'PS',
        'Palestine'
    ],
    '🇵🇹': [
        'Σημαία της Πορτογαλίας',
        'PT',
        'Σημαία Πορτογαλίας'
    ],
    '🇵🇼': [
        'Σημαία του Παλάου',
        'PW',
        'Σημαία Παλάουαν'
    ],
    '🇵🇾': [
        'Σημαία της Παραγουάης',
        'PY',
        'Paraguayan Flag'
    ],
    '🇶🇦': [
        'Σημαία του Κατάρ',
        'QA',
        'Σημαία Κατάρ'
    ],
    '🇷🇪': [
        'Σημαία της Ρεϊνιόν',
        'RE',
        'Σημαία Ρεϊνιοννές'
    ],
    '🇷🇴': [
        'Σημαία της Ρουμανίας',
        'RO',
        'Σημαία Ρουμανίας'
    ],
    '🇷🇸': [
        'Σημαία της Σερβίας',
        'RS',
        'Σημαία Σερβίας'
    ],
    '🇷🇺': [
        'Σημαία της Ρωσίας',
        'RU',
        'Σημαία Ρωσίας'
    ],
    '🇷🇼': [
        'Flag of Rwanda',
        'RW',
        'Rwandan Flag'
    ],
    '🇸🇦': [
        'Σημαία της Σαουδικής Αραβίας',
        'SA',
        'Σημαία Σαουδικής Αραβίας'
    ],
    '🇸🇧': [
        'Σημαία των Νήσων Σολομώντος',
        'SB',
        'Σημαία Νήσων Σολομώντος'
    ],
    '🇸🇨': [
        'Σημαία των Σεϋχελλών',
        'SC',
        'Seychellois Flag'
    ],
    '🇸🇩': [
        'Σημαία του Σουδάν',
        'SD',
        'Sudanese Flag'
    ],
    '🇸🇪': [
        'Σημαία της Σουηδίας',
        'ΝΑ',
        'Σουηδική Σημαία'
    ],
    '🇸🇬': [
        'Σημαία της Σιγκαπούρης',
        'SG',
        'Σημαία Σιγκαπούρης'
    ],
    '🇸🇭': [
        'Σημαία της Αγίας Ελένης',
        'SH'
    ],
    '🇸🇮': [
        'Σημαία της Σλοβενίας',
        'SI',
        'Σημαία Σλοβενίας'
    ],
    '🇸🇯': [
        'Σημαία του Σβάλμπαρντ & Γιαν Μαγιέν',
        'SJ'
    ],
    '🇸🇰': [
        'Σημαία της Σλοβακίας',
        'SK',
        'Σημαία Σλοβακίας',
        'Slovakian Flag'
    ],
    '🇸🇱': [
        'Σημαία της Σιέρα Λεόνε',
        'SL',
        'Sierra Leonean Flag'
    ],
    '🇸🇲': [
        'Σημαία του Αγίου Μαρίνου',
        'SM',
        'Σημαία Σαμμαρινής'
    ],
    '🇸🇳': [
        'Σημαία της Σενεγάλης',
        'SN',
        'Σημαία Της Σενεγάλης'
    ],
    '🇸🇴': [
        'Σημαία της Σομαλίας',
        'SO',
        'Somalian Flag'
    ],
    '🇸🇷': [
        'Σημαία του Σουρινάμ',
        'SR',
        'Σημαία Σουρινάμ'
    ],
    '🇸🇸': [
        'Σημαία του Νότιου Σουδάν',
        'SS',
        'Σημαία Νότιου Σουδάν'
    ],
    '🇸🇹': [
        'Σημαία του Σάο Τομέ & Πρίνσιπε',
        'ST'
    ],
    '🇸🇻': [
        'Σημαία του Ελ Σαλβαδόρ',
        'SV',
        'Σημαία Ελ Σαλβαδόρα'
    ],
    '🇸🇽': [
        'Σημαία του Αγίου Μαρτίνου',
        'SX'
    ],
    '🇸🇾': [
        'Σημαία της Συρίας',
        'SY',
        'Σημαία Συρίας'
    ],
    '🇸🇿': [
        'Σημαία της Σουαζιλάνδης',
        'SZ',
        'Σημαία Eswatini'
    ],
    '🇹🇦': [
        'Flag of Tristan Da Cunha',
        'TA'
    ],
    '🇹🇨': [
        'Σημαία των Νήσων Τερκς και Κάικος',
        'TC'
    ],
    '🇹🇩': [
        'Σημαία του Τσαντ',
        'TD',
        'Σημαία Του Τσαντ'
    ],
    '🇹🇫': [
        'Σημαία των Νότιων Γαλλικών Εδαφών',
        'TF',
        'Σημαία Νότιας Γαλλίας'
    ],
    '🇹🇬': [
        'Σημαία του Τόγκο',
        'TG',
        'Togolese Flag'
    ],
    '🇹🇭': [
        'Σημαία της Ταϊλάνδης',
        'TH',
        'Σημαία Ταϊλάνδης'
    ],
    '🇹🇯': [
        'Σημαία του Τατζικιστάν',
        'TJ',
        'Σημαία Τατζικιστάν'
    ],
    '🇹🇰': [
        'Σημαία του Τοκελάου',
        'TK',
        'Σημαία Τοκελάου'
    ],
    '🇹🇱': [
        'Σημαία του Ανατολικού Τιμόρ',
        'TL',
        'Σημαία Ανατολικού Τιμόρ',
        'Σημαία Ανατολικού Τιμόρ'
    ],
    '🇹🇲': [
        'Σημαία του Τουρκμενιστάν',
        'ΜΜ',
        'Turkmen Flag'
    ],
    '🇹🇳': [
        'Σημαία της Τυνησίας',
        'ΤΝ',
        'Σημαία Τυνησίας'
    ],
    '🇹🇴': [
        'Σημαία της Τόνγκα',
        'ΠΡΟΣ',
        'Tongan Flag'
    ],
    '🇹🇷': [
        'Σημαία της Τουρκίας',
        'TR',
        'Σημαία Τουρκίας'
    ],
    '🇹🇹': [
        'Σημαία του Τρινιντάντ και Τομπάγκο',
        'TT'
    ],
    '🇹🇻': [
        'Σημαία του Τουβαλού',
        'Τηλεόραση',
        'Σημαία Τουβαλούάν'
    ],
    '🇹🇼': [
        'Σημαία της Ταϊβάν',
        'TW',
        'Σημαία Ταϊβάν'
    ],
    '🇹🇿': [
        'Σημαία της Τανζανίας',
        'TZ',
        'Tanzanian Flag'
    ],
    '🇺🇦': [
        'Σημαία της Ουκρανίας',
        'UA',
        'Σημαία Ουκρανίας'
    ],
    '🇺🇬': [
        'Σημαία της Ουγκάντας',
        'UG',
        'Σημαία Ουγκάντα'
    ],
    '🇺🇲': [
        'Σημαία: Απομακρυσμένες Νήσοι Των ΗΠΑ',
        'UM'
    ],
    '🇺🇸': [
        'Σημαία των Ηνωμένων Πολιτειών',
        'ΗΠΑ',
        'Αμερικανική Σημαία',
        'Σημαία ΗΠΑ'
    ],
    '🇺🇾': [
        'Flag of Uruguay',
        'UY',
        'Uruguayan Flag'
    ],
    '🇺🇿': [
        'Flag of Uzbekistan',
        'UZ',
        'Uzbekistani Flag',
        'Uzbek Flag'
    ],
    '🇻🇦': [
        'Σημαία της Αγίας Έδρας',
        'VA',
        'Σημαία Βαντικανιέν'
    ],
    '🇻🇨': [
        'Σημαία του Αγίου Βικεντίου και Γρεναδίνες',
        'VC'
    ],
    '🇻🇪': [
        'Σημαία της Βενεζουέλας',
        'VE',
        'Σημαία Βενεζουέλας'
    ],
    '🇻🇬': [
        'Σημαία των Βρετανικών Παρθένων Νήσων',
        'VG',
        'Σημαία Βρετανικής Παρθένου Νησιού'
    ],
    '🇻🇮': [
        'Σημαία των Παρθένων Νήσων των ΗΠΑ',
        'VI',
        'Σημαία Αμερικανών Παρθένων Νήσων'
    ],
    '🇻🇳': [
        'Σημαία του Βιετνάμ',
        'VN',
        'Σημαία Βιετνάμ'
    ],
    '🇻🇺': [
        'Flag of Vanuatu',
        'VU',
        'Ni-Vanuatu Flag'
    ],
    '🇼🇫': [
        'Σημαία της Ουώλλις και της Φουτούνας',
        'WF'
    ],
    '🇼🇸': [
        'Σημαία της Σαμόας',
        'WS',
        'Samoan Flag'
    ],
    '🇽🇰': [
        'Σημαία του Κοσσυφοπεδίου',
        'XK',
        'Kosovar Flag'
    ],
    '🇾🇪': [
        'Σημαία της Υεμένης',
        'YE',
        'Σημαία Υεμένης'
    ],
    '🇾🇹': [
        'Σημαία του Μαγιότ',
        'YT',
        'Σημαία Μαγιότ'
    ],
    '🇿🇦': [
        'Σημαία της Νότιας Αφρικής',
        'ZA',
        'Σημαία Νότιας Αφρικής'
    ],
    '🇿🇲': [
        'Σημαία της Ζάμπιας',
        'ZM',
        'Zambian Flag'
    ],
    '🇿🇼': [
        'Σημαία της Ζιμπάμπουε',
        'ZW',
        'Σημαία Ζιμπάμπουε',
        'Σημαία Zim'
    ]
};
/*sports*/
emojis_language[lang][8] = {
    '🧗‍[[*skin_tone*]]‍‍♂️': [
        'Άνθρωπος Αναρρίχηση',
        'Αρσενικό Rock Climber',
        'Άνθρωπος Αναρρίχηση'
    ],
    '🧗‍[[*skin_tone*]]‍‍♀️': [
        'Γυναίκα Αναρρίχηση',
        'Θηλυκό Rock Climber',
        'Γυναίκα Ορειβάτης'
    ],
    '🏇‍[[*skin_tone*]]‍': [
        'Ιπποδρομίες',
        'Αγώνας Άλογα',
        'Jockey'
    ],
    '⛷‍[[*skin_tone*]]‍️': ['Σκιέρ'],
    '🏂‍[[*skin_tone*]]‍': ['Snowboarder'],
    '🏌️‍‍[[*skin_tone*]]‍♂️': ['Man Golfer'],
    '🏌️‍‍[[*skin_tone*]]‍♀️': ['Γκολφ Γυναίκας'],
    '🏄‍‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Surfer'],
    '🏄‍‍[[*skin_tone*]]‍♀️': ['Surfer Γυναίκας'],
    '🚣‍[[*skin_tone*]]‍‍♂️': ['Άνθρωπος Κωπηλασία Σκάφος'],
    '🚣‍[[*skin_tone*]]‍‍♀️': ['Γυναικείο Σκάφος Κωπηλασίας'],
    '🏊‍[[*skin_tone*]]‍‍♂️': [
        'Κολύμβηση Ανθρώπου',
        'Κολυμβητής Άνθρωπος'
    ],
    '🏊‍[[*skin_tone*]]‍‍♀️': [
        'Κολύμβηση Γυναίκας',
        'Κολυμβητής Γυναίκας'
    ],
    '⛹‍[[*skin_tone*]]‍️‍♂️': [
        'Άνθρωπος Αναπήδηση Μπάλα',
        'Παίκτης Του Man Μπάσκετ'
    ],
    '⛹️‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα Αναπήδηση Μπάλα',
        'Γυναίκα Παίκτης Μπάσκετ'
    ],
    '🏋️‍‍[[*skin_tone*]]‍♂️': [
        'Άνθρωπος Ανύψωση Βάρη',
        'Άνθρωπος Weightlifter'
    ],
    '🏋️‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα Ανύψωση Βάρη',
        'Γυναίκα Weightlifter'
    ],
    '🚴‍‍[[*skin_tone*]]‍♂️': [
        'Ποδηλασία Ανθρώπου',
        'Άνθρωπος Ποδηλάτης',
        'Αρσενικός Ποδηλάτης'
    ],
    '🚴‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα Ποδηλασία',
        'Γυναίκα, Κυκλαδίτης',
        'Θηλυκός Κυκλαδίτης'
    ],
    '🚵‍‍[[*skin_tone*]]‍♂️': [
        'Man Mountain Biking',
        'Man Mountain Biker'
    ],
    '🚵‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα Ποδηλασία Στο Βουνό',
        'Γυναίκα Βουνό Ποδήλατο'
    ],
    '🤸‍‍[[*skin_tone*]]‍♂️': [
        'Άνθρωπος Cartwheeling',
        'Άνθρωπος Κάνοντας Τροχός'
    ],
    '🤸‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα Cartwheeling',
        'Γυναίκα Να Κάνει Τροχό'
    ],
    '🤼': [
        'Άνθρωποι Πάλη',
        'Πάλη',
        'παλαιστές'
    ],
    '🤽‍‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Παίζοντας Πόλο Νερού'],
    '🤽‍‍[[*skin_tone*]]‍♀️': ['Γυναίκα Που Παίζει Πόλο Νερού'],
    '🤾‍‍[[*skin_tone*]]‍♂️': ['Άνθρωπος Παίζοντας Χάντμπολ'],
    '🤾‍‍[[*skin_tone*]]‍♀️': ['Γυναίκα Παίζοντας Χάντμπολ'],
    '🤹‍‍[[*skin_tone*]]‍♂️': [
        'Άνθρωπος Juggling',
        'Αρσενικό Juggler'
    ],
    '🤹‍‍[[*skin_tone*]]‍♀️': [
        'Γυναίκα Juggling',
        'Θηλυκό Juggler'
    ],
    '🧘‍‍[[*skin_tone*]]‍♂️': ['Ο άνθρωπος στη θέση Lotus'],
    '🧘‍‍[[*skin_tone*]]‍♀️': ['Γυναίκα στη θέση του Lotus'],
    '🏃‍‍[[*skin_tone*]]‍♂️': ['Ο Άνθρωπος Εκτελείται'],
    '🏃‍‍[[*skin_tone*]]‍♀️': ['Γυναίκα Εκτελείται'],
    '🕺‍[[*skin_tone*]]‍': ['Άνθρωπος Χορεύοντας'],
    '💃‍[[*skin_tone*]]‍': ['Χορός Γυναίκας'],
    '🤺': [
        'Ξιφασκία Προσώπου',
        'Τοξοβόλος'
    ],
    '🏆': [
        'Τρόπαιο',
        'Πρωτάθλημα',
        'Νικητής'
    ],
    '🏅': ['Μετάλλιο Αθλητισμού'],
    '🥇': [
        'Μετάλλιο 1ης Θέσης',
        'Μετάλλιο Πρώτης Θέσης',
        'Χρυσό Μετάλλιο'
    ],
    '🥈': [
        '2η Θέση Μετάλλιο',
        'Μετάλλιο Δεύτερης Θέσης',
        'Ασημένιο Μετάλλιο'
    ],
    '🥉': [
        '3η Θέση Μετάλλιο',
        'Τρίτο Μετάλλιο',
        'Χάλκινο Μετάλλιο'
    ],
    '⚽': [
        'Ποδόσφαιρο',
        'Ποδόσφαιρο'
    ],
    '⚾': [
        'Μπέιζμπολ',
        'Softball',
        'Λευκό'
    ],
    '🥎': [
        'Softball',
        'Κίτρινο'
    ],
    '🏀': [
        'Μπάσκετ',
        'Πορτοκαλί',
        'Μπάσκετ και Hoop'
    ],
    '🏐': ['Βόλεϊ'],
    '🏈': [
        'Αμερικάνικο Ποδόσφαιρο',
        'Ποδόσφαιρο',
        'Gridiron',
        'Superbowl'
    ],
    '🏉': [
        'Ποδόσφαιρο Ράγκμπι',
        'Ποδόσφαιρο',
        'Πρωτάθλημα',
        'Ράγκμπι',
        'Ένωση'
    ],
    '🎾': [
        'Τένις',
        'Μπάλα',
        'Ρακέτα',
        'Λάκκα'
    ],
    '🥏': [
        'Δίσκος Που Πετάνε',
        'Frisbee'
    ],
    '🎳': [
        'Μπόουλινγκ',
        'Καρφίτσες',
        'Πατάτες',
        'Δέκα Pin Μπόουλινγκ'
    ],
    '🏏': [
        'Κρίκετ',
        'Νυχτερίδα',
        'Μπάλα'
    ],
    '🏑': [
        'Πεδίο Χόκεϊ',
        'Μπάλα',
        'Ραβδί'
    ],
    '🏒': [
        'Χόκεϊ Στον Πάγο',
        'Μπάλα',
        'Ραβδί'
    ],
    '🥍': [
        'Λακρόζη',
        'Μπάλα',
        'Ραβδί'
    ],
    '🏓': [
        'Ping Pong',
        'Επιτραπέζιο Τένις',
        'Μπάλα',
        'Paddle'
    ],
    '🏸': [
        'Badminton',
        'Κλείσιμο',
        'Λάκκα'
    ],
    '🥊': ['Γάντι Πυγμαχίας'],
    '🥋': [
        'Πολεμικές Τέχνες Ομοιόμορφη',
        'Τζούντο',
        'Καράτε',
        'Kung fu'
    ],
    '⛳': [
        'Σημαία στην Τρύπα',
        'Σημαία Γκολφ'
    ],
    '⛸️': [
        'Σελάχι Πάγου',
        'Πατινάζ'
    ],
    '🎣': [
        'Αλιεία',
        'Πολωνός',
        'Ψάρια',
        'Καλάμι Ψαρέματος'
    ],
    '🎽': [
        'Τρέξιμο Πουκάμισο',
        'Singlet',
        'Sash'
    ],
    '🎿': [
        'Σκι',
        'Σκι',
        'Εκκίνηση'
    ],
    '🛷': ['Σφραγισμένο'],
    '🥌': ['Πέτρα Κέρλινγκ'],
    '🎯': [
        'Απευθείας Χτύπημα',
        'Τοξοβολία',
        'Bullseye',
        'Βελάκια'
    ],
    '🎱': [
        'Πισίνα 8 Μπάλα',
        'Μπάλα Cue',
        'Σνούκερ',
        'Μπιλιάρδο'
    ],
    '🎮': [
        'Ελεγκτής Παιχνιδιών Βίντεο',
        'Playstation',
        'Xbox',
        'Gamepad',
        'Wii U'
    ],
    '♟️': ['Πιόνι Μαύρου Σκάκι'],
    '🏹': [
        'Τόξο και βέλος',
        'Arch'
    ],
    '🥅': ['Δίκτυο Στόχου'],
    '🀄': [
        'Κόκκινος Δράκος Mahjong',
        'Mahjong',
        'Mahjong Tile',
        '中',
        'Κόκκινος Δράκος Mahjong Πλακάκια'
    ],
    '🎴': [
        'Κάρτες Παίζοντας Λουλούδι',
        'Τράπουλα Με Φύλλα',
        'Hanafuda',
        'Hwatu',
        'Κάρτες Αναπαραγωγής'
    ]
};
/*travel and places*/
emojis_language[lang][9] = {
    '🚂': [
        'Ατμομηχανή',
        'Τρένο Ατμού',
        'Σιδηροδρομική Μηχανή'
    ],
    '🚃': [
        'Σιδηροδρομικό Αυτοκίνητο',
        'Railcar',
        'Σιδηροδρομικό Αυτοκίνητο',
        'Σιδηροδρομικές Μεταφορές',
        'Σιδηροδρομικό Βαγόνι'
    ],
    '🚄': ['Τρένο Υψηλής Ταχύτητας'],
    '🚅': [
        'Τρένο Κουκκίδων',
        'Shinkansen',
        'Τρένο υψηλής ταχύτητας με σφαίρα μύτης'
    ],
    '🚆': ['Τρένο'],
    '🚇': [
        'Υπόγεια',
        'Σωλήνας',
        'Μετρό',
        'Μετρό'
    ],
    '🚈': [
        'Ελαφριά Σιδηροδρομική Γραμμή',
        'Τρένο'
    ],
    '🚊': ['Τραμ'],
    '🚝': [
        'Μονοκύμινο',
        'Τρένο'
    ],
    '🚞': [
        'Σιδηρόδρομος Του Βουνού',
        'Funicular',
        'Τρένο Και Βουνό'
    ],
    '🚋': ['Αυτοκίνητο Τραμ'],
    '🚌': [
        'Λεωφορείο',
        'Προπονητής'
    ],
    '🚍': [
        'Εισερχόμενο Λεωφορείο',
        'Μπροστά Από Λεωφορείο'
    ],
    '🚎': [
        'Trolleybus',
        'Ηλεκτρικό Λεωφορείο'
    ],
    '🚐': [
        'Minibus',
        'Minivan',
        'Άνθρωποι-Mover'
    ],
    '🚑': ['Ασθενοφόρο'],
    '🚒': [
        'Μηχανή Φωτιάς',
        'Πυροσβεστικό Τμήμα',
        'Πυροσβεστικό Φορτηγό'
    ],
    '🚓': [
        'Αυτοκίνητο Αστυνομίας',
        'Αυτοκίνητο Cop',
        'Πλευρά Της Αστυνομίας Αυτοκίνητο'
    ],
    '🚔': [
        'Επερχόμενο Αστυνομικό Αυτοκίνητο',
        'Μπροστά της Αστυνομίας Αυτοκίνητο',
        'Αυτοκίνητο Cop'
    ],
    '🚕': [
        'Ταξί',
        'Ταξί Της Νέας Υόρκης',
        'Πλευρά Ταξί'
    ],
    '🚖': [
        'Ταξί',
        'Εισερχόμενα Ταξί',
        'Μπροστά από ταξί'
    ],
    '🚗': [
        'Αυτοκίνητο',
        'Κόκκινο Αυτοκίνητο',
        'Πλευρά Αυτοκινήτου'
    ],
    '🚘': [
        'Εισερχόμενο Αυτοκίνητο',
        'Κόκκινο Αυτοκίνητο',
        'Μπροστά Του Αυτοκινήτου'
    ],
    '🚚': [
        'Φορτηγό Παράδοσης',
        'Κοκκώδης'
    ],
    '🚛': [
        'Αρθρωτό Κορί',
        'Πράσινο Φορτηγό'
    ],
    '🚜': [
        'Τρακτέρ',
        'Αγρόκτημα'
    ],
    '🛻': ['Φορτηγό Παραλαβής'],
    '🏎️': [
        'Αγωνιστικό Αυτοκίνητο',
        'F1',
        'Τύπος Ένα',
        'Αγώνας Αυτοκίνητο'
    ],
    '🏍️': [
        'Μοτοσικλέτα',
        'Μοτοσικλέτα'
    ],
    '🛵': [
        'Μοτέρ Σκούτερ',
        'Vespa',
        'Μοτέρ Ποδήλατο',
        'Μοτέρ Ποδήλατο'
    ],
    '🛺': [
        'Αυτόματο Rickshaw',
        'Tuk Tuk'
    ],
    '🚲': [
        'Ποδήλατο',
        'Ποδήλατο'
    ],
    '🛴': ['Kick Scooter'],
    '⛵': [
        'Ιστιοφόρο',
        'Dinghy',
        'Σκάφος'
    ],
    '🚤': [
        'Ταχύπλοο',
        'Μηχανοκίνητο',
        'Powerboat'
    ],
    '🛳️': ['Επιβατικό Πλοίο'],
    '⛴️': ['Πλοία'],
    '🛥️': ['Μηχανοκίνητο Σκάφος'],
    '🚢': ['Πλοίο Κρουαζιέρας'],
    '✈️': [
        'Αεροπλάνο',
        'Aeroplane'
    ],
    '🛩️': [
        'Μικρό Αεροπλάνο',
        'Μικρό Αεροπλάνο'
    ],
    '🚁': ['Ελικόπτερο'],
    '🚟': ['Αναστολή Σιδηροδρόμων'],
    '🚠': ['Ορεινό Συρματόσχοινα'],
    '🚡': [
        'Εναέρια Τραμ',
        'Καλώδιο Αυτοκινήτου',
        'Gondola',
        'Ροδόπη'
    ],
    '🛰️': ['Δορυφόρος'],
    '🚀': [
        'Πύραυλος',
        'Διαστημική Μεταφορά'
    ],
    '🛸': [
        'Πετώντας Πιατάκι',
        'UFO'
    ],
    '🚉': [
        'Σιδηροδρομικός Σταθμός',
        'Πλατφόρμα Εκπαίδευσης'
    ],
    '🚏': ['Διακοπή Λεωφορείου'],
    '🛣️': [
        'Αυτοκινητόδρομος',
        'Δρόμος',
        'Αυτοκινητόδρομος',
        'Διαπολιτισμός'
    ],
    '🛤️': ['Σιδηροδρομικό Κομμάτι'],
    '🛫': [
        'Αναχώρηση Αεροπλάνου',
        'Απογείωση'
    ],
    '🛬': [
        'Άφιξη Αεροπλάνου',
        'Φτάνοντας Αεροπλάνο',
        'Προσγείωση'
    ],
    '🗾': ['Χάρτης για Ιαπωνία'],
    '⛰️': ['Βουνό'],
    '🏔️': ['Χιονισμένο Βουνό'],
    '🌋': ['Ηφαίστειο'],
    '🗻': [
        'Φόρτωση Fuji',
        'Fuji-san'
    ],
    '🏕️': [
        'Κατασκήνωση',
        'Κάμπινγκ'
    ],
    '🏖️': ['Παραλία Με Ομπρέλα'],
    '🏜️': ['Desert'],
    '🏝️': ['Νήσος Της Ερήμου'],
    '🏞️': ['Εθνικό Πάρκο'],
    '🏟️': [
        'Στάδιο',
        'Grandstand',
        'Αθλητικό Στάδιο'
    ],
    '🏛️': [
        'Κλασικό Κτίριο',
        'Ελληνικά',
        'Ρώμη'
    ],
    '🏗️': [
        'Κατασκευή Κτιρίων',
        'Γερανός'
    ],
    '🏘️': [
        'Σπίτια Κτίρια',
        'Ομάδα κατοικιών'
    ],
    '🏚️': [
        'Derelict Σπίτι Κτίριο',
        'Εγκαταλελειμμένο Σπίτι',
        'Παλιό Σπίτι',
        'Στοιχειωμένο Σπίτι'
    ],
    '🏠': [
        'Αρχική',
        'Κτίριο Κατοικίας'
    ],
    '🏡': [
        'Σπίτι Με Κήπο',
        'Σπίτι Και Δέντρο'
    ],
    '🏢': [
        'Κτίριο Γραφείου',
        'Κτίριο Πόλης',
        'High-Rise Κτίριο'
    ],
    '🏣': [
        'Ιαπωνικά Ταχυδρομεία',
        'Ιαπωνικό Ταχυδρομικό Μάρκο'
    ],
    '🏤': [
        'Ταχυδρομείο',
        'Ευρωπαϊκό Ταχυδρομείο'
    ],
    '🏥': [
        'Νοσοκομείο',
        'ER',
        'A&E',
        'Δωμάτιο Έκτακτης Ανάγκης',
        'Ατύχημα Και Έκτακτης Ανάγκης',
        'Ερυθρός Σταυρός',
        'Ιατρική'
    ],
    '🏦': [
        'Τράπεζα',
        'BK',
        'Bakkureru',
        'Υποκατάστημα Τράπεζας',
        'Bakkureru'
    ],
    '🏨': [
        'Ξενοδοχείο',
        'Διαμονή',
        'H Κτίριο'
    ],
    '🏩': [
        'Ξενοδοχείο Αγάπης',
        'Αγάπη Heart Hotel'
    ],
    '🏪': [
        'Κατάστημα Ευκολίας',
        '24ωρο Κατάστημα',
        '7-Έντεκα',
        'Κατάστημα Γωνιών',
        'Kwik-E-Mart'
    ],
    '🏫': [
        'Σχολείο',
        'Πύργος Ρολογιού',
        'Στοιχειώδη Υψηλή Μέση'
    ],
    '🏬': [
        'Τμήμα Καταστήματος',
        'Εμπορικό Κέντρο',
        'Κατάστημα'
    ],
    '🏭': [
        'Εργοστάσιο',
        'Βιομηχανική',
        'Βιομηχανία',
        'Ρύπανση',
        'Κάπνισμα'
    ],
    '🏯': [
        'Ιαπωνικό Κάστρο',
        'Οχυρό'
    ],
    '🏰': [
        'Ευρωπαϊκό Κάστρο',
        'Turrets'
    ],
    '💒': [
        'Καρδιά Εκκλησίας',
        'Γάμος Της Εκκλησίας',
        'Γάμος'
    ],
    '🗼': [
        'Πύργος Του Τόκιο',
        'Πύργος Του Άιφελ',
        'Κόκκινος Πύργος'
    ],
    '🗽': [
        'Άγαλμα της ελευθερίας',
        'Νέα Υόρκη'
    ],
    '⛪': [
        'Κτίριο Εκκλησίας',
        'Σταυρός'
    ],
    '🕌': [
        'Τζαμί',
        'Κυμαινόμενη Στέγη',
        'Minaret'
    ],
    '🛕': ['Ινδουιστικός Ναός'],
    '🕍': [
        'Συναγωγή',
        'Εβραϊκή',
        'Synagog',
        'Ναός'
    ],
    '⛩️': [
        'Shinto Shrine',
        'Kami-no-michi'
    ],
    '🕋': [
        'Kaaba',
        'Mecca'
    ],
    '🏙️': ['Cityscape'],
    '⛱️': [
        'Ομπρέλα στο έδαφος',
        'Ομπρέλα Παραλίας'
    ],
    '🌄': [
        'Ανατολή Ηλίου Πάνω Από Βουνά',
        'Πρωί',
        'Ανατολή'
    ],
    '🌅': [
        'Ανατολή',
        'Ήλιος'
    ],
    '🌆': [
        'Αστικό τοπίο στο Dusk',
        'Πορτοκαλί Ουρανό Σίτι',
        'Σούρουπο Πόλη'
    ],
    '🌇': [
        'Ηλιοβασίλεμα Πάνω Από Κτίρια',
        'City Sunset'
    ],
    '🌃': [
        'Νύχτα με αστέρια',
        'Πόλη Τη Νύχτα',
        'Έναστρο Νύχτα'
    ],
    '🗿': [
        'Moai',
        'Άγαλμα Του Πάσχα',
        'Human Rock Carving',
        'Άγαλμα Moyai'
    ],
    '🌠': [
        'Σκοποβολή Αστέρι',
        'Όταν Επιθυμείτε Ένα Αστέρι',
        'Μετεωροειδές'
    ],
    '🌌': [
        'Γαλακτώδης Τρόπος',
        'Γαλαξίας',
        'Νυχτερινός Ουρανός',
        'Κενό',
        'Αστέρια',
        'Σύμπαν'
    ],
    '🎑': [
        'Τελετή Προβολής Σελήνης',
        'Γρασίδι, Dumplings και Σελήνη',
        'Συγκομιδή Σελήνης',
        'Φεστιβάλ Μέσου Φθινοπώρου',
        'Tsukimi'
    ],
    '🛖': ['Καλύβα'],
    '🎢': [
        'Roller Coaster',
        'Rollercoaster',
        'Θεματικό Πάρκο'
    ]
};
/*technologies (smartphones, laptops, etc.) and office*/
emojis_language[lang][10] = {
    '⌚': [
        'Παρακολούθηση',
        'Timepiece',
        'Apple Watch'
    ],
    '⏰': ['Ξυπνητήρι'],
    '⏱️': ['Χρονόμετρο'],
    '⏲️': ['Ρολόι Χρονισμού'],
    '🕰️': ['Ρολόι Mantelpiece'],
    '🧭': ['Πυξίδα'],
    '🕹️': ['Χειριστήριο'],
    '🎙️': ['Στούντιο Μικρόφωνο'],
    '🎚️': ['Ρυθμιστικό Επιπέδου'],
    '🎛️': ['Πλήκτρα Ελέγχου'],
    '📻': [
        'Ραδιόφωνο',
        'Ψηφιακό Ραδιόφωνο',
        'Ασύρματο'
    ],
    '📱': [
        'Κινητό Τηλέφωνο',
        'Έξυπνο',
        'iPhone',
        'Κινητό Τηλέφωνο'
    ],
    '📲': [
        'Κινητό τηλέφωνο με δεξιό βέλος στα αριστερά',
        'Κλήση Τηλεφώνου',
        'Δειγματοληψία Σε Τηλέφωνο'
    ],
    '☎️': [
        'Μαύρο Τηλέφωνο',
        'Περιστροφικό Τηλέφωνο',
        'Κόκκινο'
    ],
    '📞': [
        'Δέκτης Τηλεφώνου',
        'Handset',
        'Τηλέφωνο',
        'Μαύρο'
    ],
    '📟': [
        'Βομβητής',
        'Μπισκότα',
        'Bleeper'
    ],
    '📠': [
        'Μηχανή Φαξ',
        'Facsimile',
        'Φαξ'
    ],
    '🔋': [
        'Μπαταρία',
        'Αντιαεροπορική Μπαταρία',
        'Μπαταρία Τηλεφώνου'
    ],
    '🔌': [
        'Ηλεκτρικό Βούλωμα',
        'AC Adaptor',
        'Καλώδιο Ισχύος',
        'Σύνδεσμος Ισχύος'
    ],
    '💻': [
        'Φορητό',
        'Σημειωματάριο',
        'Προσωπικός Υπολογιστής',
        'PC',
        'MacBook',
        'Επιφάνεια'
    ],
    '🖥️': [
        'Υπολογιστής Επιφάνειας Εργασίας',
        'iMac',
        'PC'
    ],
    '🖨️': ['Εκτυπωτές'],
    '⌨️': ['Keyboard'],
    '🖱️': [
        'Ποντίκι Υπολογιστή',
        'Τρεις Κουμπί Ποντίκι'
    ],
    '🖲️': ['Trackball'],
    '💽': [
        'Δίσκος Υπολογιστή',
        'Minidisc',
        'CD',
        'DVD',
        'Blu-ray',
        'BD'
    ],
    '💾': [
        'Δίσκος Δισκέτας',
        '3.5′′ Δίσκος',
        'Δίσκος'
    ],
    '💿': [
        'Οπτικός Δίσκος',
        'CD',
        'CD-ROM',
        'Συμπαγής Δίσκος'
    ],
    '📀': [
        'DVD',
        'DVD- ROM',
        'Βίντεο DVD'
    ],
    '🎥': [
        'Κάμερα Ταινίας',
        'Φωτογραφική Μηχανή Κινηματογράφου',
        'Χόλιγουντ',
        'Ταινία'
    ],
    '🎞️': ['Πλαίσια Κινηματογράφου'],
    '📽️': ['Προβολέας Κινηματογράφου'],
    '📺': [
        'Τηλεόραση',
        'Τηλεόραση'
    ],
    '📷': ['Ψηφιακή Κάμερα'],
    '📸': ['Κάμερα με Flash'],
    '📹': [
        'Κάμερα Βίντεο',
        'Βιντεοκάμερα'
    ],
    '📼': [
        'Videocassette',
        'ΙΑΣ',
        'VCR',
        'Βιντεοκασέτα',
        'Videocassette'
    ],
    '💳': [
        'Πιστωτική Κάρτα',
        'Χρεωστική Κάρτα',
        'AMEX',
        'Diners Club',
        'American Express',
        'Mastercard',
        'Κάρτα VISA'
    ],
    '📧': [
        'E-mail',
        'E-mail'
    ],
    '📨': [
        'Εισερχόμενος Φάκελος',
        'Φάκελος Με Γραμμές',
        'Γρήγορος Φάκελος'
    ],
    '📩': [
        'Φάκελος με κάτω βέλος πάνω από',
        'Κάτω Βέλος Φάκελος',
        'Εισαγωγή Σε Φάκελο'
    ],
    '📤': ['Δίσκος Εξερχομένων'],
    '📥': ['Τροφοδότης Εισερχομένων'],
    '📮': ['Postbox'],
    '📁': [
        'Φάκελος Αρχείου',
        'Φάκελος',
        'Κατάλογος',
        'Κλειστός Φάκελος Αρχείου'
    ],
    '📂': [
        'Άνοιγμα Φακέλου Αρχείων',
        'Κατάλογος'
    ],
    '🗂️': ['Διαχωριστικά Ευρετηρίου Κάρτας'],
    '📅': [
        'Ημερολόγιο',
        '17 Ιουλίου',
        'Παγκόσμια Ημέρα Emoji'
    ],
    '🗓️': ['Σπείρα Ημερολόγιο Pad'],
    '📆': [
        'Ημερολόγιο Tear-Off',
        'Ημερολόγιο Ημέρας',
        'Ημερολόγιο Γραφείου'
    ],
    '📈': [
        'Αύξηση Γραφήματος',
        'Θετικό Γράφημα',
        'Πάνω Γράφημα Σημείωσης',
        'Γράφημα με τάση προς τα πάνω'
    ],
    '📉': [
        'Μείωση Γραφήματος',
        'Αρνητικό Γράφημα',
        'Κάτω Από Το Γράφημα',
        'Διάγραμμα με τάση προς τα κάτω'
    ],
    '📊': [
        'Γράφημα Ράβδων',
        'Γράφημα Ράβδων'
    ],
    '📌': [
        'Pushpin',
        'Thumb Tack'
    ],
    '📋': ['Πρόχειρο'],
    '📍': [
        'Στρογγυλό Pushpin',
        'Απορρίφθηκε Pin',
        'Καρφίτσωμα Χάρτη',
        'Καρφίτσα',
        'Κόκκινη Καρφίτσα'
    ],
    '📎': [
        'Paperclip',
        'Αποκοπή'
    ],
    '📏': ['Ευθύς Κανόνας'],
    '📐': [
        'Τριγωνικός Κυβερνήτης',
        'Τριγωνικός Κυβερνήτης'
    ],
    '✂️': [
        'Ψαλίδι',
        'Κοπή'
    ],
    '✏️': [
        'Μολύβι',
        'Μολύβι Μολύβι'
    ],
    '✒️': [
        'Μαύρο Νιβ',
        'Πένα Nib',
        'Σιντριβάνι Πένα'
    ],
    '🖋️': [
        'Σιντριβάνι Πένα',
        'Κάτω Αριστερή Κρήνη Πένα'
    ],
    '🖊️': [
        'Πένα',
        'Κάτω Αριστερά Ballpoint Pen',
        'Ballpoint Pen'
    ],
    '🖌️': [
        'Βουρτσάκι',
        'Πινέλο',
        'Κάτω Αριστερή Βουρτσάκι'
    ],
    '🖍️': [
        'Crayon',
        'Κάτω Αριστερά Κραγιόν'
    ],
    '📝': [
        'Υπόμνημα',
        'Memorandum',
        'Σημείωση',
        'Μολύβι Και Χαρτί'
    ],
    '🗑️': [
        'Καλάθι Απορριμμάτων',
        'Δοχείο Απορριμμάτων',
        'Υποδοχή Ρουμπίνας',
        'Κάδος Απορριμμάτων'
    ],
    '📡': ['Δορυφορική Κεραία'],
    '🔭': [
        'Τηλεσκόπιο',
        'Stargazing'
    ],
    '🔬': [
        'Μικροσκόπιο',
        'Magnify',
        'Επιστήμη'
    ],
    '📭': ['Άνοιγμα γραμματοκιβωτίου με Χαμηλότερη Σημαία'],
    '📬': [
        'Άνοιγμα γραμματοκιβωτίου με ανυψωμένη σημαία',
        'Άνοιγμα Γραμματοκιβωτίου'
    ],
    '📪': ['Κλειστό γραμματοκιβώτιο με χαμηλή σημαία'],
    '📫': ['Κλειστό γραμματοκιβώτιο με ανυψωμένη σημαία'],
    '📰': ['Εφημερίδα'],
    '🗞️': [
        'Κύλιση Εφημερίδας',
        'Παράδοση Εφημερίδας'
    ],
    '📄': [
        'Σελίδα Που Αντιμετωπίζει',
        'Εκτυπωμένη Σελίδα'
    ],
    '📜': [
        'Κύλιση',
        'Βαθμός',
        'Parchment'
    ],
    '📃': [
        'Σελίδα με μπούκλα',
        'Curled Page',
        'Curly Page'
    ],
    '📓': [
        'Σημειωματάριο',
        'Μαύρο Και Άσπρο Βιβλίο'
    ],
    '📔': ['Σημειωματάριο με διακοσμητικό κάλυμμα'],
    '📕': [
        'Κλειστό Βιβλίο',
        'Κόκκινο Βιβλίο',
        'Κόκκινο Βιβλίο'
    ],
    '📖': [
        'Άνοιγμα Βιβλίου',
        'Βιβλίο',
        'Νέα'
    ],
    '📗': [
        'Πράσινο Βιβλίο',
        'Πράσινο Βιβλίο'
    ],
    '📘': [
        'Μπλε Βιβλίο',
        'Μπλε Βιβλίο'
    ],
    '📙': [
        'Πορτοκαλί Βιβλίο',
        'Πορτοκαλί Βιβλίο'
    ],
    '📚': [
        'Βιβλία',
        'Σωρός Βιβλίων',
        'Στοίβα Βιβλίων'
    ],
    '🗳️': [
        'Ballot Box με το Ballot',
        'Πλαίσιο Ψηφοφορίας',
        'Ψηφοφορία'
    ],
    '🗄️': [
        'Γραφείο Αρχείου',
        'Γραφείο Καταχώρησης'
    ],
    '🗃️': ['Πλαίσιο Αρχείων Κάρτας'],
    '🖇️': ['Συνδεδεμένα Paperclips']
};
/*clothes and accessories*/
emojis_language[lang][11] = {
    '👣': [
        'Υποτυπώματα',
        'Πόδια',
        'Υποβήματα'
    ],
    '👓': [
        'Γυαλιά',
        'Γυαλιά'
    ],
    '🕶️': ['Γυαλιά ηλίου'],
    '🥽': ['Γυαλιά'],
    '🥼': ['Παλτό Εργαστηρίου'],
    '👔': [
        'Necktie',
        'Επαγγελματικό Μπλουζάκι',
        'Πουκάμισο Και γραβάτα'
    ],
    '👕': [
        'Μπλουζάκι',
        'Πουκάμισο Tee',
        'Μπλουζάκι Polo'
    ],
    '👖': [
        'Τζιν',
        'Ντένιμ',
        'Παντελόνι',
        'Παντελόνια'
    ],
    '🧣': ['Scarf'],
    '🧤': ['Γάντια'],
    '🧥': ['Παλτό'],
    '🧦': ['Socks'],
    '👗': [
        'Φόρεμα',
        'Φούστα',
        'Φτιάξτε'
    ],
    '👘': [
        'Kimono',
        'Φόρεμα Με Δέρμα',
        'Ιαπωνικό Φόρεμα'
    ],
    '👙': [
        'Μπικίνι',
        'Λουτρά',
        'Μαγιό'
    ],
    '🩱': ['Μαγιό Ένα Κομμάτι'],
    '👚': [
        'Γυναικεία Ρούχα',
        'Blouse',
        'Ροζ Πουκάμισο',
        'Blouse'
    ],
    '👛': [
        'Χρέος',
        'Πορτοφόλι'
    ],
    '👜': ['Τσάντα'],
    '👝': [
        'Τσάντα Συμπλέκτη',
        'Συμπλέκτης',
        'Μικρή Τσάντα',
        'Pouch'
    ],
    '🎒': [
        'Σακίδιο',
        'Σάκος',
        'Τσάντα Σχολείου',
        'Σχολείο Satchel',
        'Rucksack'
    ],
    '👞': [
        'Mans Shoe',
        'Παπούτσι',
        'Καφέ Εμφάνιση',
        'Εμφάνιση Φόρεμα'
    ],
    '👟': [
        'Αθλητικό Παπούτσι',
        'Τρέξιμο Παπούτσι',
        'Sneaker',
        'Δρομέας',
        'Εκπαιδευτής',
        'Παπούτσι Τένις'
    ],
    '🥾': ['Πεζοπορία Boot'],
    '🥿': ['Επίπεδη Παπούτσι'],
    '👠': [
        'Υψηλής Αναπηρίας Παπούτσι',
        'Στιλέτο',
        'Υψηλή Τακούνια'
    ],
    '👡': [
        'Γυναικεία Σανδάλι',
        'Σανδάλι Με Κλήση',
        'Saldals'
    ],
    '👢': [
        'Γυναικεία Μπότες',
        'Cowgirl Μπότες',
        'Μπότες Γόνατο Υψηλή',
        'Κεφαλές Μπότες'
    ],
    '👑': [
        'Στέμμα',
        'Ρήγας',
        'Βασίλισσα',
        'Πρίγκιπας',
        'Βασιλικός',
        'Πριγκίπισσα'
    ],
    '👒': [
        'Καπέλο',
        'Καπέλο Γυναικείων',
        'Καπέλο Με Τόξο',
        'Καπέλο Κυρίες'
    ],
    '🎩': [
        'Καπέλο',
        'Επίσημη Ένδυση',
        'Groom'
    ],
    '🎓': [
        'Καπάκι Αποφοίτησης',
        'Κολέγιο',
        'Απόφοιτος',
        'Πίνακας Όλμου',
        'Πανεπιστήμιο',
        'Πλατεία Ακαδημαϊκό Καπέλο'
    ],
    '🧢': [
        'Χρεωμένο Καπέλο',
        'Καπέλο Του Μπέιζμπολ'
    ],
    '⛑️': [
        'Κράνος με Λευκό Σταυρό',
        'Κράνος Εργαζομένων Διάσωσης'
    ],
    '💼': [
        'Χαρτοφύλακες',
        'Κοστούμια'
    ],
    '🎖️': [
        'Μετάλλιο Στρατού',
        'Μετάλλιο',
        'Μετάλλιο',
        'Στρατιωτική Διακόσμηση'
    ],
    '📿': [
        'Χάντρες Προσευχής',
        'Χάντρες Dhikr',
        'Χάντρες Ροζάριο'
    ],
    '🎗️': ['Υπενθύμιση Ribbo'],
    '🤿': ['Μάσκα Κατάδυσης'],
    '🦺': ['Γιλέκο Ασφαλείας'],
    '🥻': [
        'Sari',
        'Saree',
        'Shari'
    ],
    '🩲': ['Σλιπ'],
    '🩳': ['Σορτς'],
    '🛼': [
        'Roller Skate',
        'Ενσωματωμένο Σελάχι',
        'Κύλινδρος Derby'
    ],
    '🩴': [
        'Αναστροφή Πλακέτας',
        'Thong Sandal'
    ],
    '🪖': ['Στρατιωτικό Κράνος'],
    '🩰': [
        'Παπούτσια Μπαλέτου',
        'Παπούτσι Σημείων'
    ]
};
/*hands and parts of body*/
emojis_language[lang][12] = {
    '👋[[*skin_tone*]]': [
        'Αποθήκευση Υπογραφής Χεριών',
        'Αντίο',
        'Κύμα Χειρός',
        'Γεια',
        'Hi'
    ],
    '🖐️[[*skin_tone*]]': [
        'Χέρι με δάχτυλα έπαιξε',
        'Πέντε Χέρι',
        'Χέρι Που Παίζεται',
        'Μεγαλωμένο χέρι με δάχτυλα Splayed'
    ],
    '🤚‍[[*skin_tone*]]‍': [
        'Αυξημένη πίσω πλευρά του χεριού',
        'Πίσω'
    ],
    '✋‍[[*skin_tone*]]‍': [
        'Βελτιωμένο Χέρι',
        'Υψηλή Πέντε',
        'Διακοπή'
    ],
    '🖖‍[[*skin_tone*]]‍': [
        'Vulcan Salute',
        'Spock',
        'Star Trek',
        'Ενισχυμένο χέρι με μέρος μεταξύ της μέσης και δαχτυλίδι δάχτυλα'
    ],
    '👌‍[[*skin_tone*]]‍': [
        'Σημάδι Χεριού OK',
        'Εντάξει',
        'Τέλειο',
        'Ναι'
    ],
    '✌️‍[[*skin_tone*]]‍': [
        'Χέρι Νίκης',
        'Αερόσπασμα',
        'Σημάδι Ειρήνης',
        'V Υπογραφή'
    ],
    '🤞‍[[*skin_tone*]]‍': [
        'Διασχισμένα Δάχτυλα',
        'Δάχτυλα Διασχισμένα',
        'Καλή Τύχη',
        'Χέρι με Ευρετήριο και Μεσαία Δάχτυλα Διασχισμένα'
    ],
    '🤟‍[[*skin_tone*]]‍': [
        'Χειρονομία Αγάπης-Εσείς',
        'Σας Αγαπώ Το Χέρι Υπογραφή'
    ],
    '🤘‍[[*skin_tone*]]‍': [
        'Σημάδι από τα κέρατα',
        'Διάβολος Δάχτυλα',
        'Βαρύ Μέταλλο',
        'Ροκ Ενεργό'
    ],
    '🤙‍[[*skin_tone*]]‍': [
        'Καλέστε Με Το Χέρι Υπογραφή',
        'Χέρι Τηλεφώνου',
        'Shaka'
    ],
    '🤏‍[[*skin_tone*]]‍': ['Τσιμπώντας Χέρι'],
    '👈‍[[*skin_tone*]]‍': [
        'Πίσω Ευρετήριο Βαθμολόγησης Αριστερά',
        'Λευκό Αριστερό Σημείο Δείκτης Πίσω'
    ],
    '👉‍[[*skin_tone*]]‍': [
        'Πίσω Ευρετήριο Δειγματοληψίας Δεξιά',
        'Άσπρο Δεξί Δείκτης Ενδείξεων Πίσω'
    ],
    '👆‍[[*skin_tone*]]‍': [
        'Πίσω Ευρετήριο Πάνω',
        'Λευκή Σημείωση Δείκτης Πίσω',
        'Μεσαίο Δάχτυλο'
    ],
    '👇‍[[*skin_tone*]]‍': [
        'Πίσω Ευρετήριο Βαθμολόγησης Κάτω',
        'Λευκό Κάτω Βαθμολογία Πίσω Ευρετήριο',
        'Βαθμολογία Κάτω'
    ],
    '☝‍[[*skin_tone*]]‍️': [
        'Δείκτης Δάχτυλου Που Εντάσσεται',
        'Δείκτης Λευκής Ανίχνευσης',
        'Μυστικό'
    ],
    '🖕‍[[*skin_tone*]]‍': [
        'Μεσαίο Δάχτυλο',
        'Αναποδογύρισμα Του Πουλιού',
        'Γυμνό Δάχτυλο',
        'Αντίστροφο χέρι με Middle Finger Extended'
    ],
    '👍‍[[*skin_tone*]]‍': [
        'Εγγραφή Μικρογραφίας',
        'Αρέσει',
        'Ναι'
    ],
    '👎‍[[*skin_tone*]]‍': [
        'Υπογραφή Μικρογραφιών',
        'Κακό',
        'Dislike',
        'Όχι'
    ],
    '✊‍[[*skin_tone*]]‍': [
        'Αυξημένη Γροθιά',
        'Αντλία Fist'
    ],
    '👊‍[[*skin_tone*]]‍': [
        'Επόμενη Γροθιά',
        'Bro Fist',
        'Brofist',
        'Fist Bump',
        'Γροθιά',
        'Κλειστή Γροθιά',
        'Παγωμένη Σημάδι Χεριών'
    ],
    '🤛‍[[*skin_tone*]]‍': ['Αριστερό Χτύπημα Γροθιάς'],
    '🤜‍[[*skin_tone*]]‍': ['Δεξιά Γροθιά Χτύπημα'],
    '🤌‍[[*skin_tone*]]‍': [
        'Τσιμπημένα Δάχτυλα',
        'Ma Che Vuoi',
        'Δακτύλιος Χρέος'
    ],
    '👏‍[[*skin_tone*]]‍': [
        'Σφραγίδα Χέρια',
        'Χειροκροτήματα',
        'Clap',
        'Σύλληψη',
        'Ράβδος Γκολφ',
        'Γύρος Χειροκροτήματα'
    ],
    '🙌‍[[*skin_tone*]]‍': [
        'Άτομο που σηκώνει και τα δύο χέρια στη γιορτή',
        'Ανύψωση Χέρια',
        'Όπλα Στον Αέρα',
        'Banzai',
        'Festivus Miracle',
        'Hallelujah',
        'Επαληθεύστε Τα Χέρια',
        'Δύο Χέρια'
    ],
    '👐‍[[*skin_tone*]]‍': [
        'Άνοιγμα Σημάδι Χέρια',
        'Αγκαλιά',
        'Χέρια Τζαζ'
    ],
    '🤲‍[[*skin_tone*]]‍': [
        'Palms Up Together',
        'Dua'
    ],
    '🤝‍[[*skin_tone*]]‍': [
        'Handshake',
        'Χέρια Κουνήματος'
    ],
    '🙏‍[[*skin_tone*]]‍': [
        'Πτυσσόμενα Χέρια',
        'Namaste',
        'Παρακαλώ',
        'Προσευχή',
        'Σας Ευχαριστούμε',
        'Πρόσωπο με πτυσσόμενα χέρια'
    ],
    '✍‍[[*skin_tone*]]‍️': ['Χέρι Γραφής'],
    '💪‍[[*skin_tone*]]‍': [
        'Flexed Biceps',
        'Διάσπαση Των Μυών Βραχίονα',
        'Musle',
        'Ισχυρός'
    ],
    '🦵‍[[*skin_tone*]]‍': ['Σπόδι'],
    '🦶‍[[*skin_tone*]]‍': ['Πόδι'],
    '👂‍[[*skin_tone*]]‍': [
        'Αυτί',
        'Αυτιά',
        'Ακρόαση',
        'Ακρόαση'
    ],
    '👃‍[[*skin_tone*]]‍': [
        'Μύτη',
        'Μυρωδιά',
        'Sniffing',
        'Stinky'
    ],
    '🧠': ['Εγκέφαλος'],
    '🦷': ['Δόντι'],
    '👀': [
        'Μάτια',
        'Οφθαλμοί',
        'Αυξημένα Μάτια',
        'Σοφά Μάτια'
    ],
    '👁️': [
        'Μάτι',
        'Απλό Μάτι'
    ],
    '👅': ['Έξοδος Γλώσσας'],
    '👄': [
        'Στόμα',
        'Φιλιά Χείλη',
        'Χείλη'
    ],
    '🫀': ['Ανατομική Καρδιά'],
    '🫁': ['πνεύμονες'],
    '🦾': ['Μηχανικός Βραχίονας'],
    '🦿': ['Μηχανικό Πέλμα']
};
/*other*/
emojis_language[lang][13] = {
    '💩': [
        'Σωρός του Poo',
        'Χώμα Σκύλου',
        'Χαμογελαστό Βρόχο'
    ],
    '💋': [
        'Μάρκο Φιλί',
        'Φιλιά Χείλη'
    ],
    '💅': [
        'Πολωνικά Νύχια',
        'Δάχτυλα',
        'Manicure',
        'Nonchalant'
    ],
    '🤳': [
        'Selfie',
        'Κάμερα Τηλεφώνου',
        'Χέρι Selfie'
    ],
    '🦴': ['Κόκαλο'],
    '🧳': [
        'Αποσκευές',
        'Κοστούμια'
    ],
    '🌂': [
        'Κλειστή Ομπρέλα',
        'Σύμπτυξη Ομπρέλλας',
        'Ροζ Ομπρέλα'
    ],
    '☂️': ['Ομπρέλα'],
    '☔': [
        'Ομπρέλα με σταγόνες βροχής',
        'Βροχή',
        'Rainy'
    ],
    '🧵': ['Κόλπος του νήματος'],
    '🧶': ['Μπάλα του Νήματος'],
    '💄': [
        'Lipstick',
        'Lip Gloss',
        'Μακιγιάζ'
    ],
    '💍': [
        'Κουδούνισμα',
        'Διαμαντένιο Δαχτυλίδι',
        'Δακτύλιος Δέσμευσης'
    ],
    '💥': [
        'Σύμβολο Σύγκρουσης',
        'Μπανγκ',
        'Έκρηξη',
        'Επιπτώσεις',
        'Κόκκινος Σπαρνς',
        'Έκρηξη'
    ],
    '💫': [
        'Σύμβολο Dizzy',
        'Κύκλος Και Αστέρι'
    ],
    '💦': [
        'Σύμβολο Splashing Sweat',
        'Δεσμεύσεις',
        'Πλεονεκτήματα Νερού',
        'Σταγόνες Νερού'
    ],
    '💨': [
        'Dashing Μακριά',
        'Γρήγορη',
        'Ατμός',
        'Ατμόπλοιο',
        'Άνεμος',
        'Dash Σύμβολο',
        'Σκουπίδια του ανέμου'
    ],
    '🌬️': [
        'Πρόσωπο Ανέμου',
        'Ισχυρός Άνεμος',
        'Μητέρα Φύση',
        'Άνεμος Blowing Πρόσωπο'
    ],
    '🐾': [
        'Εκτυπώσεις Paw',
        'Εκτυπώσεις Paw Γάτας',
        'Σκύλος Paw Εκτυπώσεις',
        'Kitten Paw Εκτυπώνει',
        'Puppy Paw Εκτυπώσεις'
    ],
    '🕸️': [
        'Ιστός Αράχνης',
        'Cobweb',
        'Ιστός',
        'Spiderweb'
    ],
    '🦠': [
        'Μικρόβιλος',
        'Κελί',
        'Coronavirus',
        'COVID-19',
        'Γάμι',
        'Μικροοργανισμός',
        'Ιός'
    ],
    '💐': ['Μπουκέτο Λουλουδιών'],
    '🌍': [
        'Παρουσίαση Ευρώπης-Αφρικής',
        'Γη',
        'Σφαίρα',
        'Πλανήτης',
        'Κόσμος',
        'Παρουσίαση Ευρώπης και Αφρικής'
    ],
    '🌎': [
        'Παρουσίαση Της Αμερικής',
        'Γη',
        'Σφαίρα',
        'Πλανήτης',
        'Κόσμος'
    ],
    '🌏': [
        'Εμφάνιση Ασίας-Αυστραλίας',
        'Γη',
        'Σφαίρα',
        'Πλανήτης',
        'Κόσμος',
        'Εμφάνιση Ασίας και Αυστραλίας'
    ],
    '🌐': [
        'Globe με Meridians',
        'Διαδίκτυο',
        'World Wide Web',
        'ΔΔΔ'
    ],
    '🌑': [
        'Σύμβολο Νέας Σελήνης',
        'Σκοτεινή Σελήνη',
        'Σελήνη Σκιάς',
        'Ηλιακή Έκλειψη'
    ],
    '🌒': ['Σύμβολο Ημισελήνου Σελήνης Waxing'],
    '🌓': ['Σύμβολο Πρώτου Τρίμηνου Σελήνης'],
    '🌔': ['Σύμβολο Αμφίβολης Σελήνης Waxing'],
    '🌕': ['Σύμβολο Πανσελήνης'],
    '🌖': ['Σύμβολο Αμφίβολης Σελήνης'],
    '🌗': ['Σύμβολο Τελευταίου Τρίμηνου Σελήνης'],
    '🌘': ['Σύμβολο Της Ημισελήνου Φεγγαριών'],
    '🌙': ['Ημισέληνος Σελήνης'],
    '🌚': [
        'Νέα Σελήνη με Πρόσωπο',
        'Ανατριχιαστική Σελήνη',
        'Πρόσωπο Σκούρο Φεγγάρι',
        'Χονδρική Σελήνη'
    ],
    '🌝': [
        'Πανσέληνος με πρόσωπο',
        'Moonface',
        'Smiley Σελήνη',
        'Χαμογελώντας Σελήνη'
    ],
    '🌛': ['Πρώτο τρίμηνο Σελήνης με Πρόσωπο'],
    '🌜': ['Τελευταία Σελήνη Τρίμηνο με Πρόσωπο'],
    '🌞': [
        'Ήλιος με πρόσωπο',
        'Smiley Κυρ',
        'Sunface',
        'Χαμογελώντας Ήλιος'
    ],
    '☀️': [
        'Κυρ',
        'Ηλιοφάνεια'
    ],
    '⭐': [
        'Αστέρι',
        'Λευκό Μεσαίο Αστέρι'
    ],
    '🌟': [
        'Λαμπερό Αστέρι',
        'Φωτεινό Αστέρι'
    ],
    '☁️': [
        'Σύννεφο',
        'Συννεφιά',
        'Overcast'
    ],
    '⛅': ['Ο Ήλιος Πίσω Από Το Σύννεφο'],
    '⛈️': [
        'Σύννεφο με Lightning και βροχή',
        'Thunder Cloud και βροχή'
    ],
    '🌤️': ['Λευκός ήλιος με μικρό σύννεφο'],
    '🌥️': [
        'Ήλιος Πίσω Από Μεγάλο Σύννεφο',
        'Λευκό Ήλιο Πίσω Από Το Σύννεφο'
    ],
    '🌦️': ['Λευκό ήλιο πίσω από το σύννεφο με βροχή'],
    '🌧️': ['Σύννεφο με βροχή'],
    '🌨️': ['Σύννεφο με χιόνι'],
    '🌩️': ['Σύννεφο με Lightning'],
    '🌪️': [
        'Ανεμοστρόβιλος',
        'Σύννεφο με Tornado'
    ],
    '🌫️': ['Fog'],
    '🌈': [
        'Ουράνιο Τόξο',
        'Ομοφυλοφιλική Υπερηφάνεια',
        'Πρωτεύον Ουράνιο Τόξο'
    ],
    '❄️': [
        'Νιφάδα Χιονιού',
        'Χιόνι',
        'Χιόνι'
    ],
    '🌀': [
        'Κυκλόνη',
        'Τυφώνας',
        'Σπείρα',
        'Περιστροφή',
        'Ανεμοστρόβιλος'
    ],
    '⚡': [
        'Σημάδι Υψηλής Τάσης',
        'Μπουλόνι Lightning',
        'Thunderbolt',
        'Υψηλή Τάση'
    ],
    '☃️': [
        'Χιονάνθρωπος',
        'Χιονάνθρωπος με νιφάδες χιονιού'
    ],
    '⛄': [
        'Χιονάνθρωπος Χωρίς Χιόνι',
        'Frosty Ο Χιονάνθρωπος',
        'Olaf',
        'Χιονάνθρωπος'
    ],
    '☄️': ['Κομήτης'],
    '🔥': [
        'Φωτιά',
        'Φλόγα',
        'Ζεστό',
        'Lit',
        'Στιγμιότυπο'
    ],
    '💧': [
        'Droplet',
        'Νερό',
        'Πτώση Νερού'
    ],
    '✨': [
        'Σπινθήρες',
        'Γκλίτερ',
        'Shiny',
        'Νέο'
    ],
    '🌊': [
        'Κύμα Νερού',
        'Παραλία',
        'Ωκεάνιο Κύμα',
        'Θάλασσα'
    ],
    '🎄': [
        'Χριστουγεννιάτικο Δέντρο',
        'Χριστούγεννα',
        'Δέντρο Χριστουγέννων'
    ],
    '🎃': [
        'Jack-O-Φανάρι',
        'Halloween',
        'Κολοκύθα'
    ],
    '🌻': [
        'Ηλίανθος',
        'Κίτρινο Λουλούδι'
    ],
    '🌼': [
        'Blossom',
        'Άνθος Λουλούδι',
        'Daisy',
        'Κίτρινο Λουλούδι'
    ],
    '🌷': ['Tulip'],
    '🌹': [
        'Τριαντάφυλλο Λουλούδι',
        'Κόκκινο Τριαντάφυλλο'
    ],
    '☘️': [
        'Σαμπουάν',
        'Τριφύλλι',
        'Trefoil'
    ],
    '🍀': [
        'Τριφύλλι Τέσσερα Φύλλα',
        'Τριφύλλι',
        'Ιρλανδία',
        'Τυχερός',
        'Τύχες'
    ],
    '🌸': [
        'Cherry Blossom',
        'Ροζ Λουλούδι',
        'Sakura'
    ],
    '💮': [
        'Λευκό Λουλούδι',
        'Cherry Blossom',
        'Χαρτί Doily',
        'Καλά Έγινε Σφραγίδα'
    ],
    '🌺': ['Hibiscus'],
    '🏵️': ['Ροζέτα'],
    '🌱': [
        'Σπόρος',
        'Άνοιξη',
        'Sprout',
        'Λαχανάκια'
    ],
    '🌲': [
        'Evergreen Δέντρο',
        'Δέντρο Ελαφιού',
        'Δέντρο Πεύκου'
    ],
    '🌳': [
        'Αποφασιστικό Δέντρο',
        'Στρογγυλεμένο Δέντρο'
    ],
    '🌴': [
        'Δέντρο Φοίνικας',
        'Δέντρο Καρύδας'
    ],
    '🎋': [
        'Δέντρο Tanabata',
        'Tanabata',
        'Δέντρο Επιθυμιών'
    ],
    '🎍': [
        'Διακόσμηση Πεύκου',
        'Μπαμπού',
        'Kadomatsu',
        'Διακόσμηση Νέου Έτους'
    ],
    '🌵': [
        'Cactus',
        'Desert'
    ],
    '🌾': [
        'Φύλλο του ρυζιού',
        'Περικοπή',
        'Γεωργία',
        'Σίτος',
        'Αυτί του ρυζιού'
    ],
    '🌿': [
        'Βότανα',
        'Περικοπή',
        'Φυτό'
    ],
    '🍁': [
        'Φύλλο Maple',
        'Καναδάς',
        'Καναδική',
        'Μοίρες'
    ],
    '🍂': [
        'Φύλλο Fallen',
        'Φύλλο Φθινοπώρου',
        'Φύλλα Φθινοπώρου',
        'Καφέ Φύλλα',
        'Φύλλα Πτώσης',
        'Πεσμένα Φύλλα'
    ],
    '🍃': [
        'Φύλλο Fluttering σε Wind',
        'Πράσινα Φύλλα',
        'Άνοιξη'
    ],
    '🪴': ['Φυτό Potted'],
    '🔑': [
        'Κλειδί',
        'Χρυσό Κλειδί'
    ],
    '🗝️': ['Παλιό Κλειδί'],
    '🔨': [
        'Σφυρί',
        'Σφυρί Claw',
        'Handyman',
        'Εργαλείο'
    ],
    '⛏️': [
        'Επιλέξτε',
        'Αξίνα'
    ],
    '🪓': ['Τσεκούρια'],
    '🪚': ['Πριόνι Ξυλουργικής'],
    '🪛': ['Κατσαβίδι'],
    '🪝': ['Άγκιστρο'],
    '🪠': ['Plunger'],
    '🪣': ['Κουβάς'],
    '🔩': [
        'Καρύδα και Bolt',
        'Bolt',
        'Βίδα'
    ],
    '🗜️': [
        'Σφιγκτήρας',
        'Πίνακας Vice',
        'WinZip',
        'Συμπίεση'
    ],
    '🔒': [
        'Κλειδωμένο',
        'Κλειδαριά Κλειδώματος',
        'Padlock'
    ],
    '🔓': [
        'Ξεκλείδωτο',
        'Άνοιγμα Padlock',
        'Άνοιγμα Κλειδώματος'
    ],
    '🔏': [
        'Κλειδωμένο με στυλό',
        'Κλείδωμα Και Πένα',
        'Κλειδαριά Με Σιντριβάνι Στυλό',
        'Κλείδωμα με στυλό μελάνης'
    ],
    '🔐': [
        'Κλειδωμένο με κλειδί',
        'Κλειδαριά κλειδώματος με κλειδί'
    ],
    '🗡️': [
        'Dagger',
        'Όπλο Μαχαίρι'
    ],
    '⚔️': ['Διασχισμένα Σπαθιά'],
    '🔫': [
        'Pistol',
        'Όπλο',
        'Περίστροφο',
        'Όπλο Μπλουζών',
        'Όπλο Νερού',
        'Πιστόλι Νερού'
    ],
    '🧰': ['Εργαλειοθήκη'],
    '🧲': ['Μαγνήτης'],
    '⛓️': ['Αλυσίδες'],
    '💉': [
        'Syringe',
        'Δωρεά Αίματος',
        'Δοκιμή Αίματος',
        'Βελόνα',
        'Εμβολιασμός'
    ],
    '🧬': [
        'DNA',
        'DNA Double Helix'
    ],
    '🧪': ['Σωλήνας Δοκιμής'],
    '🛏️': [
        'Κρεβάτι',
        'Υπνοδωμάτιο'
    ],
    '🛋️': [
        'Καναπές και λάμπα',
        'Σαλόνι',
        'Ρύθμιση',
        'Καναπές'
    ],
    '🪑': ['Καρέκλα'],
    '🚪': [
        'Πόρτα',
        'Πόρτα',
        'Μπροστινή Πόρτα'
    ],
    '🪟': ['Παράθυρο'],
    '🪜': ['Σκάλα'],
    '🪞': ['Καθρέφτης'],
    '🚽': [
        'Τουαλέτα',
        'Μπάνιο',
        'Loo',
        'Restroom',
        'WC'
    ],
    '🚿': [
        'Ντους',
        'Κεφαλή Ντους'
    ],
    '🛁': [
        'Μπανιέρα',
        'Μπάνιο Με Φούσκα'
    ],
    '🧴': ['Φιάλη Λοσιόν'],
    '🧷': ['Καρφίτσα Ασφαλείας'],
    '🧺': ['Καλάθι'],
    '🧻': [
        'Ρόλος του χαρτιού',
        'Χαρτί Χαρτί Χαρτί'
    ],
    '🧼': ['Ράβδος του σαπουνιού'],
    '🧽': ['Σφουγγάρι'],
    '🧯': ['Πυροσβεστήρας'],
    '🚬': [
        'Τσιγάρα',
        'Σύμβολο Καπνού'
    ],
    '⚰️': [
        'Φέρετρο',
        'Casket',
        'Κηδεία'
    ],
    '⚱️': [
        'Ουρά Κηδείας',
        'Βάζο'
    ],
    '🛡️': ['Ασπίδα'],
    '⚙️': [
        'Εργαλείο',
        'Ρυθμίσεις',
        'Επιλογές'
    ],
    '⚖️': [
        'Κλίμακα Ισορροπίας',
        'Κλίμακες της δικαιοσύνης'
    ],
    '🔗': [
        'Σύνδεσμος',
        'Αλυσίδα',
        'Υπερσύνδεσμος',
        'Συνδεδεμένη Αλυσίδα'
    ],
    '💀': [
        'Κρανίο',
        'Θάνατος',
        'Γκρι Κρανίο',
        'Σκελετός'
    ],
    '☠️': ['Κρανίο και Σταυροκόκαλα'],
    '🦻': ['Αυτί με βαρηκοΐα'],
    '🎡': [
        'Τροχός Τροχού',
        'Μεγάλος Τροχός',
        'Fairgroundl',
        'Παρατήρηση Τροχού'
    ],
    '⛽': [
        'Αντλία Καυσίμου',
        'Πετρέλαιο',
        'Βενζίνη',
        'Αέριο'
    ],
    '🚨': [
        'Αστυνομία Αυτοκίνητα Περιστρεφόμενο Φως',
        'Φως Έκτακτης Ανάγκης',
        'Φως Που Αναβοσβήνει',
        'Siren'
    ],
    '🚥': ['Φως Οριζόντιας Κυκλοφορίας'],
    '🚦': ['Φως Κατακόρυφης Κυκλοφορίας'],
    '⚓': [
        'Αγκυροβολία Ναυάρχου Μοτίβο',
        'Ψαράς'
    ],
    '🚧': [
        'Υπογραφή Κατασκευής',
        'Μαύρο Και Κίτρινο Ριγέ Σημάδι'
    ],
    '🪂': ['Parachute'],
    '💺': [
        'Έδρα',
        'Λεωφορείο Αεροπλάνο Τρένο Αεροπλάνο'
    ],
    '🪐': ['Κρόνος'],
    '🎆': [
        'Πυροτεχνήματα',
        'Έκρηξη'
    ],
    '🎇': [
        'Senko Hanabi',
        'Πυροτέχνημα Sparkler'
    ],
    '💷': [
        'Τραπεζογραμμάτιο Λίρας',
        '£20 Σημείωση',
        'Είκοσι Γρήγορη Σημείωση',
        'Τραπεζογραμμάτιο με σημάδι λίρας'
    ],
    '💶': [
        'Euro Banknote',
        '€100 Σημείωση',
        'Τραπεζογραμμάτιο με Ευρώ'
    ],
    '💵': [
        'Τραπεζογραμμάτιο Δολαρίου',
        '$1 Σημείωση',
        'Banknote with Dollar Sign',
        'Λογαριασμός Δολαρίου',
        'Δολάριο Αμερικής'
    ],
    '💴': [
        'Τραπεζογραμμάτιο Γιεν',
        '◆ Σημείωση 1000',
        'Σημείωση Yen',
        'Banknote with Yen Sign'
    ],
    '⛺': ['Σκηνή Κατασκήνωσης'],
    '⛲': [
        'Κρήνη',
        'Χαρακτηριστικό Νερό',
        'Πηγή Νερού',
        'Πάρκο'
    ],
    '💰': [
        'Τσάντα Χρήματος',
        'Moneybags',
        'Πλούσιο',
        '$'
    ],
    '🏷️': ['Ετικέτα Ετικέτας'],
    '🔖': [
        'Σελιδοδείκτης',
        'Ετικέτα Τιμής',
        'Ετικέτα'
    ],
    '📑': ['Καρτέλες Σελιδοδεικτών'],
    '📯': [
        'Ταχυδρομικό Κέρας',
        'Bugle',
        'Γαλλικό Κέρας'
    ],
    '🪁': ['Kite'],
    '🪀': ['Γιο-Γιο'],
    '🎊': [
        'Confetti Ball',
        'Confetti'
    ],
    '🎉': [
        'Πάρτυ Popper',
        'Εορτασμός',
        'Καπέλο Πάρτυ'
    ],
    '🎈': [
        'Μπαλόνι',
        'Πάρτι',
        'Κόκκινο Μπαλόνι'
    ],
    '🌡️': [
        'Θερμόμετρο',
        'Ζεστός Καιρός',
        'Θερμοκρασία'
    ],
    '🛢️': ['Βαρέλι Πετρελαίου'],
    '💣': ['Βόμβα'],
    '🔪': [
        'Μαχαίρι Κουζίνας',
        'Μαχαίρι',
        'Μαχαίρι Κρεοπωλών',
        'Hocho'
    ],
    '🏺': [
        'Amphora',
        'Βάζο',
        'Βάζο'
    ],
    '🗺️': ['Παγκόσμιος Χάρτης'],
    '🎼': [
        'Μουσική Βαθμολογία',
        'Μουσική Φύλλων',
        'Treble Clef'
    ],
    '🎬': [
        'Πίνακας Clapper',
        'Αποκοπή',
        'Ενέργεια',
        'Διευθυντής',
        'Υλικό Κινηματογράφου'
    ],
    '🎻': [
        'Βιολίνη',
        'Κουαρτέτο Συμβολοσειράς',
        'Το Μικρότερο Βιολίνο Του Κόσμου'
    ],
    '🎺': [
        'Τρομπέτα',
        'Κέρατο',
        'Τζαζ'
    ],
    '🎸': [
        'Κιθάρα',
        'Ακουστική Κιθάρα',
        'Κιθάρα Μπάσου',
        'Ηλεκτρική Κιθάρα'
    ],
    '🎷': [
        'Σαξόφωνο',
        'Τζαζ',
        'Sax'
    ],
    '🥁': [
        'Τύμπανο',
        'Τύμπανο με drumsticks'
    ],
    '🎹': [
        'Πιάνο',
        'Μουσικό Πληκτρολόγιο'
    ],
    '🪕': ['Μπάνζο'],
    '🪗': ['Ακορντεόν'],
    '🪘': ['Μακρύ Τύμπανο'],
    '🎨': [
        'Παλέτα Καλλιτέχνη',
        'Τέχνη',
        'Ζωγραφική'
    ],
    '🧩': [
        'Κομμάτι Παζλ',
        'Κομμάτι Παζλ'
    ],
    '🎲': [
        'Πέθανε Παιχνιδιού',
        'Ζάρια'
    ],
    '🎭': [
        'Ερμηνεία Τεχνών',
        'Θέατρο',
        'Θέατρο',
        'Μάσκες Δράμας',
        'Μάσκες Για Θέατρο',
        'Μάσκες Τραγωδίας και Κωμωδίας',
        'Βενετία'
    ],
    '🔍': [
        'Μεγεθυντικό Γυαλί Πλακέ Αριστερά',
        'Magnifier',
        'Εικονίδιο Αναζήτησης',
        'Αριστερό Σημείο Μεγεθυντικό Γυαλί',
        'Εύρεση'
    ],
    '🔎': [
        'Μεγεθυντικό Γυαλί Που Κλιαρίζεται Δεξιά',
        'Magnifier',
        'Εικονίδιο Αναζήτησης',
        'Μεγεθυντικό Γυαλί Δεξιάς Σημείωσης',
        'Εύρεση'
    ],
    '⌛': [
        'Hourglass Done',
        'Hourglass'
    ],
    '⏳': [
        'Hourglass Δεν Έγινε',
        'Hourglass με ρέοντας άμμο'
    ],
    '🕐': [
        'Ένα Ωράριο',
        'Ρολόι Πρόσωπο Ένα O\'Clock'
    ],
    '🕜': ['Ρολόι Πρόσωπο One-Thirty'],
    '🕑': [
        'Δύο Ωράριο',
        'Ρολόι Πρόσωπο Δύο O\'Clock'
    ],
    '🕝': ['Ρολόι Πρόσωπο Δύο-Τριάντα'],
    '🕒': [
        'Τρία Ωράριο',
        'Ρολόι Πρόσωπο Τρεις O\'Clock'
    ],
    '🕞': ['Ρολόι Πρόσωπο Τρία-Τριάντα'],
    '🕓': [
        'Τέσσερα Ωραία',
        'Ρολόι Πρόσωπο Τέσσερα O\'Clock'
    ],
    '🕟': ['Ρολόι Πρόσωπο Τέσσερι-Τριάντα'],
    '🕔': [
        'Πέντε Ωραία',
        'Ρολόι Πρόσωπο Πέντε Ωραία'
    ],
    '🕠': ['Πέντε-Τριάντα Πρόσωπο Ρολογιού'],
    '🕕': [
        'Έξι Ω Ρολόι',
        'Ρολόι Πρόσωπο Έξι Ω Ρολόι'
    ],
    '🕡': ['Πρόσωπο Ρολόι Έξι-Τριάντα'],
    '🕖': [
        'Επτά Ωράριο',
        'Ρολόι Πρόσωπο Επτά Το Ρολόι'
    ],
    '🕢': ['Ρολόι Πρόσωπο Επτά-Τριάντα'],
    '🕗': [
        'Οκτώ Ωραίο Ρολόι',
        'Οχτώ Προσώπου Ρολόι'
    ],
    '🕣': ['Ογδόντα-Τριάντα Προσώπου Ρολογιού'],
    '🕘': [
        'Εννιά Ω\'Ρολόι',
        'Ρολόι Πρόσωπο Εννέα O\'Clock'
    ],
    '🕤': ['Πρόσωπο Ρολόι Εννοί-Τριάντα'],
    '🕙': [
        'Δέκα Ωράριο',
        'Δέκα Προσώπου Ρολογιού'
    ],
    '🕥': ['Ρολόι Πρόσωπο Δεν-Τριάντα'],
    '🕚': [
        'Έντεκα Ωράριο',
        'Ρολόι Πρόσωπο Έντεκα O\'Clock'
    ],
    '🕦': ['Ρολόι Πρόσωπο Έντεκα Τριάντα'],
    '🕛': [
        'Δώδεκα Ωράριο',
        'Ρολόι Πρόσωπο Δώδεκα O\'Clock'
    ],
    '🕧': ['Ρολόι Πρόσωπο Δώδεκα-Τριάντα'],
    '♨️': [
        'Καυτά ελατήρια',
        'Onsen',
        'Ατμός'
    ],
    '💈': [
        'Κόμβος Πολωνός',
        'Κατάστημα Barber',
        'Ρίγες Του Barber',
        'Κομμωτήριο'
    ],
    '🎪': [
        'Σκηνή Τσίρκου',
        'Μεγάλη Κορυφή',
        'Τσίρκο'
    ],
    '💢': [
        'Σύμβολο Θυμού',
        'Σημάδι Οργής',
        'Λαχανικό Ποπ'
    ],
    '🗯️': [
        'Δεξιά Φούσκα Θυμού',
        'Zig Zag Bubble',
        'Θυμωμένος Φούσκα Ομιλίας'
    ],
    '💊': [
        'Pill',
        'Καψάκιο',
        'Δισκίο',
        'Ναρκωτικά'
    ],
    '🎎': [
        'Κούκλες',
        'Hinamatsuri',
        'Αυτοκρατορική Κούκλες',
        'Ιαπωνικές Κούκλες'
    ],
    '🎏': [
        'Ροή Carp',
        'Σημαία Ψαριών',
        'Koinobori',
        'Κάλτσες Ανέμου'
    ],
    '🎐': [
        'Καντράν Ανέμου',
        'Furin',
        'Μέδουσες',
        'Κουδούνι Ανέμου'
    ],
    '🎀': [
        'Κορδέλα Τόξο',
        'Ροζ Τόξο',
        'Τόξο'
    ],
    '🎁': [
        'Τυλιγμένο Δώρο',
        'Παρόν Γενεθλίων',
        'Χριστουγεννιάτικο Δώρο',
        'Δώρο',
        'Κουτί Δώρου',
        'Παρόν',
        'Περιτυλιγμένο Παρόν'
    ],
    '🎫': [
        'Αίτημα',
        'Stub Αιτήματος',
        'Εισιτήριο World Tour'
    ],
    '🃏': [
        'Τζόκερ',
        'Κάρτα Joker',
        'Παίζοντας Κάρτα Μαύρο Τζόκερ'
    ],
    '💡': [
        'Λαμπτήρας Φωτός',
        'Ιδέα',
        'Ηλεκτρικός Λαμπτήρας'
    ],
    '🔦': [
        'Φακός',
        'Φακός',
        'Ηλεκτρικός Φακός'
    ],
    '🏮': [
        'Φανάρι Κόκκινου Χαρτιού',
        'Ασιατικό Φανάρι',
        'Ιαπωνικό Φανάρι',
        'Κόκκινο Φανάρι',
        'Φανάρι Izakaya'
    ],
    '📦': [
        'Πακέτο',
        'Κουτί',
        'Δέμα'
    ],
    '📇': [
        'Κάρτα Ευρετηρίου',
        'Rolodex',
        'Κάρτα Συστήματος',
        'Ευρετήριο Κάρτας'
    ],
    '🕳️': ['Τρύπα'],
    '👁️‍🗨️': [
        'Είμαι Ένας Μάρτυρας',
        'Μάτι σε ομιλία Φούσκα'
    ],
    '⚜️': [
        'Fleur-de-lis',
        'Προσκόπια',
        'Άγιοι Της Νέας Ορλεάνης'
    ],
    '⚗️': ['Alembic'],
    '🕯️': ['Κερί'],
    '🖼️': [
        'Πλαισιωμένη Εικόνα',
        'Ζωγραφική',
        'Πλαίσιο Εικόνας',
        'Πλαίσιο με εικόνα'
    ],
    '🛍️': ['Ψώνια Τσάντες'],
    '🎟️': ['Αιτήματα Εισαγωγής'],
    '🛎️': ['Bellhop Bell'],
    '🧾': ['Απόδειξη'],
    '🧮': ['Abacus'],
    '🧫': ['Πιάτο Petri'],
    '🧹': [
        'Σκούρο',
        'Πινέλο',
        'Σάρωση'
    ],
    '🎰': [
        'Κουλοχέρη',
        'Καζίνο',
        'Μηχανή Φρούτων',
        'Τυχερός',
        'Μηχανή Πόκερ'
    ],
    '🦽': ['Χειροκίνητη αναπηρική καρέκλα'],
    '🦼': ['Μηχανοκίνητη Αναπηρική Καρέκλα'],
    '🪔': ['Λαμπτήρας Diya'],
    '🦯': ['White Cane'],
    '🩸': ['Πτώση του αίματος'],
    '🩹': ['Κολλητικό Επίδεσμο'],
    '🩺': ['Στεθοσκόπιο'],
    '🪶': ['Φτερό'],
    '🪤': ['Παγίδα Ποντικιού'],
    '🫖': ['Teapot'],
    '🪨': ['Ροκ'],
    '🪵': ['Ξύλο'],
    '🪄': ['Μαγικό Ραβδί'],
    '🪅': ['Πινγκάτα'],
    '🪆': [
        'Εμφιαλώνοντας Κούκλες',
        'Matryoshka'
    ],
    '🪡': ['Βελόνα Ράψιμο'],
    '🪢': ['Κόμβος'],
    '🪙': ['Κέρμα'],
    '🪃': ['Boomerang'],
    '🪥': ['Οδοντόβουρτσα'],
    '🪦': ['Headstone'],
    '🪧': ['Placard'],
    '🪒': ['Ξύρισμα']
};